export const translate_extra = {
  shen_luxun: "神陆逊",
  nzry_junlve: "军略",
  nzry_junlve_info:
    "锁定技，当你受到或造成伤害后，你获得X个“军略”标记(X为伤害点数)",
  nzry_cuike: "摧克",
  nzry_cuike_info:
    "出牌阶段开始时，若“军略”标记的数量为奇数，你可以对一名角色造成一点伤害；若“军略”标记的数量为偶数，你可以横置一名角色并弃置其区域内的一张牌。然后，若“军略”标记的数量超过7个，你可以移去全部“军略”标记并对所有其他角色造成一点伤害",
  nzry_dinghuo: "绽火",
  nzry_dinghuo_info:
    "限定技，出牌阶段，你可以移去全部“军略”标记，令至多等量的已横置角色弃置所有装备区内的牌。然后，你对其中一名角色造成1点火焰伤害。",
  shen_liubei: "神刘备",
  nzry_longnu: "龙怒",
  nzry_longnu_info:
    "转换技，锁定技，阴：出牌阶段开始时，你失去1点体力并摸一张牌，然后本阶段内你的红色手牌均视为火【杀】且无距离限制。阳：出牌阶段开始时，你减1点体力上限并摸一张牌，然后本阶段内你的锦囊牌均视为雷【杀】且无使用次数限制。",
  nzry_jieying: "结营",
  nzry_jieying_info:
    "锁定技，游戏开始时或当你的武将牌重置时，你横置；所有已横置的角色手牌上限+2；结束阶段，你横置一名其他角色。",

  shen_ganning: "神甘宁",
  shen_zhangliao: "神张辽",

  drlt_poxi: "魄袭",
  drlt_poxi_info:
    "出牌阶段限一次，你可以观看一名其他角色的手牌，然后你可以弃置你与其手牌中的四张花色不同的牌。若如此做，根据此次弃置你的牌的数量执行以下效果：零张，扣减一点体力上限；一张，你结束出牌阶段且本回合手牌上限-1；三张，你回复一点体力；四张，你摸四张牌",
  drlt_jieying: "劫营",
  drlt_jieying_info:
    "回合开始时，若场上没有拥有“营”标记的角色，你获得1个“营”标记；结束阶段，你可以将你的一个“营”标记交给一名角色；有“营”标记的角色摸牌阶段多摸一张牌，出牌阶段使用【杀】的次数上限+1，手牌上限+1。有“营”的其他角色回合结束时，其移去“营”标记，然后你获得其所有手牌。",
  drlt_jieying_mark: "劫营",
  drlt_duorui1: "失效技能",
  drlt_duorui1_bg: "锐",
  drlt_duorui: "夺锐",
  drlt_duorui_info:
    "当你于出牌阶段内对一名其他角色造成伤害后，你可以废除你装备区内的一个装备栏（若已全部废除则可以跳过此步骤），然后获得该角色的一个技能直到其的下回合结束或其死亡(觉醒技，限定技，主公技，隐匿技，使命技等特殊技能除外)。若如此做，该角色该技能失效且你不能再发动〖夺锐〗直到你失去以此法获得的技能。",
  drlt_zhiti: "止啼",
  drlt_zhiti_info:
    "锁定技，你攻击范围内已受伤的其他角色手牌上限-1；当你拼点或【决斗】胜利，或受到伤害后，你恢复一个装备栏",

  shen_zhaoyun: "神赵云",
  shen_guanyu: "神关羽",
  shen_lvmeng: "神吕蒙",
  shen_simayi: "神司马懿",
  shen_caocao: "神曹操",
  shen_zhugeliang: "神诸葛亮",
  shen_zhouyu: "神周瑜",
  shen_lvbu: "神吕布",
  xinjuejing: "绝境",
  xinjuejing_info:
    "锁定技，你的手牌上限+2；当你进入或脱离濒死状态时，你摸一张牌。",
  relonghun: "龙魂",
  relonghun_info:
    "你可以将同花色的一至两张牌按下列规则使用或打出：红桃当【桃】，方块当火【杀】，梅花当【闪】，黑桃当普【无懈可击】。若你以此法使用了两张红色牌，则此牌回复值或伤害值+1。若你以此法使用了两张黑色牌，则你弃置当前回合角色一张牌。",
  xinlonghun: "龙魂",
  xinlonghun_info:
    "你可以将你的手牌按下列规则使用或打出：红桃当【桃】，方块当火【杀】，梅花当【闪】，黑桃当普【无懈可击】。",
  longhun: "龙魂",
  longhun1: "龙魂♥︎",
  longhun2: "龙魂♦︎",
  longhun3: "龙魂♠︎",
  longhun4: "龙魂♣︎",
  juejing: "绝境",
  longhun_info:
    "你可以将同花色的X张牌按下列规则使用或打出：红桃当【桃】，方块当具火焰伤害的【杀】，梅花当【闪】，黑桃当【无懈可击】（X为你当前的体力值且至少为1）",
  juejing_info:
    "锁定技，摸牌阶段，你摸牌的数量改为你已损失的体力值+2；你的手牌上限+2。",
  wushen: "武神",
  wushen_info:
    "锁定技，你的红桃手牌均视为【杀】；锁定技，你使用红桃【杀】无距离和次数限制且不可被响应。",
  wuhun: "武魂",
  wuhun21: "武魂",
  wuhun22: "武魂",
  wuhun23: "武魂",
  wuhun2: "武魂",
  wuhun3: "武魂",
  wuhun_info_alter:
    "锁定技，当你受到1点伤害后，你令伤害来源获得1枚“梦魇”标记；当你死亡时，你令拥有最多“梦魇”标记的一名其他角色判定，若结果不为【桃】或【桃园结义】，则该角色死亡。",
  wuhun_info: "锁定技，杀死你的角色立即进入濒死状态",
  shelie: "涉猎",
  gongxin: "攻心",
  gongxin_discard: "弃置",
  gongxin_top: "牌堆顶",
  renjie: "忍戒",
  renjie2: "忍戒",
  renjie_info:
    "锁定技，当你受到1点伤害后，你获得一枚“忍”标记；锁定技，当你于弃牌阶段内弃置牌后，你获得等同于失去的牌数量的“忍”标记。",
  sbaiyin: "拜印",
  sbaiyin_info:
    "觉醒技，准备阶段开始时，若你的“忍”标记数不小于4，你减1点体力上限，然后获得〖极略〗",
  jilue: "极略",
  jilue_info:
    "当一名角色的判定牌生效前，你可以弃1枚“忍”标记并发动〖鬼才〗；每当你受到伤害后，你可以弃1枚“忍”标记并发动〖放逐〗；当你使用锦囊牌时，你可以弃1枚“忍”标记并发动〖集智〗；出牌阶段限一次，你可以弃1枚“忍”标记并发动〖制衡〗；出牌阶段，你可以弃1枚“忍”标记并获得〖完杀〗直到回合结束。",
  jilue_guicai: "鬼才",
  jilue_fangzhu: "放逐",
  jilue_wansha: "完杀",
  jilue_zhiheng: "制衡",
  jilue_jizhi: "集智",
  lianpo: "连破",
  lianpo_info:
    "一名角色的回合结束时，若你本回合内杀死过角色，则你可以进行一个额外的回合。",
  guixin: "归心",
  qinyin: "琴音",
  yeyan: "业炎",
  shelie_info:
    "摸牌阶段，你可以改为从牌堆顶亮出五张牌，然后选择获得不同花色的牌各一张。",
  gongxin_info:
    "出牌阶段限一次，你可以观看一名其他角色的手牌，并可以展示其中一张红桃牌，然后将其弃置或置于牌堆顶。",
  guixin_info:
    "当你受到1点伤害后，你可以获得每名其他角色区域里的一张牌，然后你翻面",
  guixin_info_alter:
    "当你受到1点伤害后，你可以随机获得每名其他角色区域里的一张牌，然后你翻面",
  qinyin_info:
    "弃牌阶段结束时，若你于此阶段内弃置过两张或更多的牌，则你可以选择一项：1. 令所有角色各回复1点体力；2. 令所有角色各失去1点体力。",
  // qinyin_info:'每当你于弃牌阶段内因你的弃置而失去第X张手牌时（X至少为2），你可以选择一项：1.令所有角色各回复1点体力；2.令所有角色各失去1点体力。每阶段限一次。',
  yeyan_info:
    "限定技，出牌阶段，你可以对一至三名角色造成至多共3点火焰伤害（你可以任意分配每名目标角色受到的伤害点数），若你将对一名角色分配2点或更多的火焰伤害，你须先弃置四张不同花色的手牌再失去3点体力。",
  qixing: "七星",
  qixing_bg: "星",
  qixing2: "七星",
  qixing3: "七星",
  qixing_info:
    "游戏开始时，你将牌堆顶的七张牌置于你的武将牌上，称之为“星”。然后/摸牌阶段结束后，你可用任意数量的手牌等量交换这些“星”。",
  dawu: "大雾",
  dawu2_bg: "雾",
  dawu2: "大雾",
  dawu3: "大雾",
  // dawu2_info:'已获得大雾标记',
  dawu_info:
    "结束阶段，你可以弃置X张“星”并指定等量的角色：直到你的下回合开始，当这些角色受到非雷电伤害时，防止此伤害。",
  kuangfeng: "狂风",
  kuangfeng2: "狂风",
  kuangfeng2_bg: "风",
  // kuangfeng2_info:'已获得狂风标记',
  kuangfeng3: "狂风",
  kuangfeng_info:
    "结束阶段，你可以弃置1张“星”并指定一名角色：直到你的下回合开始，该角色受到火焰伤害时，此伤害+1。",
  baonu: "狂暴",
  baonu_bg: "暴",
  baonu_info:
    "锁定技，游戏开始时，你获得两枚“暴怒”标记；锁定技，当你造成/受到1点伤害后，你获得1枚“暴怒”标记。",
  shenfen: "神愤",
  shenfen_info:
    "限定技，出牌阶段，你可以弃置6枚暴怒标记，对场上所有其他角色造成一点伤害，然后令其弃置4张牌",
  wuqian: "无前",
  wuqian_info: "出牌阶段，你可以弃置两枚暴怒标记并获得技能【无双】直到回合结束",
  wumou: "无谋",
  wumou_info:
    "锁定技，当你使用普通锦囊牌时，你选择一项：1.弃置1枚“暴怒”标记；2.失去1点体力。",
  ol_wuqian: "无前",
  ol_wuqian_info:
    "出牌阶段，你可以弃置2枚“暴怒”标记并选择一名本回合内未选择过的其他角色，你获得技能〖无双〗并令其防具无效直到回合结束。",
  ol_shenfen: "神愤",
  ol_shenfen_info:
    "出牌阶段限一次，你可以弃置6枚“暴怒”标记并选择所有其他角色，对这些角色各造成1点伤害。然后这些角色先各弃置其装备区里的牌，再各弃置四张手牌。最后你将你的武将牌翻面。",
  new_wuhun: "武魂",
  new_wuhun_info:
    "锁定技，当你受到伤害后，伤害来源获得X个“梦魇”标记（X为伤害点数）。锁定技，当你死亡时，你选择一名“梦魇”标记数量最多的其他角色。该角色进行判定：若判定结果不为【桃】或【桃园结义】，则该角色死亡。",
  new_guixin: "归心",
  new_guixin_info:
    "当你受到1点伤害后，你可以按照你选择的区域优先度随机获得每名其他角色区域里的一张牌，然后你翻面。",
  ol_zhangliao: "OL神张辽",
  olduorui: "夺锐",
  olduorui2: "夺锐",
  olduorui_info:
    "当你于出牌阶段内对一名角色造成伤害后，你可以选择该角色武将牌上的一个技能。若如此做，你结束出牌阶段，且你令此技能于其下个回合结束之前无效。",
  olzhiti: "止啼",
  olzhiti_info:
    "锁定技，你攻击范围内已受伤角色的手牌上限-1。若场上已受伤的角色数：不小于1，你的手牌上限+1；不小于3，你于摸牌阶段开始时令额定摸牌数+1；不小于5，回合结束时，你废除一名角色的一个随机装备栏。",
  shen_caopi: "神曹丕",
  chuyuan: "储元",
  chuyuan_info:
    "一名角色受到伤害后，若你武将牌上「储」的数量小于体力上限，你可以令其摸一张牌。然后其将一张手牌置于你的武将牌上，称为「储」。",
  //chuyuan_info:'一名角色受到伤害后，你可以令其摸一张牌。然后其将一张手牌置于你的武将牌上，称为「储」。你的手牌上限+X（X为你武将牌上的「储」数）。',
  dengji: "登极",
  dengji_info:
    "觉醒技，准备阶段，若你武将牌上的「储」数不小于3，则你减1点体力上限并获得所有「储」，然后获得技能〖天行〗和〖奸雄〗",
  tianxing: "天行",
  tianxing_info:
    "觉醒技，准备阶段，若你武将牌上的「储」数不小于3，则你减1点体力上限并获得所有「储」，然后失去技能〖储元〗，选择获得以下技能中的一个：〖仁德〗/〖制衡〗/〖乱击〗/〖行动〗",
  shen_zhenji: "神甄宓",
  shenfu: "神赋",
  shenfu_info:
    "回合结束时，若你的手牌数为：奇数，你可对一名其他角色造成1点雷属性伤害。若其死亡，你可重复此流程。偶数，你可选择一名角色，你令其摸一张牌或弃置一张手牌。若其手牌数等于体力值，你可重复此流程。",
  qixian: "七弦",
  qixian_info: "锁定技，你的手牌上限视为7。",
  caopi_xingdong: "行动",
  caopi_xingdong_info:
    "出牌阶段限一次，你可以将一张【杀】或普通锦囊牌交给一名其他角色，然后该角色选择一项：对除你以外的角色使用此牌并在此牌结算完成后和你各摸一张牌；或跳过下回合的判定阶段和摸牌阶段。",
  shen_diaochan: "神貂蝉",
  meihun: "魅魂",
  meihun_info:
    "结束阶段或当你成为【杀】的目标后，你可以令一名其他角色交给你一张你声明的花色的手牌，若其没有则你观看其手牌然后弃置其中一张。",
  huoxin_control: "惑心",
  huoxin: "惑心",
  huoxin_info:
    "出牌阶段限一次，你可以展示两张花色相同的手牌并分别交给两名其他角色，然后令这两名角色拼点，没赢的角色获得1个“魅惑”标记。拥有2个或更多“魅惑”的角色回合即将开始时，该角色移去其所有“魅惑”，此回合改为由你操控。",
  mini_zhugeliang: "SP神诸葛亮",
  minikuangfeng: "狂风",
  minikuangfeng_info:
    "出牌阶段结束时，你可选择任意名角色并将等量的“星”置入弃牌堆，然后对这些角色各造成1点伤害。",
  minidawu: "大雾",
  minidawu2: "大雾",
  minidawu_info:
    "结束阶段，你可以将一张“星”置入弃牌堆。当你于下回合开始前受到伤害时，此伤害-1。",
  mini_lvbu: "SP神吕布",
  miniwuqian: "无前",
  miniwuqian_info:
    "锁定技，当你于回合内使用【杀】或【决斗】指定目标后，若此牌是你本回合内使用的第一张【杀】或【决斗】，则你令其每次响应此牌需要使用的【闪】或打出的【杀】的数量+1，且令其防具无效直到此牌对其结束。",
  minishenfen: "神愤",
  minishenfen_info:
    "限定技，出牌阶段，你可以失去3点体力，对所有其他角色各造成1点伤害。这些角色弃置装备区内的所有牌，然后弃置四张手牌。",
  mini_lvmeng: "SP神吕蒙",
  minigongxin: "攻心",
  minigongxin_info:
    "每回合限一次，当你使用牌指定其他角色为唯一目标后，或成为其他角色使用牌的唯一目标后，你可观看对方的手牌。然后你可以展示其中的一张红色牌并选择一项：①获得此牌。②将此牌置于牌堆顶。",
  boss_zhaoyun: "高达一号",
  boss_zhaoyun_ab: "神赵云",
  boss_juejing: "绝境",
  boss_juejing2: "绝境",
  boss_juejing_info:
    "锁定技，摸牌阶段开始前，你跳过此阶段。当你获得牌/失去手牌后，若你的手牌数大于4/小于4，则你将手牌摸至4张/弃置至4张。",
  zhanjiang: "斩将",
  zhanjiang_info:
    "准备阶段开始时，如果其他角色的装备区内有【青釭剑】，你可以获得之",
  shen_guojia: "神郭嘉",
  shuishi: "慧识",
  shuishi_info:
    "出牌阶段限一次，若你的体力上限小于10，则你可选择一名角色。你令其摸一张牌，若其以此法获得的牌：与该角色的其他手牌花色均不相同，则你加1点体力上限，若你的体力上限小于10，则你可以重复此流程；否则你减1点体力上限，且其展示所有手牌。",
  stianyi: "天翊",
  stianyi_info:
    "觉醒技，准备阶段，若场上的所有存活角色均于本局游戏内受到过伤害，则你加2点体力上限并回复1点体力，然后令一名角色获得技能〖佐幸〗。",
  zuoxing: "佐幸",
  zuoxing2: "佐幸",
  zuoxing_info:
    "出牌阶段限一次，若令你获得〖佐幸〗的角色存活且体力上限大于1，则你可以令其减1点体力上限，并视为一张普通锦囊牌。",
  sghuishi: "辉逝",
  sghuishi_info:
    "限定技，出牌阶段，你可以选择一名其他角色：若其有未发动过的觉醒技，则你令其发动这些觉醒技时无视原有条件；否则其摸四张牌。然后你减2点体力上限。",
  shen_taishici: "神太史慈",
  dulie: "笃烈",
  dulie_info:
    "锁定技。当你成为【杀】的目标时，若使用者的体力值大于你，则你进行判定。若结果为红桃，则取消此目标。",
  tspowei: "破围",
  tspowei_info:
    "使命技。①游戏开始时，你令所有其他角色获得一个“围”。②一名角色受到伤害后，若其有“围”，则其移去“围”。③回合开始时，你选择所有有“围”的角色。这些角色失去“围”，然后这些角色的第一个不为你的下家获得等量的“围”。④一名其他角色的回合开始时，若其有“围”，则你可以选择一项：⒈弃置一张手牌并对其造成1点伤害。⒉若其体力值不大于你，则你获得其一张手牌。选择完成后，你视为在其攻击范围内直到回合结束。⑤使命：回合开始时，若场上没有“围”，则你获得技能〖神著〗。⑥失败：当你进入濒死状态时，你将体力值回复至1点，然后弃置装备区的所有牌。",
  shenzhu: "神著",
  shenzhu_info:
    "锁定技，当你使用有对应实体牌的非转化【杀】结算结束后，你选择一项：①摸一张牌，且本回合使用【杀】的次数上限+1。②摸三张牌，且本回合不能再使用【杀】。",
  dangmo: "荡魔",
  dangmo_info:
    "当你于出牌阶段内使用第一张【杀】选择目标后，你可以为此牌增加至多Y-1个目标（Y为你的体力值）。",
  reshuishi: "慧识",
  reshuishi_info:
    "出牌阶段限一次，若你的体力上限小于10，你可进行判定牌不置入弃牌堆的判定。若判定结果与本次发动技能时的其他判定结果的花色均不相同且你的体力上限小于10，则你加1点体力上限并重复此流程。然后你将所有位于处理区的判定牌交给一名角色。若其手牌数为全场最多，则你减1点体力上限。",
  resghuishi: "辉逝",
  resghuishi_info:
    "限定技，出牌阶段，你可选择一名角色。若你的体力上限不小于存活人数且其有未发动的觉醒技，则你令其中一个技能无视发动条件；否则其摸四张牌。然后你减2点体力上限。",
  qizhengxiangsheng: "奇正相生",
  qizhengxiangsheng_info:
    "出牌阶段，对一名其他角色使用。你将目标角色标记为“奇兵”或“正兵”（对其他角色不可见）。然后目标角色可以打出一张【杀】或【闪】。若其是“奇兵”且未打出【杀】，则你对其造成1点伤害；若其是“正兵”且未打出【闪】，则你获得其一张牌。",
  shen_xunyu: "神荀彧",
  tianzuo: "天佐",
  tianzuo_info:
    "锁定技。①游戏开始时，你将8张【奇正相生】加入牌堆。②【奇正相生】对你无效。",
  lingce: "灵策",
  lingce_info:
    "锁定技。当有【奇正相生】或智囊或〖定汉①〗记录过的锦囊牌被使用时，若此牌不为转化牌且对应实体牌数量为1，则你摸一张牌。",
  dinghan: "定汉",
  dinghan_info:
    "①当你成为未记录过的锦囊牌的目标时，你记录此牌名并取消之。②准备阶段，你可在〖定汉①〗的记录中添加或减少一种锦囊牌的牌名。",
  shen_sunce: "神孙策",
  yingba: "英霸",
  yingba_info:
    "①出牌阶段限一次，你可令一名体力上限大于1的其他角色减少1点体力上限并获得“平定”标记，然后你减少1点体力上限。②你对拥有“平定”标记的角色使用牌没有距离限制。",
  scfuhai: "覆海",
  scfuhai_info:
    "锁定技。①当你使用牌指定目标后，若目标角色有“平定”标记，则其不可响应此牌。若你本回合内以此法获得的牌数小于2，则你摸一张牌。②拥有“平定”标记的角色死亡时，你增加X点体力上限并摸X张牌。（X为其拥有的“平定”标记数）。",
  pinghe: "冯河",
  pinghe_info:
    "锁定技。①你的手牌上限基数等于你已损失的体力值。②当你受到其他角色造成的伤害时，若你有牌且你的体力上限大于1，则你防止此伤害，减一点体力上限并将一张手牌交给一名其他角色。然后若你拥有〖英霸〗，则伤害来源获得一个“平定”标记。",
  shen_jiangwei: "神姜维",
  jiufa: "九伐",
  jiufa_info:
    "①当你声明使用或打出牌时，你记录此牌的牌名。②当你使用或打出的牌结算结束后，若你的〖九伐〗记录中包含至少⑨种不同的牌名，则你可以展示牌堆顶的⑨张牌，选择并获得其中任意张点数各不相同且{这九张牌中存在未被选择且和已选择的牌点数相同}的牌，清除所有的记录，将其余牌置入弃牌堆。",
  tianren: "天任",
  tianren_info:
    "锁定技。①当有一张基本牌或普通锦囊牌不因使用而进入弃牌堆后，你获得一枚“天任”标记。②当你获得“天任”标记或体力上限变化后，若你的“天任”数不小于X，则你移去X枚“天任”，加1点体力上限并摸两张牌（X为你的体力上限）。",
  pingxiang: "平襄",
  pingxiang_info:
    "限定技。出牌阶段，若你的体力上限大于⑨，则你可减⑨点体力上限，视为使用至多⑨张火【杀】，然后失去〖九伐〗，并将手牌上限基数改为体力上限直到游戏结束。",
  shen_sunquan: "神孙权",
  dili: "帝力",
  dili_info:
    '锁定技。游戏开始时，你随机获得一条<span style="font-family: yuanli">东吴命运线</span>。',
  yuheng: "驭衡",
  yuheng_info:
    '①出牌阶段限一次。你可以失去所有不为〖驭衡〗的非锁定技，然后随机获得全部<span style="font-family: yuanli">东吴命运线</span>涉及的一个技能。若你本阶段内没有发动过其他非锁定技，则你随机获得当前<span style="font-family: yuanli">东吴命运线</span>涉及的一个内容。②出牌阶段结束时，若你未于本阶段内发动过〖驭衡①〗，则你失去1点体力。',
  yuheng_append:
    '<span style="font-family: yuanli">天下英雄谁敌手？曹刘。生子当如孙仲谋！</span>',
  dili_shengzhi: "圣质",
  dili_shengzhi_info:
    "锁定技。若你因〖驭衡〗获得过〖英魂〗〖弘德〗〖秉壹〗，则当你使用点数为质数的牌时，此牌不可被响应。",
  dili_chigang: "持纲",
  dili_chigang_info:
    "锁定技。若你因〖驭衡〗获得过〖观微〗〖弼政〗〖安国〗，则当你的判定阶段开始前，你跳过此阶段并获得一个额外的摸牌阶段。",
  dili_qionglan: "穹览",
  dili_qionglan_info:
    '锁定技，限定技。若你因〖驭衡〗获得过〖涉猎〗〖问卦〗〖博图〗，则当你发动的〖驭衡〗结算结束后，你随机获得两条其他<span style="font-family: yuanli">东吴命运线</span>。',
  dili_quandao: "权道",
  dili_quandao_info:
    "锁定技。若你因〖驭衡〗获得过〖制衡〗〖诫训〗〖安恤〗，则你手牌区内点数为字母的牌的牌名视为【调剂盐梅】。",
  dili_jiaohui: "交辉",
  dili_jiaohui_info:
    "锁定技。若你因〖驭衡〗获得过〖下书〗〖结姻〗〖缔盟〗，且你的手牌数为1，则此牌的牌名视为【远交近攻】。",
  dili_yuanlv: "渊虑",
  dili_yuanlv_info:
    "锁定技。若你因〖驭衡〗获得过〖观潮〗〖决堰〗〖澜江〗，则当你成为自己使用的不为【长安大舰】的装备牌的目标后，你将此牌置于弃牌堆，然后使用一张与此装备牌副类别相同的【长安大舰】。",
  changandajian_equip1: "长安大舰",
  changandajian_equip2: "长安大舰",
  changandajian_equip3: "长安大舰",
  changandajian_equip4: "长安大舰",
  changandajian_equip5: "长安大舰",
  changandajian_equip6: "长安大舰",
  changandajian_destroy: "长安大舰",
  changandajian_equip1_info:
    "锁定技。当你失去装备区内的【长安大舰】后，你销毁之。然后你选择场上的一张牌。若此牌点数为字母，则你获得之，否则弃置之。",
  changandajian_equip2_info:
    "锁定技。当你失去装备区内的【长安大舰】后，你销毁之并回复1点体力。然后你选择场上的一张牌。若此牌点数为字母，则你获得之，否则弃置之。",
  changandajian_equip3_info:
    "锁定技。其他角色至你的距离+2。当你失去装备区内的【长安大舰】后，你销毁之。然后你选择场上的一张牌。若此牌点数为字母，则你获得之，否则弃置之。",
  changandajian_equip4_info:
    "锁定技。你至其他角色的距离-2。当你失去装备区内的【长安大舰】后，你销毁之。然后你选择场上的一张牌。若此牌点数为字母，则你获得之，否则弃置之。",
  changandajian_equip5_info:
    "锁定技。你的手牌上限+2。当你失去装备区内的【长安大舰】后，你销毁之。然后你选择场上的一张牌。若此牌点数为字母，则你获得之，否则弃置之。",
  changandajian_equip6_info:
    "锁定技。你至其他角色的距离-2，其他角色至你的距离+2。当你失去装备区内的【长安大舰】后，你销毁之。然后你选择场上的一张牌。若此牌点数为字母，则你获得之，否则弃置之。",
  shen_machao: "神马超",
  shouli: "狩骊",
  shouli_backup: "狩骊",
  shouli_info:
    "锁定技。①游戏开始时，你令场上所有角色从你的下家起，依次使用牌堆中的一张不为赠物的坐骑牌。②你可以将场上的一张进攻坐骑牌当做【杀】（无任何次数限制），防御坐骑牌当做【闪】使用或打出。若此坐骑牌的拥有者不为你，则其非锁定技于本回合内失效。且当你或其于本回合内受到伤害时，此伤害+1且改为雷属性。",
  hengwu: "横骛",
  hengwu_info:
    "当你使用或打出有花色的牌时，若你的手牌区内没有与此牌花色相同的牌，则你可以摸X张牌（X为场上装备区内花色与此牌相同的牌数）。",
  hengwu_append: '<span style="font-family: yuanli">棘手，怀念，摧毁！</span>',

  key_kagari: "篝",
  kagari_zongsi: "纵丝",
  kagari_zongsi_info:
    "出牌阶段限一次，你可以选择一张不在游戏外的牌，然后将其置于牌堆/弃牌堆的顶部/底部或一名角色的对应区域内。",
  key_shiki: "神山识",
  key_shiki_ab: "神山识",
  shiki_omusubi: "御结",
  shiki_omusubi_info:
    "一轮游戏开始时，你可以减1点体力上限，然后将一名其他角色武将牌上的技能加入到你的武将牌上。",
  shiki_omusubi_append:
    '<span style="font-family: yuanli">来吧，羽依里。用你的手，让我变成那只真正的鬼吧！</span>',
  db_key_hina: "佐藤雏",
  hina_shenshi: "神视",
  hina_shenshi_yingbian: "神视",
  hina_shenshi_info:
    "神势力技。出牌阶段开始时/结束时，你可摸两张牌，然后将其中一张牌置于牌堆顶。你以此法获得的牌视为拥有全部应变效果，且可以无条件发动。",
  hina_xingzhi: "幸凪",
  hina_xingzhi_info:
    "键势力技。每回合限一次，你可以通过“助战”触发一张牌的全部应变效果，且响应助战的角色摸两张牌。",
  tw_shen_guanyu: "TW神关羽",
  twwushen: "武神",
  twwushen_info:
    "锁定技。①你的♥手牌均视为普【杀】。②你于每阶段使用的第一张【杀】不可被响应。③你使用♥【杀】无距离和次数限制。④当你使用♥【杀】选择目标后，你令所有拥有“梦魇”标记的角色均成为此【杀】的目标。",
  twwuhun: "武魂",
  twwuhun_info:
    "锁定技。①当你受到其他角色造成的1点伤害后，你令伤害来源获得1枚“梦魇”标记。②当你对有“梦魇”标记的其他角色造成伤害后，你令其获得一枚“梦魇”标记。③当你死亡时，你可进行判定。若结果不为【桃】或【桃园结义】，则你选择至少一名拥有“梦魇”标记的角色。令这些角色各自失去X点体力（X为其“梦魇”标记数）。",

  extra_feng: "神话再临·风",
  extra_huo: "神话再临·火",
  extra_lin: "神话再临·林",
  extra_shan: "神话再临·山",
  extra_yin: "神话再临·阴",
  extra_lei: "神话再临·雷",
  extra_key: "论外",
  extra_ol: "神话再临OL",
  extra_mobilezhi: "始计篇·智",
  extra_mobilexin: "始计篇·信",
  extra_offline: "神话再临·线下",
  extra_mini: "欢乐三国杀",
  extra_decade: "十周年服神将",
  extra_tw: "海外服神将",
};

export const translate_diy = {
  diy_liufu: "刘馥",
  diy_xizhenxihong: "习珍习宏",
  diy_liuzan: "留赞",
  diy_zaozhirenjun: "枣祗任峻",
  diy_yangyi: "杨仪",
  diy_tianyu: "田豫",

  // diy_caocao:'曹操',
  diy_menghuo: "孟获",
  diy_huangzhong: "黄汉升",
  diy_xuhuang: "徐公明",
  diy_dianwei: "新典韦",
  diy_weiyan: "魏文长",
  xicai: "惜才",
  diyjianxiong: "奸雄",
  diy_feishi: "费诗",
  nsshuaiyan: "率言",
  moshou: "墨守",
  diy_hanlong: "韩龙",
  diy_luxun: "陆伯言",
  diy_yuji: "于吉",
  diy_zhouyu: "周公瑾",
  diy_lukang: "陆抗",
  diy_caiwenji: "蔡昭姬",
  diy_zhenji: "甄宓",

  ns_zuoci: "左慈",
  ns_wangyun: "王允",
  ns_lvzhi: "吕后",
  ns_nanhua: "南华",
  ns_nanhua_left: "幻身·左",
  ns_nanhua_right: "幻身·右",
  ns_huamulan: "SP花木兰",
  ns_huangzu: "黄祖",
  ns_yanliang: "颜良",
  ns_wenchou: "文丑",
  ns_jinke: "荆轲",

  ns_caocao: "曹操",
  ns_zhugeliang: "诸葛亮",
  ns_wangyue: "王越",
  ns_yuji: "于吉",
  ns_caocaosp: "SP曹操",
  ns_xinxianying: "辛宪英",
  ns_sunjian: "孙坚",
  ns_simazhao: "司马昭",
  ns_guanlu: "管辂",

  ns_duangui: "段珪",
  ns_shenpei: "审配",
  ns_zhangbao: "张宝",
  ns_masu: "马谡",
  ns_zhangxiu: "张绣",
  ns_lvmeng: "吕蒙",

  ns_yujisp: "于吉",
  ns_lisu: "李肃",
  ns_yangyi: "杨仪",
  ns_liuzhang: "刘璋",
  ns_xinnanhua: "南华老仙",
  ns_luyusheng: "陆郁生",

  sp_key_yuri: "SP仲村由理",
  key_lucia: "此花露西娅",
  key_kyousuke: "枣恭介",
  key_yuri: "仲村由理",
  key_haruko: "神尾晴子",
  key_umi: "加藤うみ",
  key_umi2: "鹰原羽未",
  key_rei: "零",
  key_komari: "神北小毬",
  key_yukine: "宫泽有纪宁",
  key_yusa: "西森柚咲",
  key_misa: "黑羽美砂",
  key_masato: "井之原真人",
  key_iwasawa: "岩泽雅美",
  key_kengo: "宫泽谦吾",
  key_yoshino: "吉野晴彦",
  key_yui: "由依",
  key_tsumugi: "紬文德斯",
  key_saya: "朱鹭户沙耶",
  key_harukakanata: "三枝叶留佳&二木佳奈多",
  key_harukakanata_ab: "三枝二木",
  key_inari: "稻荷",
  key_shiina: "椎名",
  key_sunohara: "春原阳平&春原芽衣",
  key_sunohara_ab: "阳平芽衣",
  //该武将国战模式下不可用
  key_rin: "枣铃",
  key_sasami: "笹濑川佐佐美",
  key_akane: "千里朱音",
  key_doruji: "多鲁基",
  key_yuiko: "来谷唯湖",
  key_riki: "直枝理树" /*+'子'*/,
  key_hisako: "高桥久子",
  key_hinata: "日向秀树",
  key_noda: "野田",
  key_tomoya: "冈崎朋也",
  key_nagisa: "古河渚",
  key_ayato: "直井文人",
  key_ao: "空门苍",
  key_yuzuru: "音无结弦",
  sp_key_kanade: "SP立华奏",
  key_mio: "西园美鱼",
  key_midori: "西园美鸟",
  key_kyoko: "岬镜子",
  key_shizuru: "中津静流",
  key_shiorimiyuki: "关根诗织&入江美雪",
  key_shiorimiyuki_ab: "关根入江",
  key_miki: "野村美希",
  key_shiori: "美坂栞",
  key_kaori: "美坂香里",
  key_akiko: "水濑秋子",
  key_abyusa: "游佐",
  key_godan: "松下护騨",
  key_yuu: "乙坂有宇",
  key_ryoichi: "三谷良一",
  key_kotori: "神户小鸟",
  key_jojiro: "高城丈士朗",
  key_shiroha: "鸣濑白羽",
  key_shizuku: "水织静久",
  key_hiroto: "铃木央人",
  key_sakuya: "凤咲夜",
  key_youta: "成神阳太",
  key_rumi: "七濑留美",
  key_chihaya: "凤千早",
  key_yukito: "国崎往人",
  key_crow: "小空",
  key_asara: "井上晶",
  key_kotomi: "一之濑琴美",
  key_mia: "藤川米娅",
  key_kano: "雾岛佳乃",
  db_key_liyingxia: "李映夏",
  key_erika: "苍井えりか",
  key_satomi: "藏里见",
  lucia_duqu: "毒躯",
  lucia_duqu_info:
    "锁定技，①当你对其他角色造成伤害或受到其他角色的伤害时，你令对方获得一张花色点数随机的【毒】。<br>②当你因【毒】失去体力时，你改为回复等量的体力。",
  lucia_zhenren: "振刃",
  lucia_zhenren_info:
    "锁定技，每个结束阶段，若你的装备区内有牌，则你弃置之。然后，你依次弃置场上的X张牌。（X为你以此法弃置的牌数）",
  nk_shekong: "设控",
  nk_shekong_info:
    "出牌阶段限一次，你可以弃置任意张手牌并选择一名其他角色（不能超过该角色的牌数），然后令其选择一项：弃置一张牌并令你摸X张牌，或弃置X张牌并令你摸一张牌。然后，你将你与其弃置的且位于弃牌堆中的牌以任意顺序置于牌堆顶。",
  key_huanjie: "幻界",
  key_huanjie_info:
    "锁定技，当你进行判定或摸牌时，你改为从牌堆的另一端获取相应的牌。",
  yuri_xingdong: "行动",
  yuri_xingdong_info:
    "锁定技，出牌阶段开始时，你获得一张【杀】或普通锦囊牌。出牌阶段限一次，你可以将一张【杀】或普通锦囊牌交给一名其他角色，然后该角色选择一项：对除你以外的角色使用此牌并在此牌结算完成后和你各摸一张牌；或跳过下回合的判定阶段和摸牌阶段。",
  //目标角色跳过阶段的同时 该回合不能发动〖整经(郑玄)〗
  yuri_wangxi: "忘隙",
  yuri_wangxi_info:
    "主公技，限定技，当有角色因你发动的【行动】而死亡后，若其身份不为【明忠】，则其可以将身份改为忠臣并重新加入游戏，然后将势力改为与你相同，将体力值回复至2点并摸一张牌。",
  haruko_haofang: "豪放",
  haruko_haofang_info:
    "锁定技，你的延时锦囊牌视为【无中生有】。当你因执行【无中生有】的效果而摸牌时，你令摸牌数+2。",
  haruko_zhuishi: "追逝",
  haruko_zhuishi_info:
    "一名角色的判定阶段开始时，若其判定区内有牌，则你可以获得其判定区内的所有牌。若你的体力值大于1，你失去1点体力。",
  umi_chaofan: "炒饭",
  umi_chaofan_info:
    "出牌阶段限一次，你可以弃置两张花色不同的手牌并选择一名其他角色。你摸一张牌，若你的体力值：大于2，目标角色回复1点体力；等于2，目标角色摸两张牌；小于2，目标角色受到1点无来源且对应渠道为这两张牌的火焰伤害。",
  umi_lunhui: "轮回",
  umi_lunhui_info:
    "一名其他角色的回合结束时，若你的手牌数小于体力值，则你可以失去1点体力。若如此做，你摸两张牌并进行一个额外回合，且你于此回合内计算与此角色的距离视为1。",
  umi_shiroha: "轮回 - 延时效果",
  umi_qihuan: "七幻",
  umi_qihuan_info:
    "限定技，当你处于濒死状态时，你可以移去此武将牌。若如此做，你回复X点体力（X为场上势力数）。然后，你可获得场上已死亡角色武将牌上的至多两个技能。",
  komari_tiankou: "甜口",
  komari_tiankou_info:
    "锁定技，当你使用红色的非伤害性基本牌/锦囊牌选择目标时，或成为其他角色使用的这些牌的目标时，你选择一项：1.摸一张牌；2.为此牌增加一个目标",
  komari_xueshang: "血殇",
  komari_xueshang_info:
    "锁定技，蓄力技，当有角色死亡时，你对自己造成<span class=yellowtext>1</span>点伤害，然后对所有其他角色依次造成<span class=firetext>1</span>点伤害。当有角色因此法进入濒死状态时，你加1点体力上限并回复1点体力，然后失去此技能并终止此技能的所有后续结算。",
  yukine_wenzhou: "问咒",
  yukine_wenzhou_info:
    "一名角色的出牌阶段开始时，其可以交给你一张牌。若如此做，你选择一项：交给其一张牌，或令其从牌堆中获得一张与此牌类型相同的牌，且其于此阶段内使用与此牌牌名相同的牌时无法被响应。",
  //如果对自己发动【问咒】，则自己可以响应这些牌。但其他角色发动【问咒】时，该角色自己并不能响应
  yusa_yanyi: "演艺",
  yusa_yanyi_info:
    "出牌阶段限一次，你可以指定至多X名与你距离不大于你的体力值的角色。这些角色选择一项：①令你摸一张牌。②回复1点体力，然后交给你一张牌。（X为你的攻击范围且至少为1）",
  misa_yehuo: "业火",
  misa_yehuo_info:
    "一名角色的摸牌阶段开始时，若其在你的攻击范围内，你可以弃置X张牌并选择一项：①对其造成1点火属性伤害。②令其于此摸牌阶段放弃摸牌。（X为你与其的的距离）",
  yusa_misa: "通灵",
  yusa_misa_info: "当你发动的〖演艺〗结算完成之后，你可以将武将牌翻面。",
  misa_yusa: "归魂",
  misa_yusa_info: "当你发动的〖业火〗结算完成后，你可以将武将牌翻面。",
  masato_baoquan: "暴拳",
  masato_baoquan_info:
    "锁定技，当你即将造成伤害时，你选择一项：1.令此伤害+2并减1点体力上限。2.防止此伤害。",
  iwasawa_yinhang: "引吭",
  iwasawa_yinhang_info:
    "锁定技，当你的体力值变化1点时，你可以令至多两名角色摸一张牌。",
  iwasawa_mysong: "My Song",
  iwasawa_mysong_info:
    "锁定技，当你即将进行濒死结算时，取消之。回合开始时，若你的体力值小于1，则你获得技能〖奋音〗直到回合结束。回合结束时，若你的体力值小于1，你死亡。",
  iwasawa_fenyin: "奋音",
  iwasawa_fenyin_info:
    "你的回合内，当你使用牌时，若此牌与你于此回合内使用的上一张牌的颜色不同，则你可以摸一张牌。",
  iwasawa_refenyin: "奋音",
  iwasawa_refenyin_info:
    "锁定技，你的回合内，当一张牌进入弃牌堆后，若本回合内没有过与此牌花色相同的卡牌进入过弃牌堆，则你摸一张牌。",
  //卡牌花色的计算不受【红颜】等技能的影响
  kengo_weishang: "伪伤",
  kengo_weishang_sha: "伪伤",
  kengo_weishang_shan: "伪伤",
  kengo_weishang_info:
    "出牌阶段限一次，你可以废除一个装备栏并摸两张牌。若你的武器栏已废除，则你使用【杀】的次数上限+1，且当你使用【杀】指定目标后，目标角色弃置一张牌；若你的防具栏已废除，则你可以将一张牌当做【闪】使用或打出；若你的攻击/防御坐骑栏已废除，则你至其他角色的距离-1/其他角色至你的距离-1。",
  kengo_guidui: "归队",
  kengo_guidui_info:
    "锁定技，准备阶段，若你有已废除的装备栏，则你恢复这些装备栏，且本局游戏内发动【伪伤】时不能废除这些装备栏。",
  yoshino_jueyi: "决义",
  yoshino_jueyi_info:
    "出牌阶段开始时，你可以选择一名其他角色。你摸一张牌并与其猜拳（平局则重来）。若你赢，你对其造成1点伤害。若你没赢，你本阶段内使用牌时不能指定其为目标。",
  yui_jiang: "激昂",
  yui_jiang_info:
    "每当你使用（指定目标后）或被使用（成为目标后）一张【决斗】或红色的【杀】时，你可以摸一张牌。",
  yui_lieyin: "烈音",
  yui_lieyin_info:
    "锁定技，出牌阶段开始时，你选择一项：①本阶段内的红色牌均视为【杀】；②本阶段内的【杀】均视为【决斗】。",
  yui_takaramono: "珍宝",
  yui_takaramono_info:
    "觉醒技，准备阶段，若你满足以下条件中的至少两个：①体力值不大于1；②场上有已死亡的角色；③已因〖激昂〗累计获得过至少三张牌；则你获得技能〖引吭〗，将〖烈音〗描述中的「你选择」改为「你可选择」，然后加1点体力上限并回复1点体力。",
  //ユイ/孙笨双将组合时，孙笨的【激昂】不计入【珍宝】的次数统计
  yui_yinhang: "引吭",
  yui_yinhang_info:
    "锁定技，当你的体力值变化1点时，你可以令至多两名角色摸一张牌。",
  tsumugi_mugyu: "姆啾",
  tsumugi_mugyu_info:
    "当你成为牌的目标后，若你的手牌数小于体力上限，则你可以摸一张牌。",
  tsumugi_huilang: "回廊",
  tsumugi_huilang2: "回廊",
  tsumugi_huilang_info:
    "回合结束时，你可以将任意张牌扣置于武将牌下（均称为「隐」）。回合开始时，你获得所有「隐」，然后可令等量的角色各摸一张牌。",
  //〖回廊〗涉及的所有卡牌移动的结算不会触发〖良姻〗
  haruka_shuangche: "双掣",
  kanata_shuangche: "双掣",
  haruka_shuangche_backup: "双掣",
  haruka_shuangche_info:
    "出牌阶段，你可以视为使用任意基本牌或普通锦囊牌。此牌结算完成后，你选择一项：1.弃置X张牌。2.失去1点体力且本回合内不能再发动〖双掣〗。（X为你于此回合内发动过〖双掣〗的次数）",
  //你不能以此法使用【回魂】
  saya_shouji: "授计",
  saya_shouji_info:
    "每回合限一次，当你使用的牌结算完成后，你可以将此牌对应的所有实体牌交给一名其他角色。其可以使用这些牌中的一张，若如此做，你摸一张牌。",
  saya_powei: "破围",
  saya_powei_info:
    "限定技，回合结束后，你可以选择一名体力值大于你的其他角色。你与其交替进行额外回合，直到你与其中的一名角色死亡或进行到九个回合。你于回合开始时进行判定，若结果为红色，则你对其造成1点伤害。此过程中其他角色不计入距离和座次计算。",
  saya_judge: "破围",
  saya_nodis: "破围",
  //〖破围〗不会因为〖铁骑〗无效
  inari_baiwei: "摆尾",
  inari_baiwei_info:
    "你可以将一张♦牌当做任意基本牌使用或打出。此牌结算完成后，你摸一张牌。",
  //你不能以此法使用【毒】
  inari_baiwei_backup: "摆尾",
  inari_baiwei_sha: "摆尾",
  inari_baiwei_shan: "摆尾",
  inari_huhun: "狐魂",
  inari_huhun_info: "锁定技，你的♣牌的花色均视为♦。你的手牌上限+1。",
  shiina_qingshen: "轻身",
  shiina_qingshen_info:
    "当你受到或造成伤害后，你可以获得此次伤害的渠道对应的实体牌，然后将等量的牌置于你的武将牌上，称为「轻」。锁定技，你的手牌上限和攻击范围+X（X为「轻」数）。",
  shiina_feiyan: "飞燕",
  shiina_feiyan_info:
    "一名其他角色的回合开始时，若其在你的攻击范围内，则你可以将一张「轻」置于弃牌堆，然后视为对其使用一张【杀】。若此【杀】未造成伤害，你摸一张牌。你于此【杀】的结算流程中视为拥有技能【铁骑】。",
  shiina_retieji: "铁骑",
  //你不能对稻荷和多鲁基发动【飞燕】
  sunohara_chengshuang: "成双",
  sunohara_chengshuang_phase: "成双",
  sunohara_chengshuang_info:
    "锁定技，游戏开始时，你选择你的性别。回合开始时，你可以切换你的性别。",
  sunohara_tiaoyin: "挑引",
  sunohara_tiaoyin_info:
    "出牌阶段限一次，你可以弃置任意张花色各不相同的手牌，然后获得等量角色区域内的各一张牌。若你以此法获得了异性角色区域内的牌，则你失去1点体力。",
  sunohara_jianren: "坚忍",
  sunohara_jianren_info:
    "当你受到伤害后，你可以令一名角色摸一张牌。若伤害无来源或来源与你性别不同，则改为摸三张牌。",
  rin_baoqiu: "暴球",
  rin_baoqiu_info:
    "锁定技，你的攻击范围+2。当你使用【杀】指定目标后，你进行判定。若结果：为红色，此【杀】对其的伤害值基数+1；为黑色，其无法闪避此【杀】；为♠/♥，此【杀】不计入使用次数限制且你摸一张牌；为♦/♣，目标角色的所有非锁定技失效直到回合结束，且你弃置其一张牌。",
  sasami_miaobian: "喵变",
  sasami_miaobian_info:
    "当你的体力值变为：3以下时，你获得技能〖公清〗，2以下时，你获得技能〖复难〗，1以下时，你获得技能〖暴球〗",
  sasami_gongqing: "公清",
  sasami_gongqing_info:
    "锁定技。当你受到伤害时，若伤害来源的攻击范围：<3，则你令此伤害的数值减为1。>3，你令此伤害+1。",
  sasami_funan: "复难",
  sasami_funan_info:
    "其他角色使用或打出牌响应你使用的牌时，你可令其获得你使用的牌（其本回合不能使用或打出这些牌），然后你获得其使用或打出的牌。",
  sasami_baoqiu: "暴球",
  sasami_baoqiu_info:
    "锁定技，你的攻击范围+2。当你使用【杀】指定目标后，你进行判定。若结果：为红色，此【杀】对其的伤害值基数+1；为黑色，其无法闪避此【杀】；为♠/♥，此【杀】不计入使用次数限制且你摸一张牌；为♦/♣，目标角色的所有非锁定技失效直到回合结束，且你弃置其一张牌。",
  akane_jugu: "巨贾",
  akane_jugu_info:
    "锁定技，1.你的手牌上限+X。2.游戏开始时，你摸X张牌（X为你的体力上限）",
  akane_quanqing: "权倾",
  akane_quanqing_info:
    "出牌阶段，你可选择：1.弃置一张点数大于10的牌并对攻击范围内的一名其他角色造成1点伤害；2.弃置一张点数大于6的牌并弃置攻击范围内的一名其他角色区域内的一张牌。3.弃置一张牌并令攻击范围内的一名其他角色摸一张牌。",
  akane_yifu: "蚁附",
  akane_yifu2: "蚁附",
  akane_yifu_info:
    "主公技，其他键势力角色的出牌阶段限一次，其可交给你一张手牌。然后你摸一张牌，并将一张手牌交给该角色。",
  doruji_feiqu: "肥躯",
  doruji_feiqu_info:
    "锁定技，当你使用【杀】时，或你成为【杀】的目标后，你令此【杀】不可被响应。",
  yuiko_fenglun: "锋论",
  yuiko_fenglun_info:
    "出牌阶段限一次，你可以和一名其他角色拼点。若你赢，你本阶段内使用牌没有次数和距离限制。",
  yuiko_dilve: "底略",
  yuiko_dilve_info:
    "你可以使用牌堆底的一张牌进行拼点。当你拼点后，你可以获得两张拼点牌。",
  riki_spwenji: "问计",
  riki_spwenji_info:
    "出牌阶段开始时，你可以令一名其他角色交给你一张牌。你于本回合内使用与该牌名称相同的牌时不能被其他角色响应。",
  riki_nvzhuang: "女装",
  riki_nvzhuang_info:
    "锁定技，此武将牌视为包含女性性别。结束阶段，若你：有手牌，你摸一张牌；没有手牌，你摸两张牌。",
  riki_mengzhong: "梦终",
  riki_mengzhong_info:
    "觉醒技，准备阶段，若你已因〖问计〗获得了三张或更多的牌，则你加1点体力上限并回复1点体力，失去〖问计〗并获得〖重振〗。",
  riki_chongzhen: "重振",
  riki_chongzhen_info:
    "出牌阶段开始时，你可以与一名角色拼点。若你赢，你获得该角色手牌区，装备区，判定区的各一张牌；若你没赢，你于此阶段内使用牌时不能指定其他角色为目标。",
  hisako_yinbao: "音爆",
  hisako_yinbao_info:
    "当你受到伤害/回复体力后，你可以判定。若结果为♠，则你对一名其他角色造成1点雷属性伤害。",
  hisako_zhuanyun: "转运",
  hisako_zhuanyun_info: "锁定技，你的判定会朝向对你有利的方向倾斜。",
  hinata_qiulve: "球略",
  hinata_qiulve_info:
    "你可以将一张非基本牌当做【杀】使用或打出（无距离限制）。你以此法使用的红色【杀】不可被响应，黑色【杀】不计入使用次数限制。",
  hinata_ehou: "扼喉",
  hinata_ehou_info:
    "其他角色对你使用的牌结算完成后，你可对其使用一张【杀】。若此【杀】造成伤害，则你摸一张牌。",
  noda_fengcheng: "奉承",
  noda_fengcheng_info: "锁定技，其他角色交给你牌后，其摸一张牌。",
  noda_xunxin: "寻衅",
  noda_xunxin2: "寻衅",
  noda_xunxin_info:
    "出牌阶段限X次，你可以视为对一名体力值不小于你的角色使用【决斗】。若如此做，此【决斗】结算完成后，没赢的角色交给赢的角色一张牌。（X为你的体力值）",
  tomoya_shangxian: "伤弦",
  tomoya_shangxian_info:
    "锁定技，你计算与其他角色的距离时始终从逆时针方向计算。出牌阶段开始时，你可摸一张牌，并改变此方向。",
  tomoya_wangjin: "往今",
  tomoya_wangjin_info:
    "每项每轮各限一次。一名其他角色的回合结束时，若其：在你的攻击范围内，你可令其摸一张牌。若其的体力值小于你，则你摸一张牌，并可交给其一张牌。不在你的攻击范围内，则你摸两张牌，并令其弃置你的一张手牌。若其的体力值大于你，则你视为对其使用一张【杀】（无距离限制）。",
  nagisa_tiandu: "天妒",
  nagisa_tiandu_info: "当你的判定牌生效后，你可以获得此牌。",
  nagisa_fuxin: "抚心",
  nagisa_fuxin_info:
    "当一名角色于回合外受到伤害，或其手牌被其他角色弃置或获得后，你可以令其判定。若结果为：红色，其摸一张牌。黑色，当前回合角色弃置一张牌。",
  ayato_jianshen: "僭神",
  ayato_jianshen_info: "锁定技，你手牌中的【杀】均视为神属性。",
  ayato_zonghuan: "纵幻",
  ayato_zonghuan_info:
    "出牌阶段限一次，你可以观看一名其他角色的手牌，然后选择一项：将其中的一张牌置入弃牌堆，或以该角色的视角使用其中的一张，然后摸一张牌。",
  ao_xishi: "习事",
  ao_xishi_info:
    "锁定技，当你使用或打出♦牌时，或其他角色使用♦牌指定你为目标后，你摸一张牌。",
  ao_kuihun: "窥魂",
  ao_kuihun_info:
    "其他角色进入濒死状态时，你可以摸一张牌，然后观看其手牌并将其中一张牌置于你的武将牌上，称为「蝶」。你使用与一张「蝶」花色相同的牌时无距离和次数限制。你的手牌上限+X（X为蝶数）。",
  ao_shixin: "释心",
  ao_shixin_info:
    "觉醒技，准备阶段，若你的「蝶」中包含至少三种花色，则你加1点体力上限并回复1点体力，失去〖窥魂〗并获得〖蝶归〗。",
  ao_diegui: "蝶归",
  ao_diegui_backup: "蝶归",
  ao_diegui_info:
    "出牌阶段限一次，你可以将一张「蝶」交给一名角色，该角色摸两张牌并复原武将牌。",
  yuzuru_wuxin: "无心",
  yuzuru_wuxin_info:
    "结束阶段，你可以选择一项：失去1点体力并令一名角色摸两张牌，或弃置两张牌并回复1点体力。",
  yuzuru_deyi: "得义",
  yuzuru_deyi_info:
    "觉醒技，当有其他角色死亡后，你减1点体力上限并回复1点体力，失去技能〖无心〗，获得技能〖往生〗〖困奋〗和〖去疾〗。",
  yuzuru_wangsheng: "往生",
  yuzuru_wangsheng_info:
    "觉醒技，当你即将死亡时，你防止此次死亡。你可以将任意张牌交给一名其他角色，然后减1点体力上限并将体力回复至2点，修改技能〖困奋〗和〖去疾〗。",
  yuzuru_kunfen: "困奋",
  yuzuru_kunfen_info:
    "锁定技，结束阶段，你失去1点体力并摸两张牌。然后你可以将两张牌交给一名其他角色。",
  yuzuru_quji: "去疾",
  yuzuru_quji_info:
    "出牌阶段限一次，你可以弃置X张牌并选择至多等量已受伤的其他角色，这些角色各回复1点体力。若你以此法弃置了黑色牌，则你失去1点体力。（X为你已损失的体力值）",
  yuzuru_kunfen_rewrite: "困奋·改",
  yuzuru_kunfen_rewrite_info:
    "锁定技，结束阶段，你摸两张牌。然后你可以将两张牌交给一名其他角色。",
  yuzuru_quji_rewrite: "去疾·改",
  yuzuru_quji_rewrite_info:
    "出牌阶段限一次，你可以弃置X张牌并选择至多等量已受伤的其他角色，这些角色各回复1点体力。（X为你已损失的体力值）",
  yuzuru_bujin: "步进",
  yuzuru_bujin_info:
    "锁定技，己方其他角色计算与其他角色的距离-1且摸牌阶段的额定摸牌数+1。",
  kanade_mapo: "麻婆",
  kanade_mapo_info:
    "你可以将一张♥牌当做【麻婆豆腐】使用。你使用的【麻婆豆腐】可以多指定一个目标。",
  kanade_benzhan: "奔战",
  kanade_benzhan_info:
    "每回合限一次。当你使用或打出牌响应其他角色，或其他角色使用或打出牌响应你后，若此牌为：基本牌，你可令一名角色弃置两张牌或令一名角色摸两张牌；非基本牌，你可对一名角色造成1点伤害或令一名其他角色回复1点体力。",
  mio_tuifu: "推腐",
  mio_tuifu_info: "锁定技，当一名角色对一名同性角色造成伤害时，你摸一张牌。",
  mio_tishen: "替身",
  mio_tishen_info:
    "限定技，准备阶段，你可以将体力值回复至体力上限并摸等同于回复量的牌，然后将武将牌替换为【西园美鸟】。",
  midori_nonghuan: "弄幻",
  midori_nonghuan_info:
    "出牌阶段限X次（X为你的体力值），你可以获得一名本阶段内未选择过的其他角色的区域内的一张牌。你摸一张牌，然后将一张牌交给该角色。然后你清除此技能结算过程中所有卡牌移动事件的移动记录。",
  //即技能结算完成后，所有涉及到的牌移动事件不会再被getHistory获取
  midori_tishen: "替身",
  midori_tishen_info:
    "限定技，准备阶段，你可以将体力值回复至体力上限并摸等同于回复量的牌，然后将武将牌替换为【西园美鱼】。",
  kyoko_juwu: "聚物",
  kyoko_juwu_info:
    "你的回合外，当有装备牌进入弃牌堆后，若这些牌不是从你的区域移动的，则你可以获得这些牌。",
  kyoko_zhengyi: "整遗",
  kyoko_zhengyi_info:
    "锁定技，若你装备区的花色数：大于等于1，你视为拥有〖精策〗；大于等于2，你视为拥有〖涉猎〗：大于等于3，你视为拥有〖制衡〗；大于等于4，你将〖精策〗和〖制衡〗改为界限突破版本。",
  kyoko_jingce: "精策",
  kyoko_shelie: "涉猎",
  kyoko_zhiheng: "制衡",
  shizuru_nianli: "念力",
  shizuru_nianli_info:
    "每轮限一次，你可以展示一张♦/♣/♥/♠手牌，然后视为使用一张不计入次数限制和记录的雷【杀】/【闪】/【桃】/【无懈可击】。",
  shizuru_benzhan: "奔战",
  shizuru_benzhan_info:
    "每回合限一次。当你使用或打出牌响应其他角色，或其他角色使用或打出牌响应你后，若此牌为：基本牌，你可令一名角色弃置两张牌或令一名角色摸两张牌；非基本牌，你可对一名角色造成1点伤害或令一名其他角色回复1点体力。",
  shiorimiyuki_banyin: "伴音",
  shiorimiyuki_banyin_info:
    "当你受到伤害或回复体力后，你可令一名其他角色回复1点体力。",
  shiorimiyuki_tingxian: "铤险",
  shiorimiyuki_tingxian_info:
    "出牌阶段开始时，你可以摸至多三张牌。若如此做，你回复1点体力，且此阶段结束时你失去X点体力。（X为你获得的牌中仍在手牌区的牌的数量）",
  shiorimiyuki_tingxian2: "铤险",
  miki_shenqiang: "神枪",
  miki_shenqiang_info:
    "锁定技，游戏开始时，你将一张【海德洛格拉迪尔特·改】和一张【望远镜】置入你的装备区。你装备区内的武器牌和宝物牌不能被其他角色弃置。",
  miki_huanmeng: "幻梦",
  miki_huanmeng_info:
    "准备阶段开始时，你可以观看牌堆顶的X+1张牌并可以按任意顺序置于牌堆顶或牌堆底。（X为你装备区内的牌数）",
  miki_zhiluo: "治裸",
  miki_zhiluo_info:
    "锁定技，一名其他角色的回合结束时，若其在你的攻击范围内且其装备区内没有牌，则你选择：①摸一张牌。②视为对其使用一张【杀】。",
  miki_hydrogladiator: "海德洛",
  miki_hydrogladiator_info:
    "全名为【海德洛格拉迪尔特·改】。锁定技，当你因执行【杀】的效果而对目标角色造成伤害后，你弃置所有至目标角色距离为1的其他角色的一张牌或弃置其两张牌。",
  miki_hydrogladiator_skill: "海德洛格拉迪尔特·改",
  miki_binoculars: "望远镜",
  miki_binoculars_info: "锁定技，其他角色的手牌对你可见。",
  shiori_huijuan: "绘卷",
  shiori_huijuan_discard: "绘卷",
  shiori_huijuan_info:
    "锁定技，其他角色的结束阶段开始时，你可以视为使用一张该角色本回合出牌阶段内使用过的基本牌或普通锦囊牌。准备阶段开始时，若你自上个回合起以此法使用的牌数不小于X，则你选择一项：①弃置装备区或判定区内的一张牌。②跳过本回合的出牌阶段。（X为场上玩家数的一半且至少为2）",
  kaori_siyuan: "思愿",
  kaori_siyuan_info:
    "出牌阶段，你可以将一张装备牌或延时锦囊牌置于一名其他角色的装备区内，然后可以视为使用一张基本牌或普通锦囊牌。",
  akiko_dongcha: "洞察",
  akiko_dongcha_info_identity:
    "锁定技，其他角色的手牌对你可见。游戏开始时，你令其他角色的身份牌对你可见。",
  akiko_dongcha_info: "锁定技，其他角色的手牌对你可见。",
  abyusa_jueqing: "绝情",
  abyusa_jueqing_info:
    "当你对其他角色造成伤害时，你可以令此伤害值+X。若如此做，你失去X点体力，并于此伤害结算完成后修改〖绝情〗（X为伤害值）。",
  abyusa_jueqing_1st: "绝情",
  abyusa_jueqing_rewrite: "绝情·改",
  abyusa_jueqing_rewrite_info: "锁定技，你即将造成的伤害均视为失去体力。",
  abyusa_dunying: "遁影",
  abyusa_dunying_info:
    "锁定技，其他角色计算与你的距离时+X。准备阶段和结束阶段，你摸X张牌（X为你已损失的体力值）。",
  godan_yuanyi: "远忆",
  godan_yuanyi_info:
    "锁定技，回合开始时，你摸X张牌并进行一个额外的出牌阶段。（X为游戏轮数且至多为3）",
  godan_feiqu: "肥躯",
  godan_feiqu_info:
    "锁定技，当你使用【杀】时，或你成为【杀】的目标后，你令此【杀】不可被响应。",
  godan_xiaoyuan: "消元",
  godan_xiaoyuan_info:
    "觉醒技，当你扣减体力时，若你的体力值小于4，则你减3点体力上限并摸三张牌，失去【肥躯】。",
  yuu_lveduo: "掠夺",
  yuu_lveduo_info:
    "每轮限一次，其他角色的回合开始时，若你本局游戏内未对其发动过〖掠夺〗且你的武将牌正面朝上，你可以将武将牌翻面并获得该角色本回合内的控制权。此回合结束时，你将武将牌翻回正面。锁定技，若你的武将牌背面朝上，则你不能使用或打出牌。",
  yuu_lveduo_full_info:
    "每轮限一次，其他角色的回合开始时，若你本局游戏内未对其发动过〖掠夺〗且你的武将牌正面朝上，你可以将武将牌翻面并获得该角色本回合内的控制权。此回合结束时，你将武将牌翻回正面，获得该角色武将牌上所有的带有「Charlotte」标签的技能，且该角色失去这些技能。锁定技，若你的武将牌背面朝上，则你不能使用或打出牌。",
  ryoichi_baoyi: "爆衣",
  ryoichi_baoyi_info:
    "锁定技，当你失去装备区内的一张牌后，你摸一张牌，然后选择一项：①令一名其他女性角色失去1点体力。②弃置一名其他非女性角色区域内的两张牌。",
  ryoichi_tuipi: "褪皮",
  ryoichi_tuipi_info:
    "锁定技，你不是【顺手牵羊】和【过河拆桥】的合法目标。你装备区的牌于弃牌阶段内计入手牌上限。",
  kotori_yumo: "驭魔",
  kotori_yumo_damage: "驭魔",
  kotori_yumo_gain: "驭魔",
  kotori_yumo_info:
    "锁定技，游戏开始时，你获得蓝色、红色、绿色、黄色、灰色魔物各一个。当有角色受到伤害后，若你没有对应的标记，你根据其势力获得一个对应魔物：魏：蓝、蜀：红、吴：绿、群：黄、灰：晋、键：紫。回合开始时，你可以弃置一个对应的魔物并获得以下技能之一直到回合结束：蓝：魏业、红：蜀义、绿：吴耀、黄：群心、灰：晋势、紫：键魂。",
  kotori_skill_wei: "魏业",
  kotori_skill_wei_info:
    "回合开始时，你可以弃置一张牌并指定一名其他角色，该角色须弃置一张牌，否则你摸一张牌。",
  kotori_skill_shu: "蜀义",
  kotori_skill_shu_info:
    "你使用【杀】上限+1；出牌阶段结束时，若你于此阶段使用【杀】次数不少于2，摸一张牌。",
  kotori_skill_wu: "吴耀",
  kotori_skill_wu_info:
    "回合结束时，若你的手牌数不等于你的体力值，则你摸一张牌。",
  kotori_skill_qun: "群心",
  kotori_skill_qun_info:
    "锁定技，弃牌阶段开始时，若你的手牌数比体力值多2或更多，你本回合手牌上限+1；若你已损失体力值大于1，你手牌上限+1",
  kotori_skill_key: "键魂",
  kotori_skill_key_info:
    "出牌阶段限一次，你可以摸一张牌并获得1点护甲。若如此做，你于当前回合结束时失去1点体力。",
  kotori_skill_jin: "晋势",
  kotori_skill_jin_info:
    "摸牌阶段结束时，你可以展示你于此阶段内因摸牌而获得的牌。若这些牌的花色均不同，则你摸一张牌。",
  kotori_yumo_wei: '<span class="thundertext">魔物</span>',
  kotori_yumo_shu: '<span class="firetext">魔物</span>',
  kotori_yumo_wu: '<span class="greentext">魔物</span>',
  kotori_yumo_qun: '<span class="yellowtext">魔物</span>',
  kotori_yumo_key: '<span class="legendtext">魔物</span>',
  kotori_yumo_jin: '<span class="icetext">魔物</span>',
  kotori_huazhan: "花绽",
  kotori_huazhan_info:
    "每回合每种魔物限一次，你可将一个蓝色/红色/绿色/黄色/紫色/灰色魔物当做【树上开花】使用。",
  jojiro_shensu: "神速",
  jojiro_shensu_info:
    "你可以选择一至三项：1. 跳过判定阶段和摸牌阶段；2. 跳过出牌阶段并弃置一张装备牌；3. 跳过弃牌阶段并将你的武将牌翻面。你每选择一项，视为你对一名其他角色使用一张没有距离限制的【杀】",
  jojiro_shensu1: "神速",
  jojiro_shensu2: "神速",
  jojiro_shensu4: "神速",
  jojiro_shunying: "瞬影",
  jojiro_shunying_info:
    "锁定技，回合结束时，若你本回合内跳过了阶段，则你选择一项：1.失去1点体力。2.移动至多X格并摸X张牌（X为你本回合内跳过的阶段数）。",
  shiroha_yuzhao: "预兆",
  shiroha_yuzhao_umi: "预兆",
  shiroha_yuzhao_info:
    "锁定技，游戏开始时，你将牌堆顶的X张牌扣置于你的武将牌上，称为「兆」。一名角色的回合开始时，若你有「兆」且其至你的距离不大于1，则你将牌堆顶的X张牌扣置为「兆」，然后将等量的「兆」置于牌堆顶。（X为势力数）",
  shiroha_guying: "孤影",
  shiroha_guying_info:
    "锁定技，每回合限一次，当你受到伤害/对其他角色造成伤害时，你进行判定。若结果为红色/黑色，此伤害-1/+1。",
  shiroha_guying_rewrite: "孤影·改",
  shiroha_guying_rewrite_info:
    "当你受到伤害/对其他角色造成伤害时，你可进行判定。若结果为红色/黑色，此伤害-1/+1。",
  shiroha_jiezhao: "解兆",
  shiroha_jiezhao_info:
    "一名角色的判定牌生效前，你可打出一张「兆」代替之。当你以此法移去最后一张「兆」后，你加1点体力上限并回复1点体力，然后修改〖孤影〗并随机获得以下技能中的一个：〖炒饭〗/〖习事〗/〖呣啾〗/〖结伴〗。",
  //猴年马月爆料再利用
  shizuku_sizhi: "思智",
  shizuku_sizhi2: "思智",
  shizuku_sizhi_info:
    "出牌阶段限一次，你可以弃置任意张点数之和为13的牌，然后摸两倍数量的牌。以此法获得的牌中，黑色牌本回合无距离和次数限制，红色牌本回合不计入手牌上限。",
  shizuku_biyi: "避忆",
  shizuku_biyi_info:
    "当你受到伤害后，你可以进行一次判定，然后若你弃置任意张点数之和与判定结果点数相同的牌，你回复1点体力。",
  shizuku_sanhua: "散花",
  shizuku_sanhua_info:
    "当你死亡时，你可令一名其他角色从牌堆中获得四张名称各不相同的基本牌。",
  hiroto_huyu: "虎驭",
  hiroto_huyu2: "虎驭",
  hiroto_huyu_info:
    "其他角色的出牌阶段结束时，若你没有技能〖纵略〗，则其可将两张手牌交给你。若如此做，你获得〖纵略〗。你的下回合结束时，你失去〖纵略〗并将本回合内获得的所有牌交给该角色。",
  hiroto_zonglve: "纵略",
  hiroto_zonglve_info:
    "锁定技，你的手牌上限+3。出牌阶段限一次，你可以将一张手牌背面朝下放置，并展示一名其他角色的一张手牌。若这两张牌：颜色相同，你对其造成1点伤害并弃置其展示的牌。颜色不同，你获得该角色区域内的两张牌。",
  hiroto_tuolao: "脱牢",
  hiroto_tuolao_info:
    "觉醒技，回合结束后，若此回合不是你的第一个回合且你本轮内未因〖虎驭〗失去过牌，则你摸三张牌，失去〖虎驭〗并获得〖纵略〗。",
  sakuya_junbu: "均步",
  sakuya_junbu_info:
    "锁定技，若你已废除的装备栏数量：≥1，你使用牌无距离限制。≥2，你使用牌无次数限制。≥3，你使用牌时可以多指定一个目标。≥4，你使用的牌不可被响应。≥5，你使用牌造成伤害时失去1点体力，令此伤害+1。",
  rumi_shuwu: "淑武",
  rumi_shuwu2: "淑武",
  rumi_shuwu_info:
    "锁定技，你使用【杀】无距离和次数限制，你使用普通锦囊牌选择目标后，可增加一个目标。出牌阶段结束时，你令X=0，且每满足一项便令X+1：①你于本阶段内使用【杀】的次数不大于1。②你于本阶段内未使用锦囊牌造成过伤害。③你的体力值不大于3。你摸X张牌，且本回合手牌上限+X。",
  chihaya_liewu: "烈武",
  chihaya_liewu2: "烈武",
  chihaya_liewu_info:
    "锁定技，你使用【杀】无距离和次数限制，你使用普通锦囊牌选择目标后，可增加一个目标。当你首次废除最后一个装备栏后，你减4点体力上限并获得技能〖怀柔〗。",
  chihaya_youfeng: "游凤",
  chihaya_youfeng_info:
    "转换技，阴，每轮限一次，你可以加1点体力上限，视为使用一张普通锦囊牌；阳，每轮限一次，你可以废除你的一个装备栏，视为使用一张基本牌。",
  chihaya_huairou: "怀柔",
  chihaya_huairou_info: "出牌阶段，你可以重铸装备牌。",
  yukito_kongwu: "控物",
  yukito_kongwu_info:
    "出牌阶段限一次，你可以表演《小空飞天》。若如此做，你从以下项目中随机选择X项，并执行其中的一项：①令一名角色摸两张牌。②对一名角色造成1点伤害。③令一名已受伤的角色回复1点体力。④弃置一名角色区域内的两张牌。⑤移动场上的一张牌。若X=0，则你弃置两张牌。（X为你的得分）",
  yukito_yaxiang: "鸦翔",
  yukito_yaxiang_info:
    "限定技，当有角色进入濒死状态时，你可移去此武将牌，然后令该角色将体力值回复至3点，弃置判定区的所有牌并获得技能〖终愿〗。",
  misuzu_zhongyuan: "终愿",
  misuzu_zhongyuan_info:
    "限定技。当你的判定结果生效时，你可将判定结果改为任意花色和点数并结束此时机。",
  asara_shelu: "摄录",
  asara_shelu_info:
    "出牌阶段限一次，你可以弃置一张牌，然后展示一名其他角色的一张手牌并将其置于你的武将牌上，称为“影”。若你以此法弃置的牌和展示的牌：花色相同，则你摸两张牌。点数相同，则你回复1点体力。",
  asara_yingwei: "影威",
  asara_yingwei_info:
    "你可以如手牌般使用或打出“影”。锁定技，当你使用“影”时，强制触发对应的应变效果。",
  kotomi_qinji: "琴击",
  kotomi_qinji_info:
    "出牌阶段开始时，你可视为使用使用【万箭齐发】。你以此法使用【万箭齐发】造成的伤害视为失去体力。",
  kotomi_chuanxiang: "传箱",
  kotomi_chuanxiang2: "传箱",
  kotomi_chuanxiang_info:
    "其他角色的出牌阶段限一次，其可以将装备区内的一张牌移动到另一名角色的装备区内，然后你摸一张牌。若你是目标角色，则你改为摸两张牌。",
  mia_shihui: "时迴",
  mia_shihui_info:
    "锁定技，摸牌阶段，你改为摸X+1张牌（X为你上回合弃置的牌数）；结束阶段，你弃置一张牌并回复1点体力。",
  mia_qianmeng: "潜梦",
  mia_qianmeng_info:
    "使命技。①游戏开始时，你摸一张牌，然后将一张牌置于牌堆的正中央。②使命：当有角色获得“潜梦”牌时，其将此牌交给你。你将体力值回复至上限，失去〖时迴〗并获得〖风发〗。③失败：当你死亡时，你可令一名角色获得牌堆中所有与“潜梦”牌花色点数相同的牌。",
  mia_fengfa: "风发",
  mia_fengfa_info: "锁定技。摸牌阶段，你多摸X张牌（X为你上回合使用过的牌数）。",
  kano_liezhen: "列阵",
  kano_liezhen_info:
    "结束阶段，若你本回合内使用过牌且这些牌的类型：不均相同，你可视为使用【排兵布阵】或智囊；均相同，你获得仁库中的所有牌（没有则改为摸两张牌）。",
  kano_paibingbuzhen: "排兵布阵",
  kano_paibingbuzhen_info:
    "出牌阶段，对至多三名角色使用。目标角色摸一张牌，然后将一张牌置入仁库。若仁库中的牌类型或颜色均相同，则你摸一张牌。",
  kano_poyu: "破羽",
  kano_poyu_info:
    "当你成为【杀】或伤害性锦囊牌的目标后，若仁库中有牌，你可判定。然后你可从仁库中移去一张与此牌类型或花色相同的牌，令此牌对你无效。",
  liyingxia_sanli: "三礼",
  liyingxia_sanli_info:
    "锁定技。其他角色于其回合内前两次使用牌指定你为目标后，你摸一张牌；第三次使用牌指定你为目标后，你交给其一张牌。",
  liyingxia_zhenjun: "振军",
  liyingxia_zhenjun_info:
    "键势力技。结束阶段，你可以令至多X+1名角色各摸一张牌，且这些角色于自己的下个回合内第一次造成的伤害+1（X为你本回合内使用【杀】和伤害性锦囊牌的次数）。",
  liyingxia_wumai: "武脉",
  liyingxia_wumai_info:
    "蜀势力技。一轮游戏开始时，你可以选择获得其中一个未选择过的技能直到本轮结束：〖八阵〗/〖集智〗/〖观星〗/〖游龙〗。若均已选择过，则你可以摸X张牌（X为场上已受伤的角色数且至多为3）。",
  erika_shisong: "识诵",
  erika_shisong_info:
    "锁定技。①你的手牌上限+X（X为你的护甲数）。②当你于回合内使用第X张牌时，若此牌与你上回合使用的第X张牌类型相同，则你摸一张牌。",
  erika_yousheng: "佑生",
  erika_yousheng_info:
    "使命技。①限定技。一轮游戏开始时，你可以选择至多两名其他角色。你减2点体力上限并增加3点护甲。②当你因〖佑生①〗选择的角色成为【杀】或伤害类锦囊牌的目标时，你可以弃置X张牌并将此目标转移给自己（X为你本轮内发动过〖佑生②〗的次数）。此牌结算结束后，你可令一名原目标角色获得此牌。③成功：当你失去最后的护甲后，若你已发动过〖佑生①〗，则你和所有〖佑生①〗选择的角色各摸三张牌。④失败：当一名〖佑生①〗选择的角色因【杀】或伤害类锦囊牌而受到伤害时，你失去所有护甲并弃置等量的牌。",
  erika_yousheng_append:
    '<span style="font-family: yuanli">Death is not the end of life, but the completion of life.</span>',
  satomi_luodao: "落刀",
  satomi_luodao_info:
    "当你使用【杀】指定目标后，你可以展示目标角色的所有手牌。若其中：有【闪】，则你弃置其中的一张【闪】；没有【闪】，则你弃置一张牌。",
  satomi_daohai: "稻海",
  satomi_daohai_info:
    "结束阶段，若你本回合内弃置过牌，则你可以视为使用一张【五谷丰登】。然后你可以将你于此【五谷丰登】中获得的牌当做【乐不思蜀】使用。",
  satomi_daohai_append:
    '<span style="font-family: yuanli">五穀豊穣、刈り入れ時だね！</span>',
  tenzen_fenghuan: "封还",
  tenzen_fenghuan_info:
    "其他角色使用的【杀】或伤害性锦囊牌结算结束后，若你是此牌的唯一目标，则你可以弃置任意张点数之和大于等于此牌点数两倍的牌，然后视为对其使用一张名称相同的牌。",
  tenzen_retianquan: "天全",
  tenzen_retianquan_info:
    "每回合限一次。当你使用【杀】指定目标后，你可失去1点体力或弃置一张牌，然后展示牌堆顶的三张牌（若你的体力值小于体力上限的50%，则改为展示五张牌）。这些牌中每有一张基本牌，响应此牌所需的【闪】的数量便+1。此牌结算结束后，若此牌造成过伤害，则你获得展示牌中的所有非基本牌。",

  key_kud: "库特莉亚芙卡",
  kud_qiaoshou: "巧手",
  kud_qiaoshou_equip: "巧手",
  kud_qiaoshou_end: "巧手",
  kud_qiaoshou_backup: "巧手",
  kud_qiaoshou_info:
    "出牌阶段/结束阶段，若你没有“巧”，则你可以将一张手牌作为“巧”置于武将牌上并摸一张牌，且视为装备了一张你选择的武器牌或进攻坐骑/防具牌或防御坐骑直到“巧”进入弃牌堆。出牌阶段结束时/准备阶段开始时，你将“巧”置入弃牌堆。",
  kud_buhui: "不悔",
  kud_buhui_info:
    "限定技，当你进入濒死状态时，你可以弃置“巧”和装备区内的所有牌（至少一张）并摸等量的牌，将体力回复至2点，获得技能〖重振〗。",
  key_misuzu: "神尾观铃",
  misuzu_hengzhou: "恒咒",
  misuzu_hengzhou_info:
    "锁定技，准备阶段开始时，或当你受到1点伤害或回复1点体力后，你获得一个“诅咒”标记。你的手牌上限和摸牌阶段的额定摸牌数+X。结束阶段开始时，若X大于3，则你移去所有“诅咒”标记并失去1点体力。（X为“诅咒”标记数）",
  misuzu_nongyin: "浓饮",
  misuzu_nongyin_info:
    "当你需要使用【桃】时，你可将一张红色非锦囊牌当做【乐不思蜀】置入自己的判定区，然后视为使用一张【桃】。",
  misuzu_zhongxing: "终幸",
  misuzu_zhongxing_info:
    "每回合限一次，当你判定区的牌移动到其他区域后，你可令一名角色回复1点体力或摸两张牌。",
  key_kamome: "久岛鸥",
  kamome_yangfan: "扬帆",
  kamome_yangfan_info:
    "锁定技，游戏开始时，你将一张【旅行箱】置入你的装备区。当你失去装备区内的一张牌后，你摸两张牌。",
  kamome_huanmeng: "幻梦",
  kamome_huanmeng_info:
    "准备阶段开始时，你可以观看牌堆顶的X+1张牌并可以按任意顺序置于牌堆顶或牌堆底。（X为你装备区内的牌数）",
  kamome_jieban: "结伴",
  kamome_jieban_info:
    "转换技。每回合限一次，当你受到或造成伤害后，阴：你可将两张牌交给一名其他角色，然后其交给你一张牌。阳：你可将一张牌交给一名其他角色，然后其交给你两张牌。",
  kamome_suitcase: "旅行箱",
  kamome_suitcase_info:
    "锁定技，你跳过你的判定阶段和弃牌阶段；当你即将翻面时，取消之。",
  key_nao: "友利奈绪",
  nao_duyin: "独隐",
  nao_duyin2: "独隐",
  nao_duyin_info:
    "一名其他角色的回合开始时，若你本局游戏内未对其发动过〖独隐〗，则你可以弃置一张牌或将武将牌翻面。若如此做，你不能成为其使用牌的目标，且对其使用牌没有距离限制且不计入使用次数直到你的下回合结束。",
  nao_wanxin: "挽心",
  nao_wanxin_info:
    "一名角色的回合结束时，你可以令一名本回合内受到过伤害的角色摸两张牌，然后你与其将武将牌重置。",
  nao_shouqing: "守情",
  nao_shouqing2: "守情",
  nao_shouqing3: "守情",
  nao_shouqing_info:
    "其他角色的出牌阶段内可以对你使用【桃】。若如此做，其摸一张牌且本局游戏内的手牌上限+1。",
  key_yuuki: "冰室忧希",
  yuuki_yicha: "异插",
  yuuki_yicha_info:
    "出牌阶段开始时，你可依次进行两次判定并将判定牌依次置入两行三列方阵的两个随机位置中。然后你依次进行四次判定，每次可将当前判定牌置入空方格，且须与相邻方格的牌颜色均不同。若如此做，你令一名角色获得方阵内的所有牌。",
  key_kyouko: "伊座并杏子",
  kyouko_rongzhu: "容助",
  kyouko_rongzhu_info:
    "其他角色不因此技能而获得你的牌后，你可摸一张牌，然后交给其一张牌。若其是当前回合角色，则其本回合使用【杀】的次数上限+1；若你是当前回合角色，则你本回合的手牌上限+1。",
  kyouko_gongmian: "共勉",
  kyouko_gongmian_use: "共勉",
  kyouko_gongmian_exchange: "共勉",
  kyouko_gongmian_info:
    "①出牌阶段，你可以选择一名未以此法选择过的角色，若其手牌：大于你，你获得其一张牌，然后交给其一张牌；小于你，其交给你一张牌，然后你交给其一张牌；等于你，你与其各摸一张牌。②出牌阶段结束时，你可以获得一名其他角色区域内的至多X张牌，然后交给其等量的牌。③弃牌阶段开始时，若X不小于你的体力值，你可以获得一名手牌数少于你的角色的所有手牌，然后将手牌数的一半（向上取整）交给该角色。（X为你本回合内发动过〖共勉①〗的次数）",
  key_tenzen: "加纳天善",
  tenzen_yixing: "弈兴",
  tenzen_yixing_info:
    "当有角色因【杀】或【决斗】而受到伤害后，若其在你的攻击范围内或你在伤害来源的攻击范围内，你可以摸一张牌，然后将一张牌置于武将牌上，称为“兴”。当你成为其他角色使用【杀】或普通锦囊牌的唯一目标后，你可以获得一张“兴”，并可于此牌结算完成后弃置两张牌，视为对其使用一张名称相同的牌。",
  //若对方为水织静久则无法触发〖弈兴〗
  tenzen_lingyu: "领域",
  tenzen_lingyu_info:
    "觉醒技，准备阶段，若你的“兴”不小于你的体力值，则你减1点体力上限并获得技能〖天全〗。若你以此法失去了体力，则你摸两张牌。",
  tenzen_tianquan: "天全",
  tenzen_tianquan_info:
    "每回合限一次，当你使用【杀】或【决斗】指定唯一目标后，你可以移去两张“兴”并展示牌堆顶的五张牌。这些牌中每有一张基本牌，响应此牌需要的【闪】/【杀】的数量便+1。此牌结算完成后，若此牌造成过伤害，则你获得这些牌中的非基本牌。",
  key_kotarou: "天王寺瑚太朗",
  kotarou_aurora: "丝刃",
  kotarou_aurora_info:
    "锁定技，当扣减体力或增加体力上限后，若你的装备区内：有武器牌，你视为使用一张【杀】；没有武器牌，你使用牌堆中的一张不为赠物的武器牌。",
  kotarou_rewrite: "改写",
  kotarou_rewrite_damage: "改写",
  kotarou_rewrite_recover: "改写",
  kotarou_rewrite_sha: "改写",
  kotarou_rewrite_block: "改写",
  kotarou_rewrite_info:
    "出牌阶段，你可选择：①视为使用一张本局游戏没有以此法使用过的基本牌或普通锦囊牌；②移动场上的一张牌；③增加一点体力上限并失去1点体力（体力上限至多为5）；④下一次造成的伤害+1；⑤下一次回复的体力值+1；⑥本回合内的手牌上限和使用【杀】的使用次数+1。若你于本回合内发动过〖改写〗的次数超过两次，则你令此技能失效，且于回合结束后将体力上限降至3点，失去〖丝刃〗和〖改写〗。",
  key_kyou: "藤林杏",
  kyou_zhidian: "掷典",
  kyou_zhidian_info:
    "你可以将一张锦囊牌当做【杀】使用（无距离限制）。当你使用【杀】指定第一个目标后，你选择一个与上次不同的选项：①此【杀】不可被响应。②此【杀】无视防具。③此【杀】伤害+1。④此【杀】不计入次数限制。",
  kyou_duanfa: "断发",
  kyou_duanfa_info:
    "限定技，当你受到伤害时，若伤害值不小于你的体力值，则你可弃置所有手牌，防止此伤害并回复1点体力；且当你于你的下回合开始前成为【杀】或伤害性锦囊牌的目标后，你摸一张牌。",
  key_seira: "樱庭星罗",
  seira_xinghui: "星辉",
  seira_xinghui_info:
    "准备阶段，你可以投掷一枚骰子，观看牌堆顶的X张牌（X为投掷点数）并以任意顺序扣置于一名没有“星屑”的角色的武将牌上，称为“星屑”。有“星屑”的角色造成的伤害+1，且当其从牌堆顶摸牌或取得判定牌时，改为从“星屑”中获取。",
  seira_yuanying: "缘映",
  seira_yuanying_info:
    "出牌阶段限一次，你可选择两名角色。这两名角色成为“姻缘者”且获得〖姻缘〗直到你下次发动〖缘映〗。",
  seira_yinyuan: "姻缘",
  seira_yinyuan_info:
    "你的手牌对其他“姻缘者”可见。出牌阶段限一次，你可以获得一名其他“姻缘者”区域内的一张牌，然后其回复1点体力。",

  noname: "小无",
  noname_zhuyuan: "祝愿",
  noname_zhuyuan_info:
    "①每回合每名角色限一次。出牌阶段，你可以将四张花色各不相同的牌交给一名其他角色。你与其获得技能〖铁骑〗和〖激昂〗至各自的回合结束。②锁定技，若你于当前回合内：未发动过〖祝愿〗，则你使用牌无次数限制；发动过〖祝愿〗，则你使用牌无距离限制。",
  noname_duocai: "多彩",
  noname_duocai_info:
    "每回合限一次。其他角色区域内的牌因弃置而进入弃牌堆后，你可以获得之。若你以此法获得的牌数：大于2，你弃置一名角色区域内的一张牌；等于2，你摸一张牌；小于2，你回复1点体力。",
  ns_huangchengyan: "黄承彦",
  nslongyue: "龙岳",
  nslongyue_info:
    "当一名角色使用锦囊牌时，若此牌是其本回合内使用的第一张牌，则你可令其摸一张牌。",
  nszhenyin: "阵引",
  nszhenyin_info:
    "每回合限一次。一名角色的判定牌生效前，你可令当前回合角色打出一张手牌代替之。",
  ns_sunchensunjun: "孙綝孙峻",
  nsxianhai: "险害",
  nsxianhai_info:
    "每轮限一次，当一名其他角色于回合内造成伤害后，若其此回合内造成过的伤害总和大于你上一回合内造成的伤害总和，则你可以减1点体力上限，令其废除一种装备栏并弃置手牌中所有的【闪】。若〖兴黜〗已发动，此回合结束后视为该限定技未发动过。",
  nsxingchu: "兴黜",
  nsxingchu_info:
    "限定技，当你杀死一名角色/你死亡时，你可以令一名角色获得其/你的所有牌并增加1点体力上限。",
  ns_yuanxi: "袁熙",
  nsshengyan: "盛筵",
  nsshengyan3: "盛筵",
  nsshengyan_info:
    "锁定技，你的判定牌生效后，若结果花色与你本回合内其他判定结果的花色均不同，则你令当前回合角色本回合的手牌上限+2。",
  nsdaizhan: "怠战",
  nsdaizhany: "怠战",
  nsdaizhan_info:
    "准备阶段，你可以将一张非锦囊牌当做【兵粮寸断】或【乐不思蜀】对自己使用。若如此做，回合结束时，你将手牌摸至手牌上限。",
  ns_caoshuang: "曹爽",
  nsjiquan: "集权",
  nsjiquan_mark: "集权",
  nsjiquan_info:
    "与你距离1以内的其他角色造成或受到伤害后，你可以将其区域内的一张牌置于你的武将牌上（称为“威”）。你使用【杀】的次数上限+X（X为“威”数）。",
  nsfuwei: "附位",
  nsfuwei_info:
    "觉醒技，结束阶段开始时，若“威”数大于4，则你加2点体力上限，获得〖喋谋〗和〖制皇〗，并将〖集权〗改为锁定技。",
  nsdiemou: "喋谋",
  nsdiemou_info:
    "锁定技，出牌阶段开始时，若“威”大于全场角色数，你移去所有“威”，减一点体力上限并摸X张牌。若X大于4，你翻面。（X为移去的“威”数）",
  nszhihuang: "制皇",
  nszhihuang_damage: "制皇",
  nszhihuang_info:
    "每回合限一次，当主公使用牌时，你可以移去一张“威”，然后获得此牌。锁定技，若你的手牌数大于主公，则你使用牌造成的伤害+1。",
  ns_chentai: "陈泰",
  nsweiyuan: "围援",
  nsweiyuan_use: "围援",
  nsweiyuan_use_backup: "围援",
  nsweiyuan_info:
    "出牌阶段限一次，当你使用牌指定其他角色A为唯一目标后，你可以令一名除该角色外的其他角色B选择一项：①交给A一张牌：然后你对B造成一点伤害；②你摸一张牌，且可以将一张手牌当做本回合使用过的一张基本牌/普通锦囊牌使用（无次数距离限制）。",
  nsjuxian: "据险",
  nsjuxian2: "据险",
  nsjuxian_info:
    "当你受到伤害时，你可以摸两张并跳过下一个摸牌阶段，且在此之前不能再次发动〖据险〗。然后若你的手牌数不小于体力上限，则伤害来源弃置一张牌。",
  ns_huangwudie: "黄舞蝶",
  nsdiewu: "蝶舞",
  nsdiewu_info:
    "当你获得两张或更多的牌后/受到伤害后，你获得一个“蝶舞”标记；你可移去一枚“蝶舞”标记，然后视为使用一张【杀】或【闪】。当你以此法使用【杀】造成伤害后，则你摸一张牌。",
  nslingying: "灵影",
  nslingying_info:
    "锁定技，你使用【杀】无距离限制，且你使用【杀】的次数上限+1。",
  nspojian: "破茧",
  nspojian_info:
    '觉醒技，准备阶段，若你的"蝶舞"标记的数量不小于你的体力值，则你减1点体力上限并摸两张牌，删除〖蝶舞〗中使用【闪】的部分并获得技能〖烈弓〗。',
  ns_sunyi: "孙翊",
  nsguolie: "果烈",
  nsguolie2: "果烈",
  nsguolie_info:
    "摸牌阶段开始前，你可跳过此阶段。若如此做，你的红色牌均视为【杀】，黑色牌均视为【过河拆桥】且均无视距离与次数直到回合结束，且结束阶段，你获得本回合从你以外的区域内进入弃牌堆的所有牌。",
  ns_zhangning: "张宁",
  nsfuzhou: "符咒",
  nsfuzhou_card: "符咒",
  nsfuzhou_card_info:
    "此牌不可被【无懈可击】响应。若判定结果为：黑色，你受到使用者造成的1点雷属性伤害且弃置一张牌；红色，使用者摸两张牌，且你本回合的手牌上限-1。",
  nsfuzhou_num: "符咒",
  nsfuzhou_info:
    "出牌阶段限一次。你可以将一张黑色牌置于一名角色的判定区内，称为“符”。其于判定阶段进行“符”判定，若判定结果为：黑色，其受到一点雷属性伤害并弃置一张牌；红色，你摸两张牌，且该角色本回合手牌上限减1。",
  nsguidao: "鬼道",
  nsguidao_info: "一名角色的判定牌生效前，你可以打出一张黑色牌替换之。",
  nstaiping: "太平",
  nstaiping_info:
    "觉醒技。准备阶段，若你：已因〖符咒〗造成了两次或更多的伤害，则你将〖鬼道〗中的“黑色牌”修改为“牌”，将〖符咒〗修改为〖符咒·邪〗；若你已因〖符咒〗摸了两次或更多的牌，则你将〖鬼道〗中的“黑色牌”修改为“牌”，将〖符咒〗修改为〖符咒·正〗。",
  nsfuzhou_damage: "符咒·邪",
  nsfuzhou_damage_info:
    "出牌阶段限两次。你可以将一张黑色牌置于一名角色的判定区内，称为“符”。其于判定阶段进行“符”判定，若判定结果为：黑色，其受到一点雷属性伤害并弃置一张牌；红色，你摸两张牌，且该角色本回合手牌上限-1。",
  nsfuzhou_draw: "符咒·正",
  nsfuzhou_draw_info:
    "出牌阶段限两次。你可以将一张黑色牌置于一名角色的判定区内，称为“符”。其于判定阶段进行“符”判定，若判定结果为：黑色，其受到一点雷属性伤害并弃置一张牌；红色，你摸两张牌，该角色回复1点体力并摸一张牌，且本回合的手牌上限+1。",
  ns_yanghu: "羊祜",
  nsbizhao: "避召",
  nsbizhao2: "避召",
  nsbizhao_info:
    "隐匿技，锁定技，当你于回合外明置此武将牌后，其他角色计算与你的距离+1直至你的回合开始。",
  nsqingde: "清德",
  nsqingde_info:
    "每回合限一次，当你使用【杀】或普通锦囊牌对其他角色造成伤害后，你可使用该牌与受到伤害的角色拼点。你可令输的角色摸两张牌；当你受到其他角色使用【杀】或普通锦囊牌造成的伤害后，可使用该牌与伤害来源拼点。你可令赢的角色回复一点体力。",
  nsyidi: "遗敌",
  nsyidi_info:
    "出牌阶段限一次，你可展示一张手牌，然后将其交给一名其他角色。若为基本牌，该角色可使用此牌；若不为基本牌，你摸一张牌。",

  diy_wenyang: "文鸯",
  ns_zhangwei: "张葳",
  nshuaishuang: "怀霜",
  nshuaishuang_info:
    "锁定技，结束阶段，你从牌堆/弃牌堆获得一张【桃】，然后失去1点体力。",
  nsfengli: "奉礼",
  nsfengli2: "奉礼",
  nsfengli_draw: "奉礼",
  nsfengli_clear: "奉礼",
  nsfengli_use: "奉礼",
  nsfengli_info:
    "回合结束时，你可以选择一名其他角色并展示所有手牌。你将所有手牌标记为“礼”。你的“礼”对所有角色可见。当该角色于回合外需要使用或打出牌时，其可移去一张“礼”的标记，然后视为使用或打出一张与此牌名称相同的牌。当你的“礼”减少时，你可令一名手牌数小于你的角色摸一张牌。你的回合开始时，你移去所有“礼”的标记，然后注销该角色对“礼”的操作权限。",
  nsqiyue: "骑钺",
  nsqiyue_info: "锁定技，当有角色的武将牌状态改变后，你摸一张牌。",
  nsxuezhu: "血逐",
  nsxuezhu_info:
    "当你受到伤害或造成伤害后，你可以令受到伤害的角色摸两张牌并翻面。",
  ns_chuanshu: "传术",
  ns_chuanshu_info:
    "<span class=yellowtext>限定技</span> 当一名其他角色进入濒死状态时，你可以令其选择获得技能【雷击】或【鬼道】，其回复体力至1并摸两张牌。当该被【传术】的角色造成或受到一次伤害后，你摸一张牌。其阵亡后，你重置技能【传术】",
  ns_xiandao1: "仙道",
  ns_xiandao1_info:
    "<font color=#f00>锁定技</font> 游戏开始和回合结束阶段，你随机获得技能【雷击】或【鬼道】，直到下个出牌阶段开始",
  ns_xiandao2: "仙道",
  ns_xiandao2_info: "<font color=#f00>锁定技</font> 你防止受到任何属性伤害",
  ns_xiandao: "仙道",
  ns_xiandao_info:
    "<font color=#f00>锁定技</font> 游戏开始、你进入游戏时和回合结束阶段，你随机获得技能【雷击】或【鬼道】，直到下个出牌阶段阶段开始。你防止受到任何属性伤害",
  ns_chuanshu2: "术",
  ns_chuanshu2_info:
    "<font color=#f00>锁定技</font> 当你造成或受到一次伤害后，南华老仙摸一张牌",
  ns_chuanshu3: "术",
  ns_chuanshu3_info:
    "<font color=#f00>锁定技</font> 当你【传术】的角色阵亡后，你重置技能【传术】",
  ns_xiuzheng: "修真",
  ns_xiuzheng_info:
    "出牌阶段限一次，你可选择一名其他角色，然后展示牌堆顶的两张牌，若同为红色，则其受到一点火焰伤害；若同为黑色，其受到一点雷电伤害；若颜色不相同，你弃置其一张牌。然后你获得这两张展示的牌后再弃置两张牌",
  nsanruo: "暗弱",
  nsanruo_info:
    "锁定技，你手牌中的[杀]和普通锦囊牌(借刀杀人等带有指向目标的锦囊除外)均对你不可见。但你可以正常使用之",
  nsxunshan: "循善",
  nsxunshan_info:
    "锁定技，你使用【暗弱】牌可以为其指定任意名合法目标（托管无效）",
  nskaicheng: "开城",
  nskaicheng_info:
    "主公技，你的回合内，你可以将一张【暗弱】牌交给一名群势力其他角色观看，其可以选择是否告诉你此牌的名字。然后你选择一项：使用这张牌并摸一张牌；或结束此回合",
  nsjuanli: "狷戾",
  nsjuanli_info:
    "出牌阶段限一次，你可以和一名有手牌的其他角色进行赌牌，若你赢，目标角色失去1点体力且该角色与你距离-1直到与你下次赌牌，若你没赢，目标角色回复1点体力，且该角色与你距离+1直到与你的下次赌牌。（赌牌:赌牌的两名角色分别亮开一张手牌，若花色相同则赌牌平局，若花色不同，则依次展示牌堆顶的牌直到翻开的牌与其中一人亮出牌的花色相同，则该角色获得赌牌的胜利）",
  nsyuanchou: "远筹",
  nsyuanchou_info:
    "锁定技，当你成为锦囊牌的目标时，若来源角色与你的距离大于1，则取消之",
  nsguhuo: "蛊惑",
  nsguhuo_info:
    "锁定技，你在一个回合中使用前两张牌时，你对一名随机角色从牌堆(牌堆无则从弃牌堆)随机使用一张同类别卡牌",
  nsqinxue: "勤学",
  nsqinxue_info:
    "每个效果每回合只能使用一次。①当你使用一张基本牌时，你从牌堆随机获得一张锦囊牌；②当你使用一张锦囊牌时，你从牌堆随机获得一张装备牌；③当你使用一张装备牌时，你从牌堆随机获得一张基本牌",
  nsbaiyi: "白衣",
  nsbaiyi_info:
    "锁定技，若你本回合发动过勤学，你跳过弃牌阶段，改为弃置X张牌（X为本回合发动勤学次数）；若你弃置了3张类别不同的牌，你获得一个额外回合（不可连续获得回合），否则你观看牌堆顶的X张牌并获得其中一张",
  nsbaiming: "百鸣",
  nsbaiming_info:
    "当你使用【杀】时，你可以获得一项未获得过且与杀或伤害相关的技能，此【杀】结算完毕后，你失去以此法获得的技能",
  nsfuge: "覆戈",
  nsfuge_info:
    "你的回合结束后，你可以执行一个额外的回合，此回合的摸牌阶段，你于摸牌阶段额外摸X张牌（X为你已损失的体力值）；若如此做，直到洗牌前，你不能再发动此技能",
  nstanbing: "谈兵",
  nstanbing_info:
    "摸牌阶段开始时，你可弃置一张手牌，然后摸X张牌(X为你弃置牌的名称字数)，若如此做，本回合你不可使用或打出【杀】",
  nsxinzhan: "心战",
  nsxinzhan_info:
    "出牌阶段限一次，你可将任意张手牌交给一名其他角色，若如此做，该角色失去X点体力(X为你交给其的牌张数的一半，向下取整)，若你给的牌达到六张，则改为该角色失去一点体力上限",
  nsfuhuo: "符火",
  nsfuhuo2: "符火",
  nsfuhuo_info:
    "出牌阶段限一次，你可将一张手牌置于一名武将牌上没有“符”的角色的武将牌上，称为“符”，若如此做，其回合外使用或打出【闪】时，你可令其判定，若结果为：红桃，你对其造成2点火焰伤害；方块，你弃置其一张手牌，然后对其造成1点火焰伤害。你的下个回合开始时，你获得其武将牌上的“符”",
  nswangfeng: "望风",
  nswangfeng_info: "在判定牌生效前，你可以打出一张红色牌替换之",
  nshunji: "混击",
  nshunji_info:
    "出牌阶段限一次，你可以摸一张牌，视为使用一张【万箭齐发】。此【万箭齐发】造成伤害时，受伤害角色选择一项：①弃置你一张牌；②摸一张牌",
  nscuanquan: "篡权",
  nscuanquan_info:
    "锁定技，如果你的身份为忠臣，则在受伤三次后与主公，互换身份和体力上限",
  nsjianning: "奸佞",
  nsjianning_info:
    "出牌阶段限一次，如果你的身份为内奸，你可以与一名手牌数比你少的角色交换手牌，并对其造成一点伤害",
  nschangshi: "常仕",
  nschangshi_info:
    "出牌阶段限一次，如果你的身份为反贼，你可以指定两名其他角色互换体力；如果两名角色体力之差等于1，你失去一点体力",
  nsbaquan: "霸权",
  nsbaquan_info:
    "回合结束时，你可以弃置所有手牌，并获得相应点数的护甲，你的新一回合开始时清除所有护甲",
  nsbugua: "卜卦",
  nsbugua_use_info:
    "弃置一张牌，并将牌堆顶的六张牌反面朝上逐张按先后顺序排放，然后抛骰子，展示牌序号与骰子显示的点数一致的牌，然后你根据这张牌的花色、点数随机获得牌堆中相应的一张牌",
  nsbugua_info:
    "出牌阶段限一次，你可以弃置一张牌，并将牌堆顶的六张牌反面朝上逐张按先后顺序排放，然后抛骰子，展示牌序号与骰子显示的点数一致的牌，然后你根据这张牌的花色、点数按以下规则随机获得牌堆中相应的一张牌：乾（红桃偶数）：无中生有；坤（黑桃奇数）：决斗；震（黑桃偶数）：南蛮入侵；巽（红桃奇数）：万箭齐发；坎（梅花偶数）：过河拆桥、兑（梅花奇数）：借刀杀人、艮（方片偶数）：顺手牵羊、离（方片奇数）：火攻。若牌堆中无此牌则摸一张牌，然后你观看未展示的另外五张牌并按任意顺序将其置于牌堆顶。",
  nstuiyan: "推演",
  nstuiyan_info:
    "出牌阶段，若你使用的牌点数比上一张使用的牌点数大，你可以摸一张牌，反之你本回合不能再以此法摸牌；当你使用的牌点数首次达到8的倍数时，你可以在结算后立即发动一次【卜卦】",
  nstianji: "天机",
  nstianji_info:
    "限定技，当一名其他角色进入濒死状态，你可自减一点体力上限，令其回复体力至1并增加一点体力上限",
  nszhaoxin: "昭心",
  nszhaoxin_info: "锁定技，你始终展示手牌",
  nsxiuxin: "修穆",
  nsxiuxin_info: "锁定技，若你没有某种花色的手牌，你不能成为这种花色的牌的目标",
  nsshijun: "弑君",
  nsshijun_info: "锁定技，你造成伤害时，你令此伤害+1，并在结算后失去一点体力",
  nshunyou: "魂佑",
  nshunyou_info:
    "出阶段限一次，你可以弃置一张基本牌，获得弃牌堆底的一张装备牌和一张锦囊牌，然后你可以将那张装备牌装备给一名角色（允许替换）。如果弃牌堆没有装备以及锦囊牌，则改为摸X张牌，X为损失的体力加一（最多3张）",
  nswulie: "武烈",
  nswulie_info:
    "限定技，准备阶段，你可以失去1点体力上限，从弃牌堆选择最多三张牌以任意顺序放置于牌堆顶。若如此做，此回合的结束阶段，你可以重复此操作",
  nscangxi: "藏玺",
  nscangxi2: "藏玺",
  nscangxi_info:
    "主公技，其他吴势力角色的弃牌阶段结束时，若其弃置了至少两张牌，则可以选择判定，若是黑色，则其选择一项，1，令主公摸一张并且展示；2，主公手牌上限永久加一；3，额外弃置一张牌，令主公获得本回合进入弃牌堆的一张牌",
  nsdongcha: "洞察",
  nsdongcha_info:
    "锁定技，单体锦囊牌无法对你造成伤害。其它角色于其回合内第二次使用锦囊牌指定你为目标时，取消之",
  nscaijian: "才鉴",
  nscaijian_info:
    "出牌阶段限一次，若你的手牌数不大于你的体力上限，则你可以展示你的手牌，观看牌堆顶相同数量的牌并以任意方式交换之",
  nsgongjian: "恭俭",
  nsgongjian_info: "锁定技，弃牌阶段，你须将弃牌交给一名体力值大于你的其它角色",
  nsjianxiong: "奸雄",
  nsjianxiong_info:
    "当你成为一名角色牌的目标后你可以对该角色使用一张牌，若此牌对其造成伤害，则该角色的牌失效。若失效的为黑色牌，则你摸一张牌",
  nsxionglue: "雄略",
  nsxionglue_info: "出牌阶段限一次，你可以弃置一张黑色手牌，然后发现一张锦囊牌",
  nsyaowang: "妖妄",
  nsyaowang_info:
    "回合开始阶段你可以选择一名角色然后获得其其中一项技能直到回合结束，然后该角色随机获得一项未上场武将的其中一项技能直到其回合结束",
  nshuanhuo: "幻惑",
  nshuanhuo_info:
    "每当你流失一点体力或受到一次大于2的伤害时，你可以交换除你之外的两名角色的武将牌（体力及体力上限不变）",
  nsjianshu: "剑术",
  nsjianshu_info:
    "锁定技：每当你的装备区有武器时，你使用【杀】指定一个目标后，该角色需要依次使用两张【闪】才能抵消此【杀】",
  nscangjian: "藏剑",
  nscangjian_info: "每当你对一名角色造成伤害，你可以获得其装备区一张牌",
  nsyunxing: "陨星",
  nsyunxing_info:
    "锁定技，当场上一名角色死亡，若为蜀，你失去一点体力；若为吴，你回复一点体力；若为魏，你摸一张牌并弃置一名角色的手牌；若为群，你强制结束当前回合；若为你，你可以使一名角色翻面",
  nsguanxing: "观星",
  nsguanxing_info:
    "锁定技，准备阶段，你观看牌堆的X张牌(X为场上存活人数)并且任意移动Y张牌(Y为你当前体力值)",
  nscaiyi: "猜疑",
  nscaiyi_info:
    "其他角色摸牌后，你可以观看其摸到的牌，若其中有【杀】，则视为你对其使用一张【杀】，若其中没有【杀】，则视为其对你使用一张【杀】（计入出杀次数）",
  nsgefa: "割发",
  nsgefa_info: "当你的体力值等于0或更低时，你可以将任意一张♣牌当【桃】使用",
  nshaoling: "号令",
  nshaoling_info:
    "限定技，出牌阶段，你可以指定一名其他角色，令另外所有其他角色角色选择一项：1、对该角色使用一张【杀】；2、交给你一张牌，然后视为你对其使用一张【杀】",
  nspinmin: "拼命",
  nspinmin_info:
    "锁定技，当你于回合内死亡时，你不死亡并增加一点体力上限（每回合最多增加1点且不能超过4）；当你于回合外死亡时，你不死亡并减少一点体力上限（体力上限为0会导致你死亡）",
  nsshishou: "失手",
  nsshishou_info:
    "锁定技，当你于回合内失去手牌时，你失去一点体力并摸一张牌；你回合内使用的牌数不能超过4",
  nsduijue: "对决",
  nsduijue_info:
    "出牌阶段开始时，你可以弃置一张手牌，若如此做，此阶段你可以将一张与此牌颜色不同的手牌当作[决斗]使用（限2次）",
  nsshuangxiong: "双雄",
  nsshuangxiong_info: "当你使用[决斗]或被使用[决斗]时，你可以将武将牌翻面",
  nsshuangxiong_append: "背面武将：文丑，2体力，你可以将一张牌当[杀]打出",
  nsguanyong: "冠勇",
  nsguanyong_info: "你可以将一张手牌当[杀]打出",
  nsjihui: "急恚",
  nsjihui_info:
    "锁定技，每当一名角色一次弃置了三张或更多的牌，你获得一个额外回合；你的额外回合内，你使用牌只能指定你与上一回合角色为目标",
  nsmouyun: "谋运",
  nsmouyun_info:
    "每两轮限一次，你可以弃置场上体力值最少的一名其他角色区域内的X张牌。（X为其损失的体力值）",
  nscongjun: "从军",
  nscongjun_info:
    "锁定技，游戏开始时，你变身为一名随机男性角色；当一名敌方角色使用无懈可击时，你有小概率亮出此武将并变回花木兰，然后对该角色造成2点伤害",
  nshuanxian: "幻仙",
  nshuanxian_info:
    "锁定技，游戏开始时，你获得随从“幻身·右”，当你首次受到伤害时，你获得随从“幻身·左”（体力上限2，初始手牌2）；你与幻身在摸牌阶段均少摸一张牌；在你的回合中（如果有对应幻身），你以【幻身·左-本体-幻身·右】的顺序进行3个连续回合",
  nstaiping_nh: "太平",
  nstaiping_nh_info:
    "当你受到一点伤害后（首次伤害除外），你可以选择一项: ①令一个“幻身”增加一点体力上限。②令一个“幻身”回复一点体力。",
  nsshoudao: "授道",
  nsshoudao_info:
    "当左右“幻身”全部死亡时，你获得技能“雷击”和“鬼道”。当你死亡时，若此时有两个“幻身”，你可以令一名其他角色获得技能“雷击”和“鬼道”。若有一个“幻身”，你可以令一名其他角色获得技能“雷击”或“鬼道”。(杀死你的角色除外)",
  nsnongquan: "弄权",
  nsnongquan_info: "出牌阶段，你可以将最后一张手牌当作【无中生有】使用",
  nsdufu: "毒妇",
  nsdufu_info: "每当你即将造成一次伤害时，你可以为此伤害重新指定伤害来源",
  diyjizhi: "集智",
  diyjizhi_info:
    "当你使用一张装备牌或锦囊牌时，你可以摸一张牌并展示之，若此牌是基本牌，你须弃置一张手牌，每回合限3次",
  yiesheng: "回雪",
  yiesheng_info: "出牌阶段，你可以弃置任意数量的黑色手牌，然后摸等量的牌。",
  liangji: "环计",
  liangji_info:
    "出牌阶段限一次，你可以选择一名未以此法放置牌的其他角色并将一张手牌置于其武将牌上。目标角色于摸牌阶段开始时，获得此牌。若其为男性角色，则获得技能【无双】，若其为女性角色，则获得技能【离间】，直到回合结束。",
  chengmou: "逞谋",
  chengmou_info:
    "摸牌阶段开始时，若你有“功”牌，你获得之并跳过摸牌阶段，若你所获得的“功”牌多于两张，你须失去一点体力。",
  jugong: "居功",
  jugong_info:
    "回合外每名角色的回合限一次，每当场上有角色因受到【杀】或【决斗】造成的伤害，你可以摸一张牌并且将一张手牌置于你的武将牌上，称之为“功”。在你即将受到伤害时，你可以弃置两张“功”，防止此伤害。",
  nsxinsheng: "新生",
  nsxinsheng_info:
    "每当你对其他角色造成伤害后，若你未受伤，则你可以增加X点体力上限并摸X张牌，X为伤害点数",
  nsdunxing: "遁形",
  nsdunxing_info:
    "每当你即将受到其他角色造成的伤害时，若你已受伤，则你可以防止此伤害，改为失去X点体力上限并摸X张牌，X为伤害点数",
  liangce: "粮策",
  liangce_info:
    "①出牌阶段限一次，你可以将一张基本牌当【五谷丰登】使用。②当因执行【五谷丰登】的效果而亮出的牌因效果执行完毕而置入弃牌堆后，你可以选择一名角色，令该角色获取之",
  jianbi: "坚壁",
  jianbi_info:
    "当你成为锦囊牌的目标时，若此牌的目标包括其他角色，你可以令此牌对1个目标无效",
  diyjuntun: "军屯",
  diyjuntun_info: "出牌阶段，你可以重铸装备牌",
  choudu: "筹度",
  choudu_info:
    "出牌阶段限一次，你可以弃置一张牌，并指定一名角色视为其使用一张调兵遣将",
  liduan: "立断",
  liduan_info:
    "当一名其他角色于其回合外获得牌后，若其此次获得的牌数为1且为装备牌（无论是否可见），你可以令该角色选择一项：1.使用此牌；2.将一张手牌交给你",
  fuchou: "负仇",
  fuchou2: "负仇",
  fuchou_info:
    "当你成为【杀】的目标时，你可以将一张牌交给此【杀】的使用者，令此【杀】对你无效且你到其的距离于当前回合内视为1，若如此做，此回合的结束阶段开始时，其令你摸一张牌，然后你需对其使用【杀】，否则失去1点体力",
  jinyan: "噤言",
  jinyan_info: "锁定技。若你的体力值不大于2，你的黑色锦囊牌视为【杀】",
  chezhen: "车阵",
  chezhen_info:
    "锁定技。若你的装备区里：没有牌，你的防御距离+1；有牌，你的进攻距离+1",
  youzhan: "诱战",
  youzhan_info:
    "当以你距离不大于1的角色为目标的【杀】的使用结算开始时，你可以弃置一张装备牌，令该角色视为使用【诱敌深入】",
  kangyin: "亢音",
  kangyin2: "亢音",
  kangyin_info:
    "出牌阶段限一次，你可以失去1点体力并选择一名其他角色，弃置该角色的一张牌。若此牌：为基本牌，你可以令一至X名角色各摸一张牌；不为基本牌，于此回合内：你的进攻距离+X，且你使用杀的额外目标数上限+X。（X为你已损失的体力值）",
  zhucheng: "筑城",
  zhucheng2: "筑城",
  zhucheng_info:
    "①结束阶段开始时，若没有“筑”，你可以将牌堆顶的X张牌置于你的武将牌上〔称为“筑”〕（X为你已损失的体力值与1中的较大值），否则你可以获取所有“筑”。②当你成为杀的目标时，若有“筑”，你可以令此杀的使用者弃置X张牌（X为“筑”的数量），否则杀对你无效",
  duoqi: "夺气",
  duoqi_info:
    "当一名角色于除你之外的角色的出牌阶段内因弃置而失去牌后，你可以移去一张“筑”，并结束此出牌阶段",

  siji: "伺机",
  ciqiu: "刺酋",
  ciqiu_dying: "刺酋",
  diy_liuyan: "刘焉",
  juedao: "绝道",
  geju: "割据",
  shaoying: "烧营",
  zonghuo: "纵火",
  diychanyuan: "缠怨",
  diyguhuo: "蛊惑",
  jieyan: "劫焰",
  honglian: "红莲",
  xiongzi: "雄姿",
  luweiyan: "围堰",
  guihan: "归汉",
  diyduanliang: "断粮",
  diyduanliang1: "断粮",
  diyduanliang2: "断粮",
  diyqiangxi: "强袭",
  diykuanggu: "狂骨",
  diyzaiqi: "再起",
  batu: "霸图",
  zaiqix: "再起",
  diy_jiaoxia: "皎霞",
  yaliang: "雅量",
  yaliang_info:
    "每当你对其他角色造成1点伤害后，或受到其他角色造成的1点伤害后，你可与该角色各摸一张牌。",
  diy_jiaoxia_info: "每当你成为红色牌的目标，你可以摸一张牌",
  zaiqix_info:
    "摸牌阶段，若你已受伤，你可以改为展示牌堆顶的X+1张牌，X为你已损失的体力值，其中每有一张♥牌，你回复1点体力，然后弃掉这些♥牌，将其余的牌收入手牌。",
  batu_info: "结束阶段，你可以将手牌数补至X，X为现存的势力数",
  diyzaiqi_info: "锁定技，你摸牌阶段额外摸X张牌，X为你已损失的体力值",
  diykuanggu_info:
    "锁定技，每当你造成一点伤害，你在其攻击范围内，你回复一点体力，否则你摸一张牌",
  diyqiangxi_info:
    "出牌阶段，你可以自减一点体力或弃一张武器牌，然后你对你攻击范围内的一名角色造成一点伤害并弃置其一张牌，每回合限一次。",
  diyduanliang_info:
    "出牌阶段限一次，你可以将一张黑色的基本牌当兵粮寸断对一名角色使用，然后摸一张牌。你的兵粮寸断可以指定距离2以内的角色作为目标",
  guihan_info:
    "限定技，当你进入濒死状态时，可以指定一名男性角色与其各回复一点体力并摸两张牌",
  luweiyan_info:
    "出牌阶段限一次，你可以将一张非基本牌当作水攻使用；结算后你可以视为对其中一个目标使用一张不计入出杀次数的杀",
  xiongzi_info:
    "锁定技，你于摸牌阶段额外摸X+1张牌，X为你装备区牌数的一半，向下取整",
  honglian_info: "每当你受到来自其他角色的伤害，可以弃置伤害来源的所有红色牌",
  jieyan_info:
    "出牌阶段限一次，你可以弃置一张红色手牌令场上所有角色受到一点火焰伤害",
  diyguhuo_info: "锁定技，准备阶段，你摸两张牌，然后弃置区域内的两张牌",
  diychanyuan_info: "锁定技，杀死你的角色失去一点体力上限",
  zonghuo_info: "你可弃置一张牌将你即将造成的伤害变为火焰伤害",
  shaoying_info:
    "每当你造成一次火焰伤害，可指定距离受伤害角色1以内的另一名角色，并展示牌堆顶的一张牌，若此牌为红色，该角色受到一点火焰伤害",
  juedao_info:
    "出牌阶段，你可以弃置一张手牌，横置你的武将牌；锁定技，若你的武将牌横置，则你计算至其他角色的距离和其他角色计算至你的距离均+1。",
  geju_info: "准备阶段开始时，你可以摸X张牌（X为攻击范围内不含有你的势力数）。",
  siji_info:
    "弃牌阶段结束后，你可以摸2X张牌（X为你于此阶段内弃置的【杀】的数量）。",
  ciqiu_info:
    "锁定技，每当你使用【杀】对目标角色造成伤害时，若该角色未受伤，你令此伤害+1；若其因此进入濒死状态，你令其死亡，然后你失去“刺酋”。 ",
  nsshuaiyan_info:
    "每当其他角色于你的回合外回复体力后，你可以令该角色选择一项：1.令你摸一张牌；2.令你弃置其一张牌。",
  moshou_info: "锁定技，你不能成为乐不思蜀和兵粮寸断的目标。",
  xicai_info: "你可以立即获得对你造成伤害的牌",
  diyjianxiong_info:
    "锁定技，在身份局中，在你回合内死亡的角色均视为反贼，国战中，在你回合内死亡的角色若与你势力相同则随机改为另一个势力",

  ns_zanghong: "臧洪",
  nsshimeng: "誓盟",
  nsshimeng_info:
    "出牌阶段限一次，你可以选择任意名角色。这些角色依次选择一项：⒈摸一张牌。⒉使用一张【杀】。然后若选择前者角色数大于选择后者的角色数，则你获得1点护甲并失去1点体力。",
  ns_ruanji: "阮籍",
  nsshizui: "酾醉",
  nsshizui_info:
    "每回合限一次。当你成为基本牌或普通锦囊牌的目标后，你可以弃置一张牌，然后视为使用一张【酒】。若你弃置的牌与其使用的牌花色相同，则此牌对你无效；若你弃置的牌为♣，则你获得其使用的牌。",
  nsxiaoye: "啸野",
  nsxiaoye_info:
    "一名角色的结束阶段开始时，若你于当前回合内使用过【酒】，则你可以视为使用一张其于本回合内使用过的【杀】或普通锦囊牌。",
  ns_limi: "李密",
  nstuilun: "退论",
  nstuilun_info:
    "结束阶段，你可以失去任意点体力（至多失去至1点）并弃置任意张手牌（至多弃置至一张）。若如此做，你获得如下效果直到你下回合开始：其他角色的回合开始时，若你的体力值小于该角色，则你可以令一名角色回复或失去1点体力；若你的手牌数小于该角色，则你可以令一名角色摸一张牌或弃置一张牌。",
  ns_zhonglimu: "钟离牧",
  nskuanhuai: "宽怀",
  nskuanhuai_info:
    "出牌阶段开始时，你可以从弃牌堆中获得一张非基本牌。若如此做：你本阶段内不能使用基本牌，且本回合的弃牌阶段结束时，你可以依次使用本阶段内弃置的基本牌。",
  nsdingbian: "定边",
  nsdingbian_info:
    "锁定技。当你于回合内使用锦囊牌或装备牌后，你令自己本回合的手牌上限-1且选择一项：⒈从牌堆获得一张基本牌。⒉令一种基本牌于本回合内不计入手牌上限。",
  prp_zhugeliang_ab: "诸葛亮",
  prp_zhugeliang: "派对浪客",
  nsxingyun: "星陨",
  nsxingyun_info:
    "每回合限一次。你可以将一张手牌当做任意一张符合“四象天阵”的牌使用。然后若这两张牌的类型不同，则你删除此“四象天阵”并摸两张牌。当你删除“四象天阵”中的最后一个项目后，你获得技能〖八阵〗。",
  nsxingyun_faq: "四象天阵",
  nsxingyun_faq_info:
    "青龙：无标签普通锦囊牌<br>朱雀：延时锦囊牌<br>白虎：伤害类卡牌<br>玄武：【闪】/回复类卡牌",
  nshanlang: "酣浪",
  nshanlang_info:
    "准备阶段，你可以和至多三名角色拼点。然后若这些角色中有拼点牌唯一最大的角色，则你可以令该角色从牌堆中获得一张不符合“四象天阵”的牌。",

  junk_zhangrang: "四花张让",
  junktaoluan: "滔乱",
  junktaoluan3: "滔乱",
  junktaoluan4: "滔乱",
  junktaoluan5: "滔乱",
  junktaoluan_backup: "滔乱",
  junktaoluan_info:
    "你可将一张牌当做任意一张基本牌或普通锦囊牌使用（此牌不得是本局游戏你以此法使用过的牌，且每回合每种花色限一次），然后你令一名其他角色选择一项：1.交给你一张与“滔乱”声明的牌类别不同的牌；2.本回合“滔乱”失效且回合结束时你失去1点体力。",
  ns_caimao: "蔡瑁",
  nsdingzhou: "定州",
  nsdingzhou_info:
    "出牌阶段限一次，你可以选择一名区域内有牌的其他角色。你随机获得其区域内的一张牌，然后摸一张牌。若你以此法获得了两张颜色不同的牌，则你失去1点体力。",
  ol_guohuai_ab: "郭淮",
  junk_zhangrang_ab: "张让",
  old_jiakui_ab: "贾逵",
  old_bulianshi_ab: "步练师",
  old_bulianshi: "RE步练师",
  diy_tieba: "吧友设计",
  diy_xushi: "玩点论杀·虚实篇",
  diy_default: "常规",
  diy_noname: "无名专属",
  diy_key: "论外",
  diy_yijiang: "设计比赛2020",
  diy_yijiang2: "设计比赛2021",
  diy_yijiang3: "设计比赛2022",
  diy_fakenews: "假新闻",
  diy_trashbin: "垃圾桶",
  old_jiakui: "贾逵重制",
  ol_guohuai: "三血郭淮",
  ns_chengpu: "铁索程普",
  ns_chengpu_ab: "程普",
};

export const translate_gujian = {
  gjqt_bailitusu: "百里屠苏",
  gjqt_fengqingxue: "风晴雪",
  gjqt_fanglansheng: "方兰生",
  gjqt_xiangling: "襄铃",
  gjqt_yinqianshang: "尹千觞",
  gjqt_hongyu: "红玉",
  gjqt_ouyangshaogong: "欧阳少恭",
  gjqt_xunfang: "巽芳",

  gjqt_yuewuyi: "乐无异",
  gjqt_wenrenyu: "闻人羽",
  gjqt_xiayize: "夏夷则",
  gjqt_aruan: "阿阮",
  gjqt_xieyi: "谢衣",
  gjqt_yanjiaxieyi: "偃甲谢衣",
  gjqt_chuqi: "初七",

  gjqt_beiluo: "北洛",
  gjqt_yunwuyue: "云无月",
  gjqt_cenying: "岑缨",

  yunyou: "云游",
  yunyou_info:
    "每两轮限一次，出牌阶段，你可以发现一张地图牌本局未使用过的地图牌并使用之",
  xuanzhen: "玄阵",
  // xuanzhen_bg:'阵',
  xuanzhen_info:
    "每轮限一次，当你成为一名其他角色的卡牌惟一目标时，你可以发现一张牌代替此牌",
  qingshu: "青书",
  qingshu_info:
    "结束阶段，你可以令一名角色永久获得一个你使用过且不是当前地图的地图牌效果（每个地图最多发动一次）",
  yanjiadan_heart: "偃甲蛋",
  yanjiadan_heart_info: "可以当作紫阳丹、玉女元参或沙棠使用",
  yanjiadan_diamond: "偃甲蛋",
  yanjiadan_diamond_info: "可以当作流风散、舒筋散或神火飞鸦使用",
  yanjiadan_club: "偃甲蛋",
  yanjiadan_club_info: "可以当作天女散花、六骰格或锦里针使用",
  yanjiadan_spade: "偃甲蛋",
  yanjiadan_spade_info: "可以当作飞镖、乾坤镖或龙须钩使用",
  lingyan: "灵偃",
  lingyan_bg: "偃",
  lingyan_info:
    "出牌阶段限一次，你可以将一张点数与武将牌上的牌均不同的手牌置于武将牌上，然后获得与其花色对应的一枚偃甲蛋",
  xunjian: "寻剑",
  xunjian_info:
    "锁定技，每当你使用或打出一张牌，若牌堆中有同名牌，你有X的机率获得之，X为你的“灵偃”牌数/13",
  xunjian_old_info:
    "觉醒技，结束阶段，若你武将牌上有13张牌，你失去技能灵偃并获得技能通天",
  tongtian: "通天",
  tongtian_info:
    "锁定技，在你使用或打出一张牌后，若敌方角色手中有同名牌，你随机获得其中一张",
  xianju: "仙居",
  xianju_info:
    "锁定技，奇数游戏轮次开始时，你获得潜行直到下一轮开始；偶数游戏轮次开始时，你随机获得一张机关牌",
  xuanci: "旋刺",
  xuanci_info:
    "出牌阶段限一次，你可以将一张梅花牌当作飞镖使用；锁定技，你使用飞镖无距离限制，你使用飞镖后对目标结算后视为对目标使用一张杀",
  humeng: "湖梦",
  humeng_sub: "偃甲谢衣",
  humeng_info:
    "觉醒技，当你使用过4种不同的偃甲蛋后，你获得替身偃甲谢衣；觉醒技，当你进入濒死状态时，你弃置所有牌，摸四张牌，变身为初七并激活偃甲谢衣",
  yange: "魇歌",
  yange_info:
    "游戏开始时，你获得数量等于敌方角色数的“魇”标记；准备阶段开始时，你可以移去一枚“魇”标记并变为一名其他存活角色的复制，此回合结束后你变回原角色",
  woxue: "卧雪",
  woxue_info:
    "每当你于回合外使用或打出一张牌，你可以视为对当前回合角色使用【白霜】",
  lingnu: "灵怒",
  lingnu_info:
    "锁定技，每当你造成一点伤害，你随机获得一个与杀相关的技能，技能在你行动3回合后消失（同一时间最多拥有3个以此法获得的技能）",
  zhenying: "振影",
  zhenying_info:
    "每当你使用或打出一张非转化的黑色牌（装备或延时锦囊牌除外），你可以获得一张此牌的“替身”；你使用或打出“替身”牌后需弃置一张牌（没有则不弃）；当前回合结束后，“替身”牌消失",
  cihong: "刺鸿",
  cihong_bg: "鸿",
  cihong_info:
    "每三轮限一次，结束阶段，你可以指定一名其他角色并可以依次选择：1. 弃置一张红色牌；2. 失去一点体力；3. 将武将牌翻至背面；每选择一项，视为对目标使用一张杀",
  lianjing: "莲境",
  lianjing_info:
    "每两轮限一次，回合结束后，你可以选择至多2名其他角色，将其他角色移出游戏，然后你与所选的角色依次进行一个回合",
  zuiji: "醉饮",
  zuiji_info: "出牌阶段，你可以将一张手牌或装备牌当作酒使用",
  manwu: "曼舞",
  manwu_info:
    "在一名角色的结束阶段，若其手牌数为全场最少或之一，你可以令其摸一张牌",
  xfanghua: "芳华",
  xfanghua_info: "在你成为红色牌的目标后，你可以回复一点体力",
  yunyin: "云音",
  yunyin_info:
    "结束阶段，你可以弃置一张与本回合使用过的卡牌花色均不相同的手牌，视为使用一张基本牌或普通锦囊牌",
  shishui: "逝水",
  shishui_info: "锁定技，每当你使用一张红色牌，你令目标流失一点体力",
  duhun: "渡魂",
  duhun_info:
    "濒死阶段，你可以与一名体力值不超过你的体力上限的角色拼点，若你赢，你失去一点体力上限并与该角色交换体力值；若你没赢，你立即死亡",
  duhun_info_alter:
    "濒死阶段，你可以与一名体力值不超过你的体力上限的角色拼点，若你赢，你失去一点体力上限并将体力值回复至与该角色相同；若你没赢，你立即死亡",
  chizhen: "驰阵",
  chizhen_info:
    "出牌阶段开始时，你可以摸X张牌并弃置X张牌，若你弃置了杀，可以视为使用一张决斗（X为你已损失的体力值且至少为1）",
  xidie: "戏蝶",
  xidie2: "戏蝶",
  xidie_info:
    "准备阶段，若你的手牌数大于体力值，可以弃置至多X张牌，并于结束阶段摸等量的牌，X为你的体力值与手牌数之差且不超过3",
  meihu: "魅狐",
  meihu2: "魅狐",
  meihu_info: "当你受到伤害后，可令伤害来源交给你一张手牌",
  jianwu: "剑舞",
  jianwu_info: "锁定技，攻击范围不含你的角色无法闪避你的杀",
  meiying: "魅影",
  meiying_info:
    "一名其他角色的回合结束时，若其未于此回合内使用过指定另一名角色为目标的牌，你可以弃置一张红色牌视为对其使用一张杀",
  zuizhan: "乱斩",
  zuizhan_info: "每当你使用一张杀，可以摸一张牌，然后此杀随机增加一个额外目标",
  xlqianhuan: "千幻",
  xlqianhuan_info:
    "回合结束后，若你已受伤，你可以回复一点体力并将武将牌翻面。若你的武将牌背面朝上，你不能使用卡牌，也不能成为卡牌的目标",
  fumo: "伏魔",
  fumo_info:
    "每当你受到一次伤害，可以弃置两张颜色相同的手牌并对伤害来源造成一点雷电伤害",
  fanyin: "梵音",
  fanyin_info:
    "结束阶段，你可以令一名角色复原武将牌并移除判定区内的牌；若其体力值是全场最少的之一，其回复一点体力",
  mingkong: "明空",
  mingkong_info: "锁定技，若你没有手牌，你受到的伤害-1，然后伤害来源摸一张牌",
  qinglan: "晴岚",
  qinglan_info:
    "每当有一名角色即将受到属性伤害，你可以弃置一张牌令其防止此伤害，然后伤害来源摸一张牌并回复一点体力",
  yuehua: "月华",
  yuehua_info: "每当你于回合外使用、打出或弃置红色牌，你可以摸一张牌",
  xuelu: "血戮",
  xuelu_info:
    "结束阶段，若你已受伤，你可以弃置一张红色牌并对一名其他角色造成一点火焰伤害；若你已损失体力值不少于3，改为造成两点火焰伤害",
  xuelu_info_alter:
    "结束阶段，若你已受伤，你可以弃置一张红色牌并对一名其他角色造成一点火焰伤害",
  fanshi: "反噬",
  fanshi_info:
    "锁定技，弃牌阶段结束时，若你本回合内造成过伤害，你流失一点体力并摸一张牌",
  shahun: "煞魂",
  shahun2: "煞魂",
  shahun_info:
    "限定技，濒死阶段，你可以复原武将牌，弃置所有牌并摸三张牌，然后将体力回复至1；若如此做，你失去技能【反噬】，获得技能【绝境】，并于两回合后立即死亡",
  shahun_info_alter:
    "限定技，濒死阶段，你可以复原武将牌，弃置所有牌并摸三张牌，然后将体力回复至1；若如此做，你失去技能【反噬】，获得技能【绝境】，并于两回合后立即死亡",

  yanjia: "偃甲",
  yanjia_info: "出牌阶段，你可以将两张非特殊装备牌合成为一张强化装备",
  xiuhua: "袖花",
  xiuhua_info: "每当一件其他角色的装备因被替换或弃置进入弃牌堆，你可以获得之",
  liuying: "流影",
  liuying_info:
    "每当你使用一张杀结算完毕后，你可以指定一名本回合未成为过你的杀的目标的角色，并亮出牌堆顶的一张牌，若为黑色，你对该角色使用一张杀",
  boyun: "拨云",
  boyun1: "拨云",
  boyun2: "拨云",
  boyun_info:
    "在你的回合内，你可以弃置一张装备牌，并展示牌堆顶的一张牌，若其为装备牌，你须将其交给任意一张角色并对其造成一点伤害，否则你摸一张牌",
  jizhan: "疾战",
  jizhan_info:
    "出牌阶段限一次，你可以将移动到任意一名角色的前一位，视为对其使用了一张不计入出杀次数的杀",
  qianjun: "千军",
  qianjun_info:
    "每当你使用一张杀，你可以弃置一张牌，令距离目标1以内的所有角色成为额外目标",
  xuanning: "玄凝",
  xuanning1: "玄凝",
  xuanning2: "玄凝",
  liuguang: "流光",
  yangming: "养命",
  yangming2: "养命",
  xuanning_info:
    "出牌阶段，你可以弃置一基本牌，获得至多3个玄凝标记。当你受到伤害时，你失去一枚玄凝标记，伤害来源随机弃置一张牌",
  liuguang_info:
    "准备阶段，若你有玄凝标记，你可以弃置一枚玄凝标记，选择至多三名角色依次令其选择一项：弃置一张牌，或受到一点伤害，并终止流光结算",
  yangming_info:
    "出牌阶段，你可以弃置一张红色牌，并在下个出牌阶段结束时令距离1以内的任意名角色回复一点体力，在此之前不可再次发动",
  zhaolu: "朝露",
  jiehuo: "劫火",
  yuling: "御灵",
  yuling1: "御灵",
  yuling2: "御灵",
  yuling3: "御灵",
  yuling4: "御灵",
  zhaolu_info:
    "锁定技，每隔X回合，你流失一点体力上限，每当你受到一点伤害或有人死亡，视为减少两个回合，X为现存角色数且至多为5",
  jiehuo_info:
    "限定技，出牌阶段，你可以对一名其他角色造成两点火焰伤害，然后死亡",
  yuling_info:
    "锁定技，你没有摸牌和弃牌阶段，你的手牌数始终为5，你在一个出牌阶段最多使用X+2张牌，X为你的体力上限",
  yuling_info_alter:
    "锁定技，你没有摸牌和弃牌阶段，你的手牌数始终为5，你在一个出牌阶段最多使用X+1张牌，X为你的体力上限",
};

export const translate_gwent = {
  gw_huoge: "霍格",
  gw_aisinie: "埃丝涅",
  gw_gaier: "盖尔",
  gw_enxier: "恩希尔",
  gw_kuite: "奎特",
  gw_dagong: "达贡",
  gw_airuiting: "艾瑞汀",
  gw_fuertaisite: "弗尔泰斯特",
  gw_falanxisika: "法兰茜斯卡",
  gw_haluo: "哈洛",
  gw_hengsaite: "亨赛特",
  gw_kaerweite: "卡尔维特",
  gw_bulanwang: "布兰王",
  gw_fulisi: "符里斯",
  gw_laduoweide: "拉多维德",

  gw_jieluote: "杰洛特",
  gw_yenaifa: "叶奈法",
  gw_telisi: "特莉斯",
  gw_xili: "希里",
  gw_luoqi: "罗契",
  gw_yioufeisi: "伊欧菲斯",

  gw_aigeleisi: "艾格蕾斯",
  gw_aokeweisite: "奥克维斯特",
  gw_kaxier: "卡西尔",
  gw_luobo: "萝卜",
  gw_mieren: "尔米恩",
  gw_sanhanya: "三寒鸦",
  gw_shanhu: "珊瑚",
  gw_zhangyujushou: "章鱼巨兽",
  gw_zhuoertan: "卓尔坦",
  gw_meizi: "梅兹",
  gw_aimin: "艾敏",
  gw_puxila: "普希拉",

  gw_xigedelifa: "希格德莉法",
  gw_laomaotou: "毛矛头",
  gw_laomaotou2: "毛矛头",
  gw_qigaiwang: "乞丐王",

  gw_bierna: "碧尔娜",
  gw_haizhiyezhu: "海之野猪",
  gw_nitelila: "尼斯里拉",

  gw_linjing: "林精",
  gw_nvyemo: "女夜魔",
  gw_mierjiata: "米尔加塔",
  gw_kanbi: "坎毕",
  gw_hanmuduoer: "汉姆多尔",
  gw_kairuisi: "凯瑞斯",
  gw_oudimu: "欧迪姆",
  gw_shasixiwusi: "沙斯西乌斯",

  gw_yioufeisisp: "伊欧菲斯",
  gw_diandian: "店店",
  gw_feilafanruide: "菲拉凡德苪",
  gw_fenghuang: "凤凰",
  gw_yisilinni: "伊斯琳妮",
  gw_lanbote: "兰伯特",

  gw_saqiya: "萨琪亚",

  // sqlongyin:'龙影',
  // sqlongyin_info:'',
  sqlongnu: "龙怒",
  sqlongnu_info:
    "准备阶段，你可以发现一张牌堆中的牌，若你手牌中有同名牌，你可以改为造成一点火属性伤害锁定技。准备阶段开始时，你随机切换至一种形态",
  sqlonghuo: "龙火",
  sqlonghuo_info:
    "出牌阶段限一次，你可以弃置所有手牌并摸等量的牌，若敌方角色手牌中与你弃置的牌同名的牌，则随机弃置其中一张。准备阶段开始时，你随机切换至一种形态",
  sqlongwu: "龙舞",
  sqlongwu_info:
    "结束阶段，你可以摸X张牌，然后可以使用一张牌，X为手牌中同名牌数最多的牌的数量。准备阶段开始时，你随机切换至一种形态",
  kuanglie: "狂猎",
  kuanglie_info:
    "锁定技，每当你使用黑色牌指定其他角色为目标后，目标随机弃置一张牌；每当你以此法累计弃置2张牌后，你摸一张牌",
  // kuanglie_info:'锁定技，每当一名敌方角色成为你的黑色牌的目标，你视为对其使用【刺骨寒霜】；在一名角色受到【刺骨寒霜】的影响后，你随机获得一张【狂猎】牌',
  lingshuang: "凛霜",
  lingshuang_info:
    "每当你失去最后一张基本牌，你可以视为对距离2以内的所有敌方角色使用【刺骨寒霜】；在一名角色受到【刺骨寒霜】影响时，你可以弃置一张手牌将其效果改为“摸牌数-2”",
  gwshuangwu: "霜舞",
  gwshuangwu_info:
    "锁定技，每当你造成一次伤害，你视为对目标使用刺骨寒霜；你对处于刺骨寒霜的角色造成的伤害+1",
  gwhuanshuang: "幻霜",
  gwhuanshuang_info:
    "准备或结束阶段，你可以发现一张铜卡法术并使用之，此牌结算两次",
  gwjinli: "金醴",
  gwjinli_jiu: "先祖麦酒",
  gwjinli_info:
    "出牌阶段限一次，你可以弃置一张手牌，并将一张先祖麦酒置于一名角色的武将牌上",
  gw_xianzumaijiu: "先祖麦酒",
  gw_xianzumaijiu_info:
    "出牌阶段对自己使用，你使用下一张杀造成伤害后，令所有友方角色摸一张牌；濒死阶段，对自己使用，回复1点体力",
  gwliaotian: "燎天",
  gwliaotian_info:
    "出牌阶段限2次，若你有至少两张手牌且颜色均相同，你可以重铸你的全部手牌，并视为对一名随机敌方角色使用一张不计入出杀次数的杀",
  gwmaoxian_yioufeisi: "伊欧菲斯",
  gwmaoxian_yioufeisi_info:
    "选择两名角色，令目标依次视为对对方使用一张杀，然后结束出牌阶段",
  gwmaoxian_luoqi: "罗契",
  gwmaoxian_luoqi_info:
    "选择一名角色视为对其使用一张不计入出杀次数的杀，然后所有其他角色可以对目标使用一张杀，然后结束出牌阶段",
  gwmaoxian_jieluote: "杰洛特",
  gwmaoxian_jieluote_info:
    "对一名角色造成一点伤害，若目标体力值大于2且为全场最多，改为造成2点伤害，然后结束出牌阶段",
  gwmaoxian_yenaifa: "叶奈法",
  gwmaoxian_yenaifa_info:
    "对至多3名随机敌方角色施加一个随机负面效果，然后结束出牌阶段",
  gwmaoxian_telisi: "特丽斯",
  gwmaoxian_telisi_info:
    "对至多3名随机友方角色施加一个随机正面效果，然后结束出牌阶段",
  gwmaoxian_hengsaite: "亨赛特",
  gwmaoxian_hengsaite_info:
    "视为使用一张万箭齐发，每当有一名角色因此受到伤害，你获得一张杀，然后结束出牌阶段",
  gwmaoxian_fuertaisite: "弗尔泰斯特",
  gwmaoxian_fuertaisite_info: "令至多两名角色各获得一点护甲，然后结束出牌阶段",
  gwmaoxian_laduoweide: "拉多维德",
  gwmaoxian_laduoweide_info:
    "令一名角色的非锁定技失效直到其下一回合结束，并对其造成一点伤害，然后结束出牌阶段",
  gwmaoxian_enxier: "恩希尔",
  gwmaoxian_enxier_info:
    "与一名手牌并不超过1的其他角色交换手牌，然后结束出牌阶段",
  gwmaoxian_fulisi: "符里斯",
  gwmaoxian_fulisi_info:
    "选择至多三名角色，观看目标的手牌并可以弃置其中1~2张，然后结束出牌阶段",
  gwmaoxian_kaerweite: "卡尔维特",
  gwmaoxian_kaerweite_info: "获得至多两名角色各一张手牌，然后结束出牌阶段",
  gwmaoxian_bulanwang: "布兰王",
  gwmaoxian_bulanwang_info:
    "弃置至多2张牌并摸数量等于弃牌数2倍的牌，跳过弃牌阶段，然后结束出牌阶段",
  gwmaoxian_kuite: "奎特",
  gwmaoxian_kuite_info:
    "视为对一名手牌数不小于你的角色连续使用2张决斗，然后结束出牌阶段",
  gwmaoxian_haluo: "哈洛",
  gwmaoxian_haluo_info:
    "对所有体力值全场最少的角色造成一点伤害，然后结束出牌阶段",
  gwmaoxian_dagong: "达贡",
  gwmaoxian_dagong_info:
    "视为同时使用刺骨寒霜、蔽日浓雾和倾盆大雨，然后结束出牌阶段",
  gwmaoxian_gaier: "盖尔",
  gwmaoxian_gaier_info:
    "令一名角色增加或减少一点体力和体力上限，然后结束出牌阶段",
  gwmaoxian_airuiting: "艾瑞汀",
  gwmaoxian_airuiting_info:
    "令所有其他角色选择一项：使用一张杀，或失去一点体力，然后结束出牌阶段",
  gwmaoxian_aisinie: "埃丝涅",
  gwmaoxian_aisinie_info:
    "回复一点体力并获得任意一张银卡法术，然后结束出牌阶段",
  gwmaoxian_falanxisika: "法兰茜斯卡",
  gwmaoxian_falanxisika_info:
    "随机观看3张金卡法术并使用其中一张，然后结束出牌阶段",
  gwmaoxian_huoge: "霍格",
  gwmaoxian_huoge_info:
    "观看牌堆顶的6张牌，使用至多2张，然后弃掉其余的牌，然后结束出牌阶段",
  gwmaoxian: "冒险",
  gwhuanbi: "幻笔",
  gwhuanbi_info:
    "出牌阶段限一次，你可以弃置一张牌，并创造一张冒险牌，然后随机选择一名有手牌的角色，被选中的角色可以交给你一张手牌并获得一张该牌的复制",
  gwminxiang: "冥想",
  gwminxiang_old_info:
    "结束阶段，你可以选择一张本回合使用过的基本牌或普通锦囊牌并选择两名其他角色，令目标分别视为对对方使用一张此牌的复制",
  gwminxiang_info:
    "出牌阶段限一次，你可以弃置一张基本牌或普通锦囊牌并摸一张牌，然后选择其他两名角色，令目标分别视为对对方使用一张你弃置的牌的同名牌",
  gwlangshi: "狼噬",
  gwlangshi_info:
    "每当你造成一次伤害，你可以对一名体力值不小于受伤害角色的其他角色造一点伤害",
  gwjingshi: "血契",
  gwjingshi_info:
    "出牌阶段限一次，你可以猜测手牌中黑色牌最多的角色是谁，若猜对，你可以观看所有其他角色的手牌并获得任意一张",
  gwjingtian: "经天",
  gwjingtian_info:
    "锁定技，牌堆顶的9张牌对你始终可见；你始终跳过摸牌阶段，改为获得3枚“经天”标记；每名角色的回合限一次，你可以在任意时间点移去一枚“经天”标记，然后获得牌堆顶的一张牌",
  gwweitu: "卫土",
  gwweitu_info:
    "锁定技，每当你弃置牌，若你的护甲数小于3，你获得一点护甲；每当你的护甲为你累计抵消3次伤害，你获得一张随机银卡法术",
  gwzhongmo: "终末",
  gwzhongmo_info:
    "锁定技，你跳过摸牌阶段，改为获得两张随机的稀有度不同的法术牌",
  gwfutian: "覆天",
  gwfutian_info:
    "锁定技，你防止一切伤害；准备阶段，你须弃置一名其他角色的一张手牌；若你以此法累计弃置弃置的总点数达到了24，你变身为汉姆多尔",
  gwgouhun: "勾魂",
  gwgouhun_info:
    "出牌阶段限一次，你可以交给一名有手牌的其他角色一张手牌，然后令其选择一项：1. 将手牌中与此牌花色相同的牌（至少一张）交给你；2. 弃置手牌中与此牌花色不同的牌（至少一张）；3. 进入混乱状态直到下一回合结束",
  gw_wuyao: "雾妖",
  gw_wuyao_info: "在你行动时可当作杀使用；回合结束后，从手牌中消失",
  gw_lang: "狼",
  gw_lang_info: "在你行动时可当作酒使用；回合结束后，从手牌中消失",
  gwyewu: "叶舞",
  gwyewu_info:
    "出牌阶段限一次，你可以弃置一张手牌，并弃置一名随机敌人的一张随机牌；若目标弃置的牌与你弃置的牌颜色相同，则重复发动；每以此法弃置一张敌方角色的手牌，你获得一张【雾妖】；每以此法弃置一张敌方角色的手牌，你获得一张【狼】",
  shuangxi: "霜袭",
  shuangxi_info:
    "每两轮限一次，出牌阶段，你可以视为使用一张【刺骨寒霜】；若你在本回合造成过伤害，改为使用【白霜】",
  gwfengshi: "风蚀",
  gwfengshi_info:
    "结束阶段，你可以选择一项：1. 为自己施加一个随机负面效果，并对两名随机敌人施加一个随机负面效果；2. 为自己施加两个随机正面效果，并对一名随机敌人施加一个随机正面效果",
  yangfan: "扬帆",
  yangfan_info:
    "锁定技，每当你使用一张非装备牌，你随机重铸一张与其花色相同的手牌；若没有花色相同的手牌，改为随机重铸一张与其颜色相同的手牌",
  gwchenshui: "沉睡",
  gwchenshui_bg: "睡",
  gwchenshui_info:
    "锁定技，你防止即将造成或受到的伤害，改为令伤害来随机源获得对方一张牌；结束阶段，若你自上次沉睡起累计发动了至少3次沉睡效果，你解除沉睡状态，对所有敌方角色造成一点伤害，然后切换至觉醒状态",
  gwliedi: "裂地",
  gwliedi_info:
    "锁定技，你造成的伤害+X，X为你到该角色距离的一半，向下取整；结束阶段，若你连续两轮未造成伤害，你切换至沉睡状态",
  julian: "巨敛",
  julian_info: "出牌阶段开始时，你可以摸若干张牌直到你的手牌数为全场最多或之一",
  gwfusheng: "复生",
  gwfusheng_info:
    "当一名未翻面的角色进入濒死状态时，你可以令其翻面并回复一点体力，然后你与其各摸一张牌",
  gwqinwu: "琴舞",
  gwqinwu2: "琴舞",
  gwqinwu_info:
    "出牌阶段限一次，每当你使用一张基本牌，你可以令一名角色摸一张牌并获得技能【琴舞】直到其下一回合结束",
  huanshu: "幻术",
  huanshu2: "幻术",
  huanshu3: "幻术",
  huanshu_info:
    "结束阶段，你可以将一张手牌背面朝上置于你的武将牌上；当一名敌方角色使用一张与之颜色相同的锦囊牌时，你展示并移去此牌，取消锦囊的效果，然后摸两张牌；准备阶段，你移去武将牌上的“幻术”牌",
  gwjieyin: "结印",
  gwjieyin_info:
    "出牌阶段，你可以视为使用瘟疫、燕子药水或昆恩法印（不能重复使用同一法术），技能两轮重置一次",
  zhengjun: "整军",
  zhengjun_info:
    "锁定技，每当你使用或打出一张卡牌，若这是你在本局游戏中使用或打出的第二张与之同名的牌，你增加一点体力和体力上限；结束阶段，你可以观看牌堆顶的X张牌并获得其中一张，X为你以此法增加的体力上限数",
  gwxuezhan: "血战",
  gwxuezhan_info:
    "准备阶段，若你的手牌数为全场最少或之一，你可以获得一张十字召唤",
  jielue: "劫掠",
  jielue_info:
    "锁定技，出牌阶段开始时，你从两个随机队友处各获得一张可使用的牌并依次使用之，然后被拿牌的队友摸一张牌",
  jielue_old_info:
    "当你于回合内首次使用基本牌时，你可以获得两张该牌的复制（使用复制的牌时不触发此技能）",
  gwfengchi: "风驰",
  gwfengchi_info:
    "锁定技，出牌阶段开始时，你随机观看3个可以在出牌阶段使用的技能，并获得其中一个技能直到此阶段结束",
  gwjushi: "巨噬",
  gwjushi2: "巨噬",
  gwjushi_info:
    "出牌阶段限一次，你可以将一名距离1以内的其他角色的一张随机牌置于你的武将牌上；当你受到伤害后，令“巨噬”牌回到原来的位置；准备阶段，你获得武将牌上的“巨噬”牌",
  bolang: "搏浪",
  bolang_info:
    "准备阶段，你可以观看牌堆顶的6张牌，然后将其中至多3张移入弃牌堆；每当你造成一次伤害，你可以从弃牌堆中获得一张以此法移入弃牌堆的牌（每回合限发动一次）",
  lingji: "灵计",
  lingji_info:
    "出牌阶段限一次，你可以摸两张牌并弃置两张牌，若弃置的牌花色相同，你获得一张随机铜卡并展示；若弃置的牌点数相同，你获得一张随机银卡并展示",
  gwjinyan: "金焰",
  gwjinyan_info:
    "锁定技，准备阶段，若游戏轮数为3的倍数，你获得一张随机金卡；当游戏轮数不是3的倍数时，你防止所有伤害",
  gwshenyu: "神愈",
  gwshenyu_info:
    "准备阶段，你可以令一名角色选择一项：回复一点体力，或从弃牌堆中获得一张非金法术牌（直到洗牌入牌堆前该牌不能再以此法获得）",
  junchi: "骏驰",
  junchi_info:
    "每当一名其他角色使用一张杀，若目标不是你，你可以对杀的目标使用一张牌，并摸一张牌，每回合限一次",
  junchi_old_info:
    "当一名其他角色使用杀对一个目标结算后，该角色可以交给你一张牌，然后你可以对杀的目标使用一张牌，若如此做，你回复一点体力，杀的使用者摸一张牌",
  gw_dudayuanshuai1: "杜达元帅",
  gw_dudayuanshuai1_info:
    "当你成为其他角色使用牌的目标时，你可以使用此牌取消之，然后获得对你使用的牌",
  gw_dudayuanshuai2: "杜达元帅",
  gw_dudayuanshuai2_info:
    "你不能使用、打出或弃置此牌；结束阶段，若此牌在你手牌中，你弃置之并随机弃置一张手牌",
  hupeng: "呼朋",
  hupeng_info:
    "出牌阶段限一次，你可以弃置一张牌并将一张杜达元帅置入一名角色的手牌",
  shuijian: "水箭",
  shuijian_info:
    "准备阶段，你可以弃置一张手牌视为对所有敌方角色使用一张万箭齐发",
  yunhuo: "陨火",
  yunhuo_info:
    "锁定技，准备阶段，若游戏轮数为4的倍数，你令所有敌方角色随机弃置一张手牌（若没有手牌改为受到一点火焰伤害），然后在此回合结束后获得一个额外回合",
  yinzhang: "银杖",
  yinzhang_info: "出牌阶段限一次，你可以弃置一张牌，然后发现一张银卡法术",
  gwtianbian: "天变",
  gwtianbian_info:
    "出牌阶段开始时，你可以选择一项：随机使用一张对全场有正面效果的牌；或随机使用一张对全场有负面效果的牌",
  gwxiaoshou: "枭首",
  gwxiaoshou_info:
    "出牌阶段限两次，你可以弃置一张牌对场上体力值最高（或之一）的一名角色造成一点伤害",
  gwjiquan: "集权",
  gwjiquan_info:
    "出牌阶段限一次，你可以从任意名角色处各获得一张牌，每拿一张牌，被拿牌的角色视为对你使用一张杀",
  nuhou: "怒吼",
  nuhou_info:
    "每当你受到一次伤害，你可以弃置一张牌，然后对一名随机敌人造成一点伤害并随机弃置其一张牌",
  shewu: "蛇舞",
  shewu_info:
    "出牌阶段限一次，你可以弃置1至3张牌然后摸3张牌；若你弃置了至少2张牌，你本回合使用卡牌无视距离；若你弃置了3张牌，你回复一点体力",
  gwzhanjiang: "斩将",
  gwzhanjiang_info:
    "每轮限一次，在一名角色的准备阶段，你可以弃置一张牌，然后所有角色可以对该角色使用一张杀，出杀的角色在响应时摸一张牌，当有至少两名角色响应后终止结算",
  gwchuanxin: "穿心",
  gwchuanxin_info:
    "你的攻击范围基数为你当前体力值；每当你对一名角色使用杀结算完毕后，你可以亮出牌堆顶的一张牌，若为黑色，视为对目标再使用一张杀",
  fengjian: "风剑",
  fengjian_info:
    "每当你使用一张锦囊牌，你可以视为对一名不是此牌目标的角色使用一张雷杀，若如此做，你获得潜行直到下一回合开始",
  huandie: "幻蝶",
  huandie_info:
    "准备阶段，你可以摸一张牌，并令任意名其他角色摸两张牌，若如此做，此回合结束时，所有手牌数大于体力值的角色需弃置两张手牌",
  xuezhou: "血咒",
  xuezhou_info:
    "准备阶段，你可以选择一项效果直到下一回合开始：1. 每当一名其他角色在一个回合中首次受到伤害，该角色失去一点体力，你回复一点体力；2. 每当一名其他角色在一个回合中首次造成伤害，该角色失去一点体力，你（若不是受伤害角色）回复一点体力",
  fayin: "法印",
  fayin_info:
    "每当你使用一张杀，你可以弃置一张牌并获得一个随机法印效果：1. 目标随机弃置两张牌；2. 目标进入混乱状态直到下一回合开始；3. 对目标造成一点火属性伤害；4. 获得一点护甲；5. 令目标翻面并摸一张牌",
  gwbaquan: "霸权",
  gwbaquan_info:
    "出牌阶段限一次，你可以获得一名其他角色的所有牌，然后还给其等量的牌，若你归还的牌均为你获得的牌且该角色体力值不小于你，你对其造成一点伤害",
  hunmo: "魂墨",
  hunmo_info:
    "出牌阶段，若你手牌数少于2，你可以选择一名手牌数小于2的其他角色，观看牌堆顶的两张牌，你获得一张并交给其另一张；若你手牌数不少2，你可以选择一名手牌数不少于2的其他角色，你弃置一张手牌，然后观看并弃置其一张手牌。每回合对同一名角色最多发动一次",
  huihun: "回魂",
  huihun_info: "结束阶段，你可以从弃牌堆中获得本回合使用的前两张红色牌",
  lanquan: "远略",
  lanquan_backup: "远略",
  lanquan_info: "出牌阶段限一次，你可以观看牌堆顶的6张牌，并选择一张使用",

  chaoyong: "潮涌",
  chaoyong_info:
    "准备阶段，你可以弃置一张牌，视为对所有敌方角色使用一张南蛮入侵或万箭齐发",
};

export const translate_hearth = {
  hs_alleria: "奥蕾莉亚",
  hs_magni: "麦格尼",
  hs_medivh: "麦迪文",
  hs_jaina: "吉安娜",
  hs_lrexxar: "雷克萨",
  hs_wuther: "乌瑟尔",
  hs_jgarrosh: "加尔鲁什",
  hs_malfurion: "玛法里奥",
  hs_guldan: "古尔丹",
  hs_anduin: "安度因",
  hs_sthrall: "萨尔",
  hs_waleera: "瓦莉拉",
  hs_liadrin: "莉亚德琳",
  hs_morgl: "摩戈尔",

  hs_neptulon: "耐普图隆",
  hs_wvelen: "维纶",
  hs_antonidas: "安东尼达斯",
  hs_alakir: "奥拉基尔",
  hs_zhouzhuo: "周卓",
  hs_yngvar: "伊戈瓦尔",
  hs_bchillmaw: "冰喉",
  hs_malorne: "玛洛恩",
  hs_xsylvanas: "希尔瓦娜斯",
  hs_siwangzhiyi: "死亡之翼",
  hs_malygos: "玛里苟斯",
  hs_xuefashi: "血法师",
  hs_ysera: "伊瑟拉",
  hs_alextrasza: "阿莱克斯塔",
  hs_trueheart: "图哈特",
  hs_nozdormu: "诺兹多姆",
  hs_loatheb: "洛欧塞布",
  hs_jiaziruila: "加兹瑞拉",
  hs_sainaliusi: "塞纳留斯",
  hs_bolvar: "伯瓦尔",
  hs_lrhonin: "罗宁",
  hs_fuding: "弗丁",
  hs_aedwin: "艾德温",
  hs_lafamu: "拉法姆",
  hs_yelise: "伊莉斯",
  hs_lreno: "雷诺",
  hs_finley: "芬利",
  hs_brann: "布莱恩",
  hs_kcthun: "克苏恩",
  hs_anomalus: "阿诺玛鲁斯",
  hs_blingtron: "布林顿",
  hs_fandral: "范达尔",
  hs_hallazeal: "海纳泽尔",
  hs_enzoth: "恩佐斯",
  hs_walian: "瓦里安",
  hs_pengpeng: "砰砰博士",
  hs_aya: "艾雅",
  hs_pyros: "派洛斯",
  hs_jiawodun: "嘉沃顿",
  hs_laila: "莱拉",
  hs_selajin: "瑟拉金",
  hs_bannabusi: "班纳布斯",
  hs_amala: "阿玛拉",
  hs_nuogefu: "诺格弗",
  hs_kazhakusi: "卡扎库斯",
  hs_lazi: "拉兹",
  hs_shaku: "沙库尔",
  hs_laxiao: "拉希奥",
  hs_yashaji: "亚煞极",
  hs_khadgar: "卡德加",
  hs_tyrande: "泰兰德",
  hs_fenjie: "芬杰",
  hs_kalimosi: "卡利莫斯",
  hs_yogg: "尤格萨隆",
  hs_xialikeer: "夏克里尔",
  hs_wolazi: "沃拉兹",
  hs_tanghangu: "唐·汉古",
  hs_barnes: "巴内斯",
  hs_kchromaggus: "克洛玛古斯",
  hs_kaituozhe: "开拓者",

  hs_yelinlonghou: "夜鳞龙后",
  hs_yelinchulong: "雏龙",
  hs_ronghejuren: "熔核巨人",
  hs_shanlingjuren: "山岭巨人",
  hs_mijiaojisi: "秘教祭司",
  hs_huzhixiannv: "湖之仙女",
  hs_totemic: "图腾师",
  hs_bilanyoulong: "碧蓝幼龙",
  hs_zhishigushu: "知识古树",
  hs_zhanzhenggushu: "战争古树",
  hs_jinglinglong: "精灵龙",
  hs_sapphiron: "萨菲隆",
  hs_xuanzhuanjijia: "旋转机甲",
  hs_ruanniguai: "软泥怪",
  hs_hudunren: "护盾机甲",
  hs_nate: "纳特",
  hs_shifazhe: "嗜法者",
  hs_xiangyaqishi: "象牙骑士",
  hs_wujiyuansu: "无羁元素",
  hs_mojinbaozi: "魔晶孢子",
  hs_shuiwenxuejia: "水文学家",
  hs_shizugui: "始祖龟",
  hs_hemite: "赫米特",
  hs_yinggencao: "萤根草",
  hs_zhihuanhua: "致幻花",
  hs_shirencao: "食人草",
  hs_fachaotuteng: "法潮图腾",
  hs_huolituteng: "活力图腾",
  hs_manyututeng: "蛮鱼图腾",
  hs_tgolem: "图腾魔像",
  hs_heifengqishi: "黑锋骑士",
  hs_yuhuozhe: "浴火者",
  hs_wuyaowang: "巫妖王",
  hs_aerfusi: "阿尔福斯",
  hs_baiguyoulong: "白骨幼龙",
  hs_yangyanwageli: "阳焰瓦格里",
  hs_aiqinvyao: "哀泣女妖",
  hs_ashamoer: "阿莎摩尔",
  hs_fengjianhuanfengzhe: "风剪唤风者",
  hs_taisi: "苔丝",
  hs_hajiasha: "哈加莎",
  hs_tuoqi: "托奇",
  hs_siwangxianzhi: "死亡先知",
  hs_xukongzhiying: "虚空之影",
  hs_duyaxinshi: "渡鸦信使",

  hshuanyu: "幻羽",
  hshuanyu_info: "每当你受到一次伤害，你获得发现一张炉石衍生牌",
  hsfashu: "法术",
  hsfashu_anyingjingxiang: "暗影镜像",
  hsfashu_anyingjingxiang_info:
    "当你使用或打出一张牌后，暗影镜像变为该牌的复制",
  hsfashu_buwendingyibian: "不稳定异变",
  hsfashu_buwendingyibian_info:
    "出牌阶段对一名角色使用，目标将一张手牌重铸为同类别的牌，本回合可重复使用此牌，最多使用X次，X为当前体力值",
  hualing: "化灵",
  hualing_info:
    "每三轮限一次，你可以选择一名其他角色，获得其一项技能，然后将其随机变形为一名强度高一级的武将",
  yibian: "异变",
  yibian_info:
    "锁定技，出牌阶段开始时，若你没有不稳定异变，则将一张不稳定异变置于你的手牌",
  wxuying: "虚影",
  wxuying_info:
    "锁定技，准备阶段，你移去手牌中的暗影镜像，然后获得一张暗影镜像（当你使用或打出一张牌后，暗影镜像变为该牌的复制）；当你回合内使用暗影镜像时，你摸一张牌；当你回合外使用暗影镜像时，你获得潜行直到下一回合开始",
  zhoujiang: "咒降",
  zhoujiang_info:
    "锁定技，每当你使用一张普通锦囊牌，你将一张随机“诅咒”牌置于你的手牌",
  muyin: "暮隐",
  muyin_info: "锁定技，每当你失去最后一张手牌，你获得潜行直到下一回合开始",
  tqchuanyue: "穿越",
  tqchuanyue_info:
    "锁定技，准备阶段开始时，你随机选择一个被削弱过的炉石技能，获得其未削弱的版本，替换上一个以此法获得的技能",
  // hsxiujian:'袖箭',
  // hsxiujian_info:'锁定技，在你对一名敌方角色使用一张锦囊牌后，你视为对其使用一张杀',
  // hsyingzong:'影踪',
  // hsyingzong_info:'',
  hsxingyi: "星移",
  hsxingyi_info:
    "锁定技，每当一名敌方角色于回合内使用主动技能，你获得此技能直到下一回合结束",

  hshuanling: "幻灵",
  hshuanling_bg: "灵",
  hshuanling_info:
    "结束阶段，你可以弃置至多X张牌（X为你装备区内的牌数且至少为1）并摸等量的牌，每弃置一张牌，你随机使用一张本局敌方角色使用过的单目标非转化普通锦囊牌，随机指定一个具有正收益的角色为目标",
  // hshuanling_info:'锁定技，当你于回合内使用首张指定其他角色为惟一目标的锦囊牌后，你视为对其随机使用一张锦囊牌（此牌对你有正面效果）',
  // hshuanling_info:'每当你使用一张基本牌或普通锦囊牌，你可以弃置任意张牌令其增加或减少等量的目标',
  huanfeng: "唤风",
  huanfeng_info:
    "锁定技，准备阶段，若你有4个图腾，你失去所有图腾，然后获得并召唤随从奥拉基尔",
  asyouzhang: "幽瘴",
  asyouzhang_info:
    "结束阶段，若你的手牌中没有基本牌/锦囊牌/装备牌，你可以获得牌堆顶的一张基本牌/锦囊牌/装备牌，并可以立即使用",
  ylyuchu: "育雏",
  ylyuchu_info:
    "锁定技，每当你回复一点体力，你获得一只雏龙随从（不超过3只）；结束阶段，你每有一只雏龙，便随机选择一名其他角色，在该角色的下个回合开始前你切换至该雏龙，然后在此回合结束后进行一个额外回合并切换回本体",
  nsaiqi: "哀泣",
  nsaiqi_info:
    "锁定技，每当你使用一张牌，你移除牌堆顶的3张牌；你的手牌上限始终+1",
  nsbeiming: "悲鸣",
  nsbeiming_info:
    "锁定技，当你移除的牌不少于9张时，你摸一张牌，然后将移除的牌以任意顺序置于牌堆顶；当被移除过的牌在牌堆顶时（洗牌后重置），你的不能发动【哀泣】移除牌",
  hstianqi_dalian: "达里安",
  hstianqi_dalian_info: "每当你造成一次伤害，你回复等量的体力",
  hstianqi_shali: "莎莉",
  hstianqi_shali_info: "每当你回复体力，你获得等量的护甲",
  hstianqi_nazigelin: "纳兹戈林",
  hstianqi_nazigelin_info: "当你装备此牌时，你获得一点护甲",
  hstianqi_suolasi: "索拉斯",
  hstianqi_suolasi_info: "当你失去此牌时，你回复一点体力",
  hschaoxi: "潮袭",
  hschaoxi_info: "锁定技，每当你造成一次伤害，你获得两张随机鱼人牌",
  hsnitai: "拟态",
  hsnitai_info: "锁定技，出牌阶段开始时，你获得一张随机炉石角色的技能牌",
  hstianqi: "天启",
  hstianqi_info:
    "出牌阶段限一次，你可以选择一项：弃置一张手牌并随机装备一件天启骑士（不能替换现有装备），或弃置一张装备区内的牌并摸两张牌；当你以此法弃置天启骑士时，若你武将牌上没有对应的天启骑士，你将其置于你的武将牌上；准备阶段，若你的武将牌上有4张天启骑士，你获得游戏胜利",
  hspuzhao: "普照",
  hspuzhao_info:
    "出牌阶段限一次，你可以弃置一张红桃牌，然后令至多三名随机友方角色各摸一张牌（若你无其他队友，改为摸两张牌）",
  hsyanxin: "炎心",
  hsyanxin_info: "锁定技，在你摸牌时，若牌堆中有红色牌，你摸到的首张牌必为红色",
  ysjqisha: "七煞",
  ysjqisha_ju: "惧之煞",
  ysjqisha_kuang: "狂之煞",
  ysjqisha_nu: "怒之煞",
  ysjqisha_yi: "疑之煞",
  ysjqisha_wang: "惘之煞",
  ysjqisha_hen: "恨之煞",
  ysjqisha_ao: "傲之煞",
  ysjqisha_info:
    "锁定技，每当你造成或受到伤害，你令对方随机获得一种消极状态直到下一回合结束",
  zhaochao: "招潮",
  zhaochao_info:
    "锁定技，结束阶段，你视为对一名随机敌人使用一张杀；若此杀被闪避，你视为对另一名随机敌人使用一张杀",
  hllingxi: "灵息",
  hllingxi_info:
    "出牌阶段，你可以令一名已受伤的其他角色弃置两张牌并回复一点体力（同阶段对一名角色限用一次）；结束阶段，你可以回复一点体力",
  xiyong: "汐涌",
  xiyong_info:
    "结束阶段，你可以摸一张牌并可以使用之，若你使用了此牌，你再摸一张牌",
  hsjixie: "机械",
  hsjixie_zhadan: "炸弹机器人",
  hsjixie_zhadan_pop: "炸弹",
  hsjixie_zhadan_info: "出牌阶段对自己使用，对一名随机敌人造成一点火属性伤害",
  yindan: "引弹",
  yindan_info:
    "出牌阶段限一次，你可以弃置一张黑桃牌并流失一点体力，然后获得两张炸弹机器人",
  huanjue: "幻觉",
  huanjue_info:
    "每当你使用一张牌，若此牌指定了惟一目标，你可以发现一张牌，然后可以代替此牌结算",
  oldhuanjue: "幻觉",
  oldhuanjue_info:
    "每回合限一次，当你成为一名其他角色的卡牌惟一目标时，你可以发现一张牌代替此牌",
  zhziwu: "紫雾",
  zhziwu_info:
    "每当你于回合外失去牌，你可以令当前回合角色不能使用杀直到回合结束",
  huanjue_info_old:
    "每名角色的回合限一次，当你使用卡牌指定其他角色为惟一目标，或当其他角色使用卡牌指定你为惟一目标时，你可以发现一张牌代替此牌，然后该牌的使用者在结算后摸一张牌",
  yinzong: "影踪",
  yinzong_info: "锁定技，每当你失去装备区内的牌，你获得一张闪",
  tansuo: "探索",
  tansuo_info: "出牌阶段限一次，你可以弃置一张牌，然后发现一张炉石衍生牌",
  srjici: "棘刺",
  srjici_info:
    "锁定技，每当你造成一次伤害，你摸一张牌，受伤害角色随机弃置一张牌",
  lieqi: "猎奇",
  lieqi_info:
    "准备和结束阶段，你可以指定一名角色，从一张该角色手牌与另外两张随机牌中猜测哪张为该角色手牌，若猜中，你获得一张该牌的复制（同一回合不能指定相同角色）",
  azaowu: "造物",
  azaowu_backup: "造物",
  azaowu_info: "出牌阶段限一次，你可以将一张基本牌当作任意一张基本牌使用",
  shouwang: "守望",
  shouwang2: "守望",
  shouwang_info:
    "每名角色每局限一次，当一名角色进入濒死状态时，你可以令其回复一点体力并获得一点护甲",
  shouwang_info_alter:
    "每名角色每局限一次，当一名角色进入濒死状态时，你可以令其回复一点体力",
  qingtian: "擎天",
  qingtian_info: "锁定技，若你的体力值为全场最多，你受到的伤害始终+1",
  qianfu: "潜伏",
  qianfu2: "潜伏",
  qianfu2_bg: "伏",
  qianfu_info:
    "锁定技，在你死亡前，若你没有进入潜伏状态，你弃置所有牌并进入潜伏状态；当你体力值回复到3（或体力上限）时，你解除潜伏状态并摸3张牌",
  shimo: "尸魔",
  shimo_info:
    "锁定技，距离你为1的角色受到伤害时，你回复一点体力，若你没受伤，改为摸一张牌",
  lieyang: "裂阳",
  lieyang_info:
    "锁定技，每当你于回合内使用一张锦囊牌，你获得一张随机锦囊牌；当你发动三次此技能后，你本回合不能再使用锦囊牌",
  zhuilie: "追猎",
  zhuilie_info:
    "准备阶段，你可以弃置一张牌，然后将牌堆顶6张牌中的基本牌移至弃牌堆；若移入弃牌堆的牌超过3张，你摸一张牌",
  szbianshen: "变身",
  szbianshen_info:
    "限定技，回合开始时，若游戏轮数不少于3，你可以随机观看5张体力上限不小于5的武将牌，将武将牌替换为其中一张",
  kekao: "科考",
  kekao_info: "结束阶段，你可以发现一张延时锦囊牌",
  jinhua: "进化",
  jinhua_info:
    "锁定技，每当你以自己为目标使用一张非转化的锦囊牌，你发现一个技能并获得之",
  hsqizhou: "祈咒",
  hsqizhou_feng: "风之祈咒",
  hsqizhou_feng_info:
    "出牌阶段对自己使用，令所有目标的敌人打出一张杀或受到一点雷属性伤害",
  hsqizhou_shui: "水之祈咒",
  hsqizhou_shui_info: "出牌阶段对自己使用，回复两点体力",
  hsqizhou_huo: "火之祈咒",
  hsqizhou_huo_info: "出牌阶段对任意角色使用，令目标受到一点火属性伤害",
  hsqizhou_tu: "土之祈咒",
  hsqizhou_tu_info: "出牌阶段对任意其他角色使用，令目标获得一点护甲",
  kqizhou: "祈咒",
  kqizhou_info: "准备阶段，若你于上回合使用过锦囊牌，则可以获得一张元素祈咒",
  jingcu: "晶簇",
  jingcu_info: "出牌阶段，你可以减少一点体力上限并摸两张牌",
  shengzhang: "生长",
  shengzhang_info: "锁定技，若你于弃牌阶段弃置了牌，你增加一点体力上限",
  pyuhuo: "浴火",
  pyuhuo_info:
    "锁定技，在你首次进入濒死状态时，你弃置所有牌、重置武将牌、将体力和体力上限变为4并摸4张牌；在你第二次进入濒死状态时，你弃置所有牌、重置武将牌、将体力和体力上限变为6并摸6张牌",
  mengye: "梦魇",
  mengye_info:
    "结束阶段，你可以选择一名有手牌的角色将其一张随机的非毒手牌转化为毒，然后令其获得一点护甲",
  mengye_old: "梦魇",
  mengye_old2: "梦魇",
  mengye_old_info:
    "回合结束后，你可以翻面并指定一名的非主公角色，由你控制其进行一个额外的回合。在此回合中，你的本体不参与游戏",
  fuhua: "腐化",
  fuhua2: "腐化",
  fuhua_info:
    "出牌阶段，你可以将一张毒交给一名没有魔血技能的其他角色，该角色选择一项：1. 获得技能魔血，此后每个结束阶段需交给你一张手牌；2. 视为你对其使用一张决斗",
  moxie: "魔血",
  moxie_info:
    "锁定技，当你因【毒】失去体力时，你改为摸两张牌；结束阶段，你将一张随机手牌转化为毒。",
  gfuhun: "附魂",
  gfuhun_info:
    "结束阶段，若你未翻面，你可以和一名其他角色拼点，若你赢，你将武将牌翻至背面，该角色进入混乱状态直到下一回合结束",
  hlongyi: "龙裔",
  hlongyi_info: "锁定技，你的黑色牌不占用手牌上限",
  zhongji: "重击",
  zhongji_info: "每当你即将造成伤害，可弃置一张黑色手牌令伤害+1",
  fuwen: "符文",
  fuwen_info: "若你弃牌阶段弃置了锦囊牌，你可以获得一点护甲",
  jinzhou: "禁咒",
  jinzhou_info:
    "结束阶段，若你手牌中有黑桃牌，你可以令一名其他角色的非锁定技失效直到其下一回合结束",
  midian: "秘典",
  midian_info: "出牌阶段限一次，你可以弃置一张锦囊牌，然后随机获得三张锦囊牌",
  yuelu: "月露",
  yuelu_info:
    "在一名角色的濒死阶段，你可以弃置一张黑色牌令其回复一点体力并获得一点护甲",
  yuelu_info_alter:
    "在一名角色的濒死阶段，你可以弃置一张黑色牌令其回复一点体力",
  xingluo: "星落",
  xingluo_info:
    "准备阶段，你可以令任意名手牌数多于你的角色各弃置一张手牌，然后你可以从弃置的牌中选择一张加入手牌",
  yushou: "御兽",
  yushou_info:
    "出牌阶段，你可以弃置一张牌并召唤一个随机的野兽宠物，回合开始阶段，你随机失去一个宠物",
  yushou_misha: "米莎",
  yushou_misha_info: "每当你受到一次伤害，你获得一点护甲",
  yushou_huofu: "霍弗",
  yushou_huofu_info: "你可以将一张黑色牌当作决斗使用",
  yushou_leiouke: "雷欧克",
  yushou_leiouke_info: "你每回合造成的首次伤害+1",
  hsqingyu_hufu: "青玉护符",
  hsqingyu_hufu_info: "令一名角色获得一点护甲",
  hsqingyu_zhao: "青玉之爪",
  hsqingyu_zhao_info: "当你装备此装备时，摸一张牌",
  hsqingyu_feibiao: "青玉飞镖",
  hsqingyu_feibiao_info: "弃置一名角色的一张随机手牌和一张随机装备牌",
  hsqingyu_shandian: "青玉闪电",
  hsqingyu_shandian_info: "对一名角色造成一点雷电伤害",
  hsqingyu_zhanfang: "青玉绽放",
  hsqingyu_zhanfang_info: "令一名角色增加一点体力上限并摸一张牌",
  ayuling: "玉灵",
  ayuling_info: "每当你受到一次伤害，你可以获得一张随机青玉牌",
  qingzun: "青樽",
  qingzun_info:
    "本局对战中，每当你使用一张青玉牌，你的手牌上限+1；当你累计使用两张青玉牌后，你可以于准备阶段摸一张牌；当你累计使用六张青玉牌后，你可以于结束阶段摸一张牌",
  qingzun_info_alter:
    "本局对战中，每当你使用一张青玉牌，你的手牌上限+1；当你累计使用三张青玉牌后，你可以于准备阶段摸一张牌；当你累计使用九张青玉牌后，你可以于结束阶段摸一张牌",
  lianjin: "炼金",
  lianjin_info:
    "出牌阶段限一次，你可以弃置一张牌并获得一张由三张随机牌组成的药水；当你因弃置而失去药水牌时，你随机获得药水的组成卡牌之一",
  shouji: "收集",
  shouji_info:
    "每当你使用一张杀，你可以获得一张目标随机手牌的复制；每当你的杀被闪避，你可以获得一张目标随机非特殊装备牌的复制；每回合限各限一次",
  guimou: "鬼谋",
  guimou_info:
    "每当你受到一次伤害，你可以获得伤害来源的一张手牌，若此牌是黑色，你展示此牌并重复此过程",
  yingxi: "影袭",
  yingxi_info:
    "结束阶段，若你本回合未造成伤害，你可以将一张黑色牌当作杀对任意一名角色使用，若目标未受到伤害，此杀不可闪避",
  peiyu: "培育",
  peiyu_info:
    "准备阶段，你可以令一名没有图腾的角色获得一个随机图腾直到其首次受到伤害",
  peiyu_old_info:
    "出牌阶段，你可以弃置一张牌令一名没有图腾的角色获得一个随机图腾，或令一名有图腾的角色替换一个图腾；你死亡时，其他角色失去以此法获得的图腾",
  wzhanyi: "战意",
  wzhanyi_info:
    "你可以跳过出牌阶段，改为摸三张牌并展示之，将摸到的装备牌置于装备区，然后可以使用手牌中的杀",
  shengteng: "升腾",
  shengteng_info:
    "锁定技，每当你使用锦囊牌造成伤害，你增加一点体力上限并回复一点体力",
  yuansu: "寂灭",
  yuansu_info:
    "出牌阶段限一次，若你已损失的体力值不少于3，你可以将体力上限降至与体力值相同，视为使用一张元素毁灭",
  nuyan: "怒焰",
  nuyan2: "怒焰",
  nuyan_backup: "怒焰",
  nuyan_info:
    "出牌阶段限一次，你可以将一张红色牌当作任意一张能造成伤害的牌使用（不得是你本局以此法使用过的牌）",
  nuyan2_info:
    "出牌阶段限三次，你可以失去一点体力，视为使用任意一张能造成伤害的牌”",
  chouhuo: "仇火",
  chouhuo_info:
    "觉醒技，出牌阶段开始时，若你的怒焰技能已将可用的牌用完，你失去一点体力上限，获得两点护甲，然后将怒焰的描述改为“出牌阶段限三次，你可以失去一点体力，视为使用任意一张能造成伤害的牌”",
  hsdusu: "毒素",
  hsdusu_xueji: "血蓟",
  hsdusu_xueji_info: "随机弃置一名角色的2张装备牌",
  hsdusu_shinancao: "石楠草",
  hsdusu_shinancao_info: "令一名角色下一次造成的伤害+1",
  hsdusu_kuyecao: "枯叶草",
  hsdusu_kuyecao_info: "令一名角色获得技能潜行，直到其下一回合开始",
  hsdusu_huoyanhua: "火焰花",
  hsdusu_huoyanhua_info: "对攻击范围内的一名角色造成一点火焰伤害",
  hsdusu_huangxuecao: "皇血草",
  hsdusu_huangxuecao_info: "摸两张牌",
  duxin: "毒心",
  duxin_info:
    "准备阶段和结束阶段，若你的手中没有毒素牌，你可以获得一张随机毒素牌",
  oldduxin: "毒心",
  oldduxin_info: "准备阶段和结束阶段，你可以获得一张随机毒素牌",
  hstuteng: "图腾",
  kuangluan: "狂乱",
  kuangluan2: "狂乱",
  // kuangluan_info:'锁定技，每当你于回合内使用一张普通锦囊牌，便于出牌阶段结束时随机使用一张普通锦囊牌（随机指定目标）',
  kuangluan_info:
    "锁定技，每当一名其他角色对你造成伤害，该角色进入混乱状态直到当前回合结束",
  zengli: "赠礼",
  zengli_info: "出牌阶段限一次，你指定一名其他角色与你各装备一把武器",
  xiubu: "修补",
  xiubu_info:
    "每当你装备一把未强化的武器，你可以获得数量等同于武器攻击范围的随机零件",
  mobao: "魔爆",
  mobao_info:
    "出牌阶段限一次，你可以弃置至多三张黑色牌，然后对所有于上轮对你造成过伤害的角色造成等同于你弃牌数的雷电伤害",
  xianji: "献祭",
  xianji2: "献祭",
  xianji3: "献祭",
  xianji_info:
    "其他角色可以在其结束阶段弃置1~2张手牌并令你摸等量的牌，若如此做，直到其下一回合结束，每当你使用卡牌指定其为目标时，其摸一张牌",
  xueren: "血刃",
  xueren_info:
    "每当你使用杀造成伤害，你可以令受伤害角色与你各流失一点体力，然后你摸两张牌",
  maoxian: "奇旅",
  maoxian2: "奇旅",
  maoxian_info:
    "出牌阶段限两次，你可以发现一个技能并获得之（替换此前发现的技能）",
  tanmi: "探秘",
  tanmi_info:
    "在一名其他角色的结束阶段，若你没有手牌，你可以摸两张牌并可以使用两张牌",
  yiwen: "轶闻",
  yiwen_info:
    "锁定技，每当其他角色于回合内首次使用非特殊卡牌指定你为惟一目标，你获得一张此牌的复制",
  tanbao_old: "探宝",
  tanbao_old_info:
    "出牌阶段限一次，你可以弃置三张牌，然后展示牌堆顶的三张牌，然后获得其中任意张类别不同的牌；若三张牌类别均不相同，你回复全部体力值",
  qianghuax: "强化",
  qianghuax_info:
    "出牌阶段限一次，你可以弃置任意张不同类别的牌，然后展示并获得与弃置的牌类别相同且价值更高的牌",
  zhuizong: "追踪",
  zhuizong_info:
    "出牌阶段限一次，你可以弃置任意张牌，观看牌堆顶的等同于弃牌数四倍的牌，然后获得其中的一张牌",
  xunbao: "寻宝",
  xunbao2: "寻宝",
  xunbao_info:
    "准备阶段，若你的武将牌上没有藏宝图，你可以将一张藏宝图置于你的武将牌上；若你的武将牌上有藏宝图，你可以弃置一张与藏宝图点数相同的牌并获得此藏宝图",
  xieneng: "邪能",
  xieneng_info: "结束阶段，你可以选择一张神器牌并获得之",
  fbeifa: "北伐",
  fbeifa_info:
    "每当你失去最后一张手牌，你可以视为使用一张无视距离的杀，若此杀造成伤害，你摸一张牌，每回合最多发动3次",
  oldfbeifa: "北伐",
  oldfbeifa_info:
    "每当你失去最后一张手牌，你可以视为使用一张无视距离的杀，若此杀造成伤害，你摸一张牌",
  yufa: "驭法",
  yufa_info:
    "在任意一名其他角色的结束阶段，若你于此回合内受过其伤害，你可以将一张传送门交给除此角色外的任意一名角色",
  bingyan: "冰焰",
  bingyan_info:
    "出牌阶段限一次，你可以将一张红色牌当作炽羽袭，或将一张黑色牌当作惊雷闪使用",
  hsshenqi: "神器",
  hsshenqi_morijingxiang: "末日镜像",
  hsshenqi_morijingxiang_info:
    "限武将牌正面朝上时使用，从所有其他角色的区域内各获得一张牌；使用后将武将牌翻至背面",
  hsshenqi_kongbusangzhong: "恐怖丧钟",
  hsshenqi_kongbusangzhong_info:
    "限武将牌正面朝上时使用，对所有其他角色各造成一点伤害；使用后将武将牌翻至背面",
  hsshenqi_nengliangzhiguang: "能量之光",
  hsshenqi_nengliangzhiguang_info:
    "限武将牌正面朝上时使用，令一名角色增加一点体力上限，回复一点体力，并摸四张牌；使用后将武将牌翻至背面",
  hsbaowu: "宝物",
  hsbaowu_huangjinyuanhou: "黄金猿猴",
  hsbaowu_huangjinyuanhou_info:
    "将你的手牌（含此张）替换为随机炉石衍生牌，并获得潜行直到下一回合开始",
  hsbaowu_cangbaotu: "藏宝图",
  hsbaowu_cangbaotu_info: "结束阶段，将一张黄金猿猴置入你的手牌；摸一张牌",
  hsyaoshui: "药水",
  hsqingyu: "青玉",

  lianzhan: "连斩",
  lianzhan_info:
    "每当你造成一次伤害，若此伤害是你本回合第一次造成伤害，你摸两张牌；否则你增加一点体力上限并回复一点体力",
  shifa: "魔瘾",
  shifa_info:
    "锁定技，每当你于回合内使用一张非转化的普通锦囊牌，你摸一张牌（每回合最多发动3次）；出牌阶段开始时，你令你与一名随机敌人各获得一张随机普通锦囊牌",
  oldshifa: "魔瘾",
  oldshifa_info:
    "锁定技，每当你于回合内使用一张非转化的普通锦囊牌，你摸一张牌；出牌阶段开始时，你令你与一名随机敌人各获得一张随机普通锦囊牌",
  yuanzheng: "远征",
  yuanzheng_info:
    "每当你对距离1以外的角色使用一张牌，你可以弃置目标区域内的一张牌",
  bzhuiji: "追击",
  bzhuiji_info:
    "每当一名角色死亡，你可以摸两张牌，并视为对杀死该角色的人使用一张决斗",
  byuhuo: "浴火",
  byuhuo2: "浴火",
  byuhuo_info:
    "觉醒技，当你进入濒死状态时，你须将体力和体力上限变为2，并将武将牌翻至背面；在你的下一准备阶段，你对所有其他角色造成两点火焰伤害，在此之前，你不能成为其他角色的卡牌的目标",
  yulu: "雨露",
  yulu_info:
    "出牌阶段限一次，你可以指定任意名角色各摸一张牌，然后各弃置区域内的一张牌",
  oldyulu: "雨露",
  oldyulu_info:
    "出牌阶段限一次，你可以指定任意名角色各摸两张牌，然后各弃置区域内的两张牌",
  duzhang: "毒瘴",
  duzhang2: "毒瘴",
  duzhang_info:
    "结束阶段，若你于本回合内未使用过锦囊牌，你可以指定一名其他角色令其下个回合无法使用锦囊牌",
  hannu: "寒怒",
  hannu_info:
    "锁定技，每当你受到一次伤害，你将手牌数翻倍；若你的手牌数因此超过10张，你随机弃置若干张手牌直到手牌数等于你当前的体力值",
  chuidiao: "垂钓",
  chuidiao_info: "锁定技，结束阶段，你随机摸0~2张牌",
  fushi: "缚誓",
  fushi_info:
    "出牌阶段限一次，你可以令一名已受伤角色失去一点体力上限并回复一点体力",
  oldfushi: "缚誓",
  oldfushi_info:
    "出牌阶段，你可以令一名已受伤角色失去一点体力上限并回复一点体力",
  hhudun: "护盾",
  hhudun_info:
    "锁定技，在每名角色的准备阶段，若你没有护甲，你获得一点护甲；每当你的护甲抵消一次伤害，你摸一张牌",
  fenlie: "分裂",
  fenlie_info:
    "锁定技，每当你于摸牌阶段外获得非特殊卡牌，你获得一张此牌的复制，每回合最多发动两次",
  oldfenlie: "分裂",
  oldfenlie_info:
    "锁定技，每当你于摸牌阶段外获得非特殊卡牌，你获得一张此牌的复制",
  nianfu: "粘附",
  nianfu_info: "锁定技，每当你造成或受到伤害，你随机获得对方装备区内的一张牌",
  xiaorong: "消融",
  xiaorong_info:
    "锁定技，你的装备牌不占用手牌上限；结束阶段，你将手牌中的每张装备牌转化为两张随机基本牌，每转化一张装备牌便回复一点体力",
  shixu: "时序",
  shixu_info: "锁定技，所有角色于出牌阶段每消耗3秒，便须于结束阶段弃置一张牌",
  qianghua: "绝手",
  qianghua_info:
    "出牌阶段内，你可以令一张你使用的基本牌或普通锦囊牌额外结算一次，每回合限一次",
  jixuan: "疾旋",
  jixuan_info: "锁定技，回合结束后，你摸一张牌进行一个额外的回合",
  biri: "蔽日",
  biri_info:
    "每当距离你1以内的一名其他角色成为杀的惟一目标时，若杀的使用者不是你，你可以弃置一张闪取消之",
  stuxi: "吐息",
  stuxi2: "吐息",
  stuxi2_bg: "息",
  stuxi_info: "锁定技，结束阶段，你令一名随机敌人下一个摸牌阶段摸牌数-1",
  bingdong: "冰冻",
  bingdong_info: "锁定技，你在一个回合内首次造成伤害后，获得一个冰冻零件",
  ronghuo: "熔火",
  ronghuo_info: "锁定技，你的普通杀均视为火杀",
  luoshi: "落石",
  luoshi_info: "锁定技，每当你受到一次伤害，你与伤害来源各随机弃置一张牌",
  moyao: "魔曜",
  moyao_info: "锁定技，你不能成为其他角色的锦囊牌的目标",
  jiaohui: "教诲",
  jiaohui_info:
    "结束阶段，若你没有于本回合内造成伤害，你可以令一名角色摸一张牌或回复一点体力",
  bimeng: "碧梦",
  bimeng_info: "结束阶段，你可以将一张随机梦境牌加入你的手牌",
  hsmengjing: "梦境",
  hsmengjing_card_config: "梦境",
  hsmengjing_feicuiyoulong: "翡翠幼龙",
  hsmengjing_feicuiyoulong_info:
    "出牌阶段对任意一名角色使用，对目标造成一点伤害",
  hsmengjing_huanxiaojiemei: "欢笑姐妹",
  hsmengjing_huanxiaojiemei_info:
    "出牌阶段对一名已受伤角色使用，令目标恢复一点体力",
  hsmengjing_suxing: "苏醒",
  hsmengjing_suxing_info: "令所有其他角色流失一点体力并随机弃置两张牌",
  hsmengjing_mengye: "梦魇",
  hsmengjing_mengye_info: "令一名角色摸1张牌，并在其下一个结束阶段弃置其所有牌",
  hsmengjing_mengjing: "梦境",
  hsmengjing_mengjing_info:
    "令一名角色将装备区内的所有牌收入手牌，并将一张乐不思蜀置于其判定区",
  hszuzhou: "诅咒",
  hszuzhou_nvwudeganguo: "女巫的钳锅",
  hszuzhou_nvwudeganguo_info:
    "出牌阶段对一名角色使用，目标弃置一张牌，然后随机获得一张炉石衍生牌",
  hszuzhou_nvwudepingguo: "女巫的苹果",
  hszuzhou_nvwudepingguo_info: "出牌阶段对一名角色使用，目标获得两张杀",
  hszuzhou_nvwudexuetu: "女巫的学徒",
  hszuzhou_nvwudexuetu_info:
    "出牌阶段对没有咒降技能的角色使用，令目标非锁定技失效，并获得技能咒降直到下一回合结束",
  hszuzhou_wushushike: "巫术时刻",
  hszuzhou_wushushike_info: "出牌阶段对所有角色使用，将手牌中的闪替换为杀",
  hszuzhou_guhuo: "蛊惑",
  hszuzhou_guhuo_info: "出牌阶段对一名其他角色使用，令其交给你一张牌",
  xjumo: "聚魔",
  xjumo_info: "锁定技，你的手牌上限+3；若你已受伤，改为+5",
  liehun: "裂魂",
  liehun_info: "锁定技，结束阶段，你获得手牌中所有非基本、非特殊牌的复制",
  malymowang: "魔网",
  malymowang_info:
    "锁定技，你的锦囊牌在每回合中造成的首次伤害+1；出牌阶段开始时，你发现一张普通锦囊牌",
  oldmalymowang: "魔网",
  oldmalymowang_info:
    "锁定技，你的锦囊牌造成的伤害+1；出牌阶段开始时，你发现一张普通锦囊牌",
  lingzhou: "灵咒",
  lingzhou_info:
    "每当你使用一张非转化的锦囊牌，可令一名角色摸一张牌或回复一点体力",
  mieshi: "灭世",
  mieshi_info:
    "锁定技，结束阶段，你流失一点体力，并对一名随机的其他角色造成一点火焰伤害",
  xshixin: "蚀心",
  xshixin_info:
    "锁定技，每当你对一名其他角色造成一次伤害，受伤害角色与你各流失一点体力",
  xshixin_info_alter:
    "锁定技，每当你对一名其他角色造成一次伤害，若受伤害角色体力值不小于你，其与你各流失一点体力",
  xmojian: "魔箭",
  xmojian_info:
    "每当你的武将牌翻至正面时，你可以指定一名角色视为对其使用了一张杀",
  enze: "恩泽",
  enze_info:
    "出牌阶段限一次，你可以指定一名角色令其手牌数与你相等（最多摸或弃三张牌）",
  oldenze: "恩泽",
  oldenze_info: "出牌阶段限一次，你可以指定一名角色令其手牌数与你相等",
  enze_info_alter:
    "出牌阶段限一次，你可以指定一名角色令其手牌数与你相等（最多摸或弃两张牌）",
  chongsheng: "重生",
  chongsheng_bg: "生",
  chongsheng_info:
    "濒死阶段，你可弃置所有牌，将体力回复至2-X，并摸2-X张牌，X为你本局发动此技能的次数。每局最多发动2次",
  s_tuteng: "神谕",
  s_tuteng_info:
    "锁定技，准备阶段，你随机获得一个图腾，若你已有至少3个图腾，则改为随机替换一个图腾",
  guozai: "过载",
  guozai2: "过载",
  guozai2_bg: "载",
  guozai_info:
    "出牌阶段限一次，你可将手牌补至四张，并于此阶段结束时弃置等量的牌",
  guozai_info_alter:
    "出牌阶段限一次，你可将手牌补至三张，并于此阶段结束时弃置等量的牌",
  guozaix: "过载",
  guozaix2: "过载",
  guozaix2_bg: "载",
  guozaix_info:
    "出牌阶段限两次，你可将手牌补至四张，并于此阶段结束时弃置等量的牌",
  oldhanshuang: "寒霜",
  oldhanshuang_info:
    "锁定技，你使用黑色牌对一名未翻面角色造成伤害后，你令受伤害角色翻面",
  hanshuang: "寒霜",
  hanshuang_info:
    "锁定技，你使用黑色牌对一名未翻面角色造成伤害后，你令受伤害角色翻面，然后你流失一点体力",
  hanshuang_info_alter:
    "锁定技，你使用黑色牌对一名未翻面角色造成伤害后，你令受伤害角色翻面并摸一张牌，然后你流失一点体力",
  bingshi: "冰噬",
  bingshi_info: "锁定技，你死亡时，对所有其他角色造成一点伤害",
  huanwu: "唤雾",
  huanwu_info:
    "出牌阶段限一次，你可以令一名角色增加一点体力上限，回复一点体力，并摸两张牌（每名角色限发动一次）",
  fengnu: "风怒",
  fengnu_info:
    "锁定技，你使用的任何卡牌无数量及距离限制；当你于回合内重复使用同名卡牌时，你摸一张牌（每回合最多以此法摸3张牌）",
  fengnu_info_alter:
    "锁定技，你使用的任何卡牌无数量限制；当你于回合内重复使用同名卡牌时，你摸一张牌（每回合最多以此法摸3张牌）",
  shengdun: "圣盾",
  shengdun2: "圣盾",
  shengdun_info: "锁定技，准备阶段，若你没有护甲，你获得一点护甲",
  jingmeng: "镜梦",
  jingmeng_info:
    "每当你于回合内使用第一张牌时，你可以从牌堆中随机获得一张与之类型相同的牌",
  kuixin: "窥心",
  kuixin_info: "结束阶段，你可以获得一名手牌数不少于你的角色的一张手牌",
  hswuji: "无羁",
  hswuji_info: "出牌阶段结束时，你可以摸X张牌，X为你本回合使用的卡牌数",
  yanshu: "炎舞",
  yanshu_info: "每回合限一次，当你弃置非基本牌后，你可以获得一张流星火雨",
  oldyanshu: "炎舞",
  oldyanshu_info: "当你弃置非基本牌后，你可以获得一张流星火雨",
  bingshuang: "冰枪",
  bingshuang_info: "你使用锦囊牌造成伤害后，可令目标摸两张牌并翻面",
  shengyan: "圣言",
  shengyan_info:
    "任意一名角色回复体力后，你可以令其额外回复一点体力，每回合限发动一次",
  qingliu: "清流",
  qingliu_info: "锁定技，你防止即将受到的火焰伤害",
  liechao: "猎潮",
  liechao_info:
    "出牌阶阶段限一次，若你的武将牌正面朝上且手牌数不大于当前体力值，你可以翻面并摸四张牌，若如此做，你跳过本回合的弃牌阶段",
  liechao_info_alter:
    "出牌阶阶段限一次，若你的武将牌正面朝上且手牌数不大于当前体力值，你可以翻面并摸三张牌，若如此做，你跳过本回合的弃牌阶段",
  aoshu: "奥术",
  aoshu_info: "出牌阶段限一次，你可以将一张黑桃牌当作无中生有使用",

  qianhou: "千喉",
  qianhou_info:
    "锁定技，准备阶段，你视为使用一张随机普通锦囊牌（随机指定目标）；若目标只有1人且不是你，你可以弃置一张手牌并获得此锦囊",
  fengxing: "风行",
  fengxing_info: "每当你于回合外首次失去牌，你可以弃置一张牌并摸两张牌",
  xinci: "心刺",
  xinci_bg: "暗",
  xinci_info: "出牌阶段限一次，你可以弃置一张黑色牌令一名角色流失一点体力",
  zhongjia: "战甲",
  zhongjia_info:
    "锁定技，每当你受到一次伤害，你获得一点护甲；当你的体力值大于1且大于手牌数时，你的护甲不为你抵挡伤害",
  dunji: "盾击",
  dunji_info:
    "出牌阶段限一次，你可以对攻击范围内的至多X名其他角色各造成一点伤害，并失去等量的护甲，X为你的护甲数",
  qiaodong: "巧动",
  qiaodong_info: "你可以将一张装备牌当作闪使用或打出",
  fengxian: "奉献",
  fengxian_info: "出牌阶段限一次，你可以令场上所有角色各弃置一张手牌",
  zhanhou: "战吼",
  zhanhou_info: "出牌阶段限一次，你可以弃置一张防具牌并获得一点护甲",
  oldzhanhou: "战吼",
  oldzhanhou_info: "出牌阶段，你可以弃置一张防具牌并获得一点护甲",
  anying: "暗影",
  anying_info:
    "限定技，出牌阶段，你可以弃置一张黑色牌，失去技能圣光，并获得技能心刺",
  shijie: "视界",
  shijie_info: "结束阶段，你可以获得一名其他角色的一张手牌，然后该角色摸一张牌",
  shengguang: "圣光",
  shengguang_info: "出牌阶段限一次，你可以弃置一张红色牌令一名角色回复一点体力",
  bingjia: "冰甲",
  bingjia2: "冰甲",
  bingjia_info:
    "出牌阶段，若你武将牌上没有牌，你可以将一张手牌背面朝上置于你的武将牌上，当你成为其他角色的与此牌花色相同的牌的目标时，你移去此牌，获得一点护甲，并且本回合内防止一切伤害",
  bianxing: "变形",
  bianxing_info:
    "当一其他角色于回合内使用卡牌指定了惟一的其他目标后，你可以用一张合理的基本牌替代此牌，每名角色的回合限一次",
  xianzhi: "先知",
  xianzhi_info:
    "任意一名角色进行判定前，你可以观看牌堆顶的两张牌，并可以将其调换顺序",
  mdzhoufu: "缚魂",
  mdzhoufu2: "缚魂",
  mdzhoufu_info:
    "出牌阶段，你可以将一张黑色手牌置于一名其他角色的武将牌上，在其判定时以此牌作为判定结果，然后你获得亮出的判定牌",
  zuzhou: "诅咒",
  zuzhou_info:
    "锁定技，准备阶段，若场上没有浮雷且你手牌中有黑桃牌，你将牌堆中的一张浮雷置于你的判定区；当一名角色受到浮雷伤害时，你移去此浮雷",
  zuzhou_old_info:
    "每当你造成或受到一次伤害，你可以令伤害目标或来源进行一次判定，若结果为黑色，其流失一点体力",
  jingxiang: "镜像",
  jingxiang_info:
    "每回合限一次，当你需要打出卡牌时，你可以观看一名角色的手牌并将其视为你的手牌打出",
  jingxiang_info_alter:
    "每回合限一次，当你需要打出卡牌时，你可以观看一名手牌数不多于你的角色的手牌并将其视为你的手牌打出",
  tuteng: "图腾",
  tuteng_info:
    "出牌阶段，你可以获得一个随机基础图腾；每当你受到一次伤害，你随机失去一个图腾",
  zuling: "祖灵",
  zuling_info:
    "觉醒技，准备阶段，若你拥有至少3个图腾，你失去一点体力上限，并将图腾描述中的“获得一个随机基础图腾”改为“获得任意一个图腾（若有4个图腾则改为替换一个图腾）”",
  tuteng1: "治疗图腾",
  tuteng1_info: "结束阶段，你回复一点体力",
  tuteng2: "灼热图腾",
  tuteng2_info: "每当你造成一次伤害，你摸一张牌",
  tuteng3: "石爪图腾",
  tuteng3_info: "你受到下一次伤害时，令伤害-1，然后失去此图腾",
  tuteng4: "空气图腾",
  tuteng4_info: "在你的回合内，你的锦囊牌造成的首次伤害+1",
  tuteng5: "法潮图腾",
  tuteng5_info: "结束阶段，你摸一张牌",
  tuteng6: "火舌图腾",
  tuteng6_info: "在你的回合内，你的杀造成的首次伤害+1",
  tuteng7: "活力图腾",
  tuteng7_info: "结束阶段，你令一名其他角色回复一点体力",
  tuteng8: "图腾魔像",
  tuteng8_info: "你的进攻距离+1",
  tzhenji: "震击",
  tzhenji_info:
    "每当你因弃置而失去黑色牌，可对一名角色造成1点雷电伤害，并随机弃置其一张牌，每回合限发动一次",
  fenliu: "分流",
  fenliu_info: "出牌阶段限一次，你可以失去一点体力并获得3张牌",
  hongxi: "虹吸",
  hongxi_info: "锁定技，每当有一名角色死亡，你将体力回复至体力上限",
  jihuo: "激活",
  jihuo_info: "在你的回合结束后，你可以弃置一张手牌并进行一个额外的回合",
  jianren: "刃舞",
  jianren_info:
    "出牌阶段限一次，你可以弃置装备区内的武器牌，对所有其他角色造成一点伤害",
  mengun: "闷棍",
  mengun2: "闷棍",
  mengun_info:
    "每当一名其他角色于回合内使用基本牌，你可以弃置一张与之花色相同的牌令其收回此牌，且在本回合内不能再次使用，每回合限一次",
  wlianji: "连击",
  wlianji_info:
    "结束阶段，若你本回合使用的卡牌数大于你当前的体力值，你可以摸两张牌",
};

export const translate_jiange = {
  jg_pangtong: "浴火士元",
  jg_huangyueying: "工神月英",
  jg_zhugeliang: "天侯孔明",
  jg_liubei: "烈帝玄德",
  jg_xiahouyuan: "绝尘妙才",
  jg_caozhen: "佳人子丹",
  jg_zhanghe: "巧魁儁乂",
  jg_simayi: "断狱仲达",
  tianyu: "天狱",
  zhinang: "智囊",
  jingmiao: "精妙",
  biantian: "变天",
  biantian2: "大雾",
  biantian3: "狂风",
  jizhen: "激阵",
  xuanlei: "玄雷",
  xuanlei_info:
    "锁定技，准备阶段，你令所有判定区内有牌的其他角色受到1点雷电伤害",
  sfanshi: "反噬",
  sfanshi_info: "锁定技，结束阶段，你失去1点体力",
  konghun: "控魂",
  konghun_info:
    "出牌阶段开始时，若你的体力值不大于1（场上存活角色数不小于6时改为2），你可以对至多X名角色各造成1点雷电伤害，然后你恢复等量体力，X为场上其他存活角色数的一半（向下取整且至多为4）",
  jizhen_info: "结束阶段，你可以令所至多两名已受伤角色摸一张牌",
  // biantian2_info:'已获得大雾标记',
  // biantian3_info:'已获得狂风标记',
  lingfeng: "灵锋",
  jueji: "绝汲",
  huodi: "惑敌",
  huodi_info:
    "结束阶段，若你本回合内没有使用过指定其他角色为目标的卡牌，你可以弃置一名其他角色的一张牌",
  jueji_info:
    "其他角色的摸牌阶段开始时，若其已受伤，你可以弃置一张牌令其摸牌数-1",
  lingfeng_info:
    "摸牌阶段，你可以弃置摸牌，改为亮出牌堆顶的两张牌并获得之，若两张牌颜色不同，你可以弃置一名角色的一张牌",
  biantian_info:
    "锁定技，准备阶段，你进行一次判定，若为红色，你可以选择至多三名角色进入“狂风”状态直到你的下一回合开始，若为黑桃，直到下个回合开始前，你处于“大雾”状态",
  jingmiao_info: "每当有一名其他角色使用无懈可击，你可以弃置其一张牌",
  zhinang_info:
    "准备阶段，你可以亮出牌堆顶的三张牌，你可以将其中锦囊或装备牌交给一名角色",
  tianyu_info: "结束阶段，你可以将任意名未横置的其他角色横置",
  juechen: "绝尘",
  juechen_info:
    "每当你使用一张杀，可以弃置一名其他角色的一张牌（不能是杀的目标）",
  chiying: "持盈",
  chiying_info:
    "每当一名角色受到多于1伤害时，你可以令其防止其余伤害，然后令伤害来源摸一张牌",
  jingfan: "惊帆",
  jingfan2: "惊帆",
  jingfan_info:
    "回合内，每当你使用一张卡牌，你的进攻距离+1；出牌阶段结束时，你可以将手牌数补至X，并指定至多X名角色令其进攻距离+1直到其下一回合结束，X为你回合内使用的卡牌数",
};

export const translate_mobile = {
  liuzan: "手杀留赞",
  re_sp_zhugeliang: "手杀卧龙",
  ly_piliche: "霹雳车",
  ly_piliche_info: "当你对其他角色造成伤害后，你可以弃置其装备区内的所有牌。",
  polu: "破橹",
  polu_info:
    "锁定技，回合开始时，若【霹雳车】未加入游戏或在牌堆/弃牌堆内，则你使用之；当你受到1点伤害后，若你的装备区里没有【霹雳车】，则你摸一张牌并使用牌堆中的一张随机武器牌。",
  choulve: "筹略",
  choulve_info:
    "出牌阶段开始时，你可以令一名其他角色交给你一张牌，若其如此做，视为你使用上一张对你过造成伤害且不为延时锦囊牌的牌。",
  tunchu: "屯储",
  tunchu_info:
    "摸牌阶段，若你没有「粮」，你可以多摸两张牌。若如此做，摸牌阶段结束时，你可以将任意张手牌置于你的武将上，称为「粮」，只要你的武将牌上有「粮」，你便不能使用【杀】",
  shuliang: "输粮",
  shuliang_info:
    "一名角色的结束阶段开始时，若其手牌数少于体力值，你可以移去一张「粮」，然后该角色摸两张牌",
  fenyin: "奋音",
  yingjian: "影箭",
  fenyin_info:
    "你的回合内，当你使用牌时，若此牌与你于此回合内使用的上一张牌的颜色不同，则你可以摸一张牌。",
  yingjian_info: "准备阶段开始时，你可以视为使用一张无距离限制的【杀】。",
  dujin: "独进",
  dujin_info:
    "摸牌阶段，你可以多摸X+1张牌。（X为你装备区里牌数的一半且向下取整）",
  shixin: "释衅",
  shixin_info: "锁定技，当你受到火属性伤害时，你防止此伤害。",
  zhaohuo: "招祸",
  zhaohuo_info:
    "锁定技，当其他角色进入濒死状态时，你将体力上限调整为1点。若你的体力上限因此减少，则你摸X张牌。（X为你以此法减少的体力上限）",
  yixiang: "义襄",
  yixiang_info:
    "每名角色的回合限一次，当你成为一名角色使用牌的目标后，若该角色的体力值大于你的体力值，你可以随机获得牌堆里的一张你没有的基本牌。",
  yirang: "揖让",
  yirang_info:
    "出牌阶段开始时，你可以将所有非基本牌交给一名体力上限大于你的其他角色，然后调整体力上限至与该角色相同并回复X点体力（X为你以此法交给其的牌的类别数）。",
  kuangcai: "狂才",
  kuangcai_info:
    "出牌阶段开始时，你可以令你此阶段内的主动出牌时间变为5秒。若如此做，你于此阶段内使用牌没距离和次数限制，且每当你于此阶段内使用牌时，你摸一张牌且主动出牌时间-1秒。若主动出牌时间减至0，则你结束出牌阶段。",
  shejian: "舌剑",
  shejian_info:
    "弃牌阶段结束时，若你于此阶段弃置的所有牌花色均不相同，则你可以弃置一名其他角色的一张牌。",
  xinfu_daigong: "怠攻",
  xinfu_daigong_info:
    "每回合限一次。当你受到伤害时，你可以展示所有手牌，然后令伤害来源选择一项：交给你一张与你所有手牌花色均不相同的一张牌，或防止此伤害。",
  xinfu_zhaoxin: "昭心",
  xinfu_zhaoxin_info:
    "出牌阶段限一次，你可以将任意张手牌置于武将牌上并摸等量的牌，称之为「望」（你至多拥有三张「望」）。你或你攻击范围内的一名其他角色的摸牌阶段结束后，其可以获得一张由你选择的「望」，然后你可以对其造成1点伤害。",
  zhaoxin_give: "昭心",
  zhaoxin_give_info: "",
  xinfu_qianchong: "谦冲",
  xinfu_qianchong_info:
    "锁定技，若你的装备区内有牌且：均为红色，则你视为拥有技能〖明哲〗。均为黑色，则你视为拥有技能〖帷幕〗。若均不满足，则出牌阶段开始时，你可以选择一种类别的牌，然后你本回合内使用该类别的牌时没有次数和距离限制。",
  qc_weimu: "帷幕",
  qc_weimu_info: "",
  qc_mingzhe: "明哲",
  qc_mingzhe_info: "",
  xinfu_shangjian: "尚俭",
  xinfu_shangjian_info:
    "锁定技。一名角色的结束阶段开始时，若你于此回合内失去了X张或更少的牌，则你可以摸等量的牌（X为你的体力值）。",
  rw_bagua_skill: "先天八卦阵",
  rw_bagua_skill_info:
    "当你需要使用或打出一张【闪】时，你可以进行判定，若判定结果不为黑桃，视为你使用或打出了一张【闪】。",
  rw_baiyin_skill: "照月狮子盔",
  rw_baiyin_skill_info:
    "锁定技，当你受到大于1的伤害时，你将伤害值改为1；当你失去装备区里的【照月狮子盔】时，你回复1点体力并摸两张牌。",
  rw_lanyinjia: "精银甲",
  rw_lanyinjia_info:
    "你可以将一张手牌当做【闪】使用或打出。锁定技，【精银甲】不会无效。",
  rw_minguangkai_cancel: "耀光铠",
  rw_minguangkai_cancel_info:
    "锁定技，当你成为【火烧连营】、【火攻】或火【杀】的目标时，或即将被横置时，取消之。",
  rw_minguangkai_link: "耀光铠",
  rw_minguangkai_link_info:
    "锁定技，当你成为【火烧连营】、【火攻】或火【杀】的目标时，或即将被横置时，取消之。",
  rw_renwang_skill: "仁王金刚盾",
  rw_renwang_skill_info: "黑色【杀】和红桃【杀】对你无效。",
  rw_tengjia1: "桐油百韧甲",
  rw_tengjia1_info:
    "锁定技，【南蛮入侵】、【万箭齐发】和普【杀】对你无效。当你受到火焰伤害时，此伤害+1。当你即将被横置时，取消之。",
  rw_tengjia2: "桐油百韧甲",
  rw_tengjia2_info:
    "锁定技，【南蛮入侵】、【万箭齐发】和普【杀】对你无效。当你受到火焰伤害时，此伤害+1。当你即将被横置时，取消之。",
  rw_tengjia3: "桐油百韧甲",
  rw_tengjia3_info:
    "锁定技，【南蛮入侵】、【万箭齐发】和普【杀】对你无效。当你受到火焰伤害时，此伤害+1。当你即将被横置时，取消之。",
  rw_tengjia4: "桐油百韧甲",
  rewrite_bagua: "先天八卦阵",
  rewrite_bagua_info:
    "当你需要使用或打出一张【闪】时，你可以进行判定，若判定结果不为黑桃，视为你使用或打出了一张【闪】。",
  rewrite_baiyin: "照月狮子盔",
  rewrite_baiyin_info:
    "锁定技，当你受到大于1的伤害时，你将伤害值改为1；当你失去装备区里的【照月狮子盔】时，你回复1点体力并摸两张牌。",
  rewrite_lanyinjia: "精银甲",
  rewrite_lanyinjia_info:
    "你可以将一张手牌当做【闪】使用或打出。锁定技，【精银甲】不会无效。",
  rewrite_minguangkai: "耀光铠",
  rewrite_minguangkai_info:
    "锁定技，当你成为【火烧连营】、【火攻】或火【杀】的目标时，或即将被横置时，取消之。",
  rewrite_renwang: "仁王金刚盾",
  rewrite_renwang_info: "黑色【杀】和红桃【杀】对你无效。",
  rewrite_tengjia: "桐油百韧甲",
  rewrite_tengjia_info:
    "锁定技，【南蛮入侵】、【万箭齐发】和普【杀】对你无效。当你受到火焰伤害时，此伤害+1。当你即将被横置时，取消之。",
  rewrite_zhuge: "元戎精械弩",
  rewrite_zhuge_info: "锁定技，你于出牌阶段内使用【杀】无次数限制。",
  rw_zhuge_skill: "诸葛连弩",
  rw_zhuge_skill_info: "锁定技，你于出牌阶段内使用【杀】无次数限制。",
  takaramono: "宝物",
  wolong_card: "卧龙",
  wolong_card_info:
    "对一名角色造成1点火焰伤害。若场上有存活的诸葛亮(火)，则改为对至多两名角色各造成1点火焰伤害。",
  fengchu_card: "凤雏",
  fengchu_card_info:
    "横置至多三名角色。若场上有存活的庞统(火)，则改为横置至多四名角色。",
  xuanjian_card: "玄剑",
  xuanjian_card_info:
    "令一名角色摸一张牌并回复1点体力。若场上有存活的徐庶(将/界)，则改为令一名角色摸一张牌并回复1点体力，然后你摸一张牌。",
  shuijing_card: "水镜",
  shuijing_card_info:
    "将一名角色装备区内的防具牌移动到另一名角色对应区域。若场上有存活的司马徽，则改为将1名角色装备区内的1件装备移动到另1角色对应区域。",
  xinfu_pingcai: "评才",
  xinfu_pingcai_info:
    "出牌阶段限一次，你可以挑选一个宝物并擦拭掉其上面的灰尘。然后，你可以根据宝物类型执行对应的效果。",
  xinfu_pdgyingshi: "隐世",
  xinfu_pdgyingshi_info:
    "锁定技，你始终跳过准备阶段，判定阶段，结束阶段。你不能被选择为延时锦囊牌的目标。",
  pcaudio_wolong_card: "卧龙",
  pcaudio_wolong_card_info: "",
  pcaudio_fengchu_card: "凤雏",
  pcaudio_fengchu_card_info: "",
  pcaudio_shuijing_card: "水镜",
  pcaudio_shuijing_card_info: "",
  pcaudio_xuanjian_card: "玄剑",
  pcaudio_xuanjian_card_info: "",
  yizan_respond_sha: "翊赞",
  yizan_respond_sha_info: "",
  yizan_use: "翊赞",
  yizan_use_backup: "翊赞",
  yizan_use_info:
    "你可以将两张牌（其中至少一张为基本牌）当做任意基本牌使用或打出。",
  yizan_respond_shan: "翊赞",
  yizan_respond_shan_info: "",
  xinfu_longyuan: "龙渊",
  xinfu_longyuan_info:
    "觉醒技，准备阶段，若你本局游戏内发动过〖翊赞〗的次数大于等于3，则你修改〖翊赞〗。",
  yizan_rewrite: "翊赞·改",
  yizan_rewrite_info: "你可以将一张基本牌当做任意基本牌使用或打出。",
  yizan_count: "翊赞",
  yizan_count_info: "",
  xinfu_jingxie1: "精械",
  xinfu_jingxie1_info:
    "出牌阶段，你可以展示一张未强化过的【诸葛连弩】或标准包/军争包/SP包中的防具牌，然后对其进行强化。当你处于濒死状态时，你可以重铸一张防具牌，然后将体力回复至1点。",
  xinfu_jingxie2: "精械",
  xinfu_jingxie2_info: "",
  xinfu_qiaosi: "巧思",
  xinfu_qiaosi_info:
    "出牌阶段限一次，你可以投掷一枚六面骰子，展示牌堆顶的X张牌并获得之。然后，你选择一项：1.交给一名其他角色X张牌。2.弃置X张牌。（X为骰子的点数）",
  xin_xiahoudun: "手杀夏侯惇",
  xinqingjian: "清俭",
  xinqingjian2: "清俭",
  xinqingjian_info:
    "每回合限一次。当你不因摸牌阶段的额定摸牌而获得牌时，你可以将任意张牌扣置于武将牌上。回合结束时，你将这些牌交给一名其他角色。若这些牌的数量大于1，你摸一张牌。",
  zhangyì: "张翼",
  jiakui: "贾逵",
  zhiyi: "执义",
  zhiyi_info:
    "锁定技，当你于一回合内使用或打出第一张基本牌时，你选择一项：1.摸一张牌。2.于此牌A（若此牌是因响应牌B而使用或打出的，则改为牌B）的使用或打出流程结算完成后，视为使用一张与此牌名称和属性相同的卡牌。",
  rezhiyi: "执义",
  rezhiyi_info:
    "锁定技，一名角色的结束阶段开始时，若你本回合内使用或打出过基本牌，则你选择一项：1.摸一张牌。2.视为使用一张本回合内使用或打出过的基本牌。",
  zhongzuo: "忠佐",
  zhongzuo_info:
    "一名角色的结束阶段开始时，若你于此回合内造成或受到过伤害，则你可以令一名角色摸两张牌。若该角色已受伤，则你摸一张牌。",
  wanlan: "挽澜",
  wanlan_info:
    "限定技，当一名角色进入濒死状态时，你可以弃置所有手牌并令其回复体力至1点，然后对当前回合角色造成1点伤害。",
  re_jikang: "手杀嵇康",
  old_caochun: "旧曹纯",
  shenpei: "审配",
  re_wangyun: "手杀王允",
  relianji: "连计",
  relianji_info:
    "出牌阶段限一次，你可以选择两名其他角色。第一名角色随机使用牌堆中的一张武器牌，然后这名角色视为对另一名角色随机使用一张下列的牌名的牌：【决斗】、【火攻】、【南蛮入侵】、【万箭齐发】或普【杀】。然后若此牌造成伤害，你获得X枚“连计”标记（X为此次扣减的体力值点数）。",
  remoucheng: "谋逞",
  remoucheng_info:
    "觉醒技，当一名角色因〖连计〗造成伤害后，若你拥有的“连计”标记数大于2，你加1点体力上限，回复1点体力，失去“连计”，获得“矜功”。",
  mobile_default: "常规",
  mobile_others: "其他",

  db_atk: "进攻对策",
  db_atk1: "全军出击",
  db_atk2: "分兵围城",
  db_def: "防御对策",
  db_def1: "奇袭粮道",
  db_def2: "开城诱敌",

  shouye: "守邺",
  shouye_info:
    "每回合限一次。当其他角色使用牌指定你为唯一目标时，你可以与其进行【对策】。若你赢，则你取消此牌的目标，且你于此牌结算完成后获得其对应的所有实体牌。",
  liezhi: "烈直",
  liezhi_info:
    "准备阶段，你可以依次弃置至多两名其他角色区域内的各一张牌。若你受到过伤害，则〖烈直〗于你的下个回合无效。",

  xinzhanyi: "战意",
  xinzhanyi_info:
    "出牌阶段限一次，你可以弃置一张牌并失去1点体力，然后根据你弃置的牌获得以下效果直到回合结束：基本牌，你可以将一张基本牌当作杀、酒或桃使用，且你本回合第一次以此法使用的牌的回复值/伤害值+1；锦囊牌，摸三张牌且你使用的牌不能被【无懈可击】响应；装备牌，你使用【杀】指定唯一目标后，其弃置两张牌，然后你获得其中的一张。",
  xinzhanyi_basic_backup: "战意",
  xinzhanyi_basic: "战意",
  xinzhanyi_equip: "战意",

  meiyong: "姝勇",
  meiyong_info:
    "当你使用或打出【杀】时，你可以获得一名其他角色的一张牌，然后其摸一张牌。",
  rexushen: "许身",
  rexushen_info:
    "限定技，出牌阶段，你可以失去X点体力（X为场上男性角色的数量）。若你以此法进入了濒死状态，则当你因一名角色而脱离此濒死状态后，你可以令其获得技能〖武圣〗和〖当先〗。",
  rezhennan: "镇南",
  rezhennan_info:
    "当你成为其他角色使用的牌的目标后，若此牌的目标数大于该角色的体力值，则你可以弃置一张牌并对其造成1点伤害。",

  hujinding: "胡金定",
  huaizi: "怀子",
  huaizi_info: "锁定技，你的手牌上限为你的体力上限。",
  renshi: "仁释",
  renshi_info:
    "锁定技，当你受到【杀】的伤害时，若你已受伤，则你防止此伤害并获得此【杀】对应的所有实体牌，然后减1点体力上限。",
  wuyuan: "武缘",
  wuyuan_info:
    "出牌阶段限一次，你可将一张【杀】交给一名其他角色，然后你回复1点体力，其摸一张牌。若此【杀】为：红色【杀】，其回复1点体力；属性【杀】，其改为摸两张牌。",

  re_weiwenzhugezhi: "手杀卫温诸葛直",
  re_xugong: "手杀许贡",
  re_zhanggong: "手杀张恭",
  reqianxin: "遣信",
  reqianxin_info:
    "出牌阶段限一次，你可将至多两张手牌随机交给等量的其他角色，称为「信」。这些角色的准备阶段开始时，若其手牌中有「信」，则其选择一项：令你摸两张牌，本回合手牌上限-2。",
  rebiaozhao: "表召",
  rebiaozhao_info:
    "结束阶段，你可以将一张牌置于武将牌上，称为「表」。当有一张与「表」点数相同的牌进入弃牌堆后，你将「表」置入弃牌堆并失去1点体力。准备阶段，若你的武将牌上有「表」，则你移去「表」并选择一名角色，该角色回复1点体力并摸三张牌。",
  rebiaozhao2: "表召",
  rebiaozhao2_info: "",
  rebiaozhao3: "表召",
  rebiaozhao3_info: "",
  refuhai: "浮海",
  refuhai_info:
    "出牌阶段限一次，你可令其他角色同时在「潮起」和「潮落」中选择一项，并依次展示这些角色的选项。若从你下家开始选择了相同选项的角色数目大于1，则你摸X张牌（X为连续相同结果的数量）。",
  qiaosi: "巧思",
  qiaosi_info:
    "出牌阶段限一次，你可以表演「大键角色图」并根据表演结果获得相应的牌。然后，你选择一项：1.弃置X张牌。2.将X张牌交给一名其他角色。（X为你以此法获得的牌数）",
  qiaosi_map: "大键角色图",
  qiaosi_map_info:
    "<br><li>星野 梦美：锦囊牌*2<br><li>能美 库特莉亚芙卡：装备牌/【杀】/【酒】*1<br><li>友利 奈绪：【杀】/【酒】*1<br><li>神尾 观铃：【闪】/【桃】*1<br><li>伊吹 风子：锦囊牌/【闪】/【桃】*1<br><li>仲村 由理：装备牌*2<br><li>Illustration: うら;Twitter:@ura530",
  qiaosi_c1:
    '<img src="' +
    "(lib.assetURL)" +
    'image/card/qiaosi_card1.png" width="60" height="60"> ',
  //星野 梦美
  qiaosi_c2:
    '<img src="' +
    "(lib.assetURL)" +
    'image/card/qiaosi_card2.png" width="60" height="60"> ',
  //能美 库特莉亚芙卡
  qiaosi_c3:
    '<img src="' +
    "(lib.assetURL)" +
    'image/card/qiaosi_card3.png" width="60" height="60"> ',
  //友利 奈绪
  qiaosi_c4:
    '<img src="' +
    "(lib.assetURL)" +
    'image/card/qiaosi_card4.png" width="60" height="60"> ',
  //神尾 观铃
  qiaosi_c5:
    '<img src="' +
    "(lib.assetURL)" +
    'image/card/qiaosi_card5.png" width="60" height="60"> ',
  //伊吹 风子
  qiaosi_c6:
    '<img src="' +
    "(lib.assetURL)" +
    'image/card/qiaosi_card6.png" width="60" height="60"> ',
  //仲村 由理
  mobile_sunben: "那个男人",
  //孙笨

  yangbiao: "杨彪",
  zhaohan: "昭汉",
  zhaohan_info:
    "锁定技，你的第1-4个准备阶段开始时，你加1点体力上限并回复1点体力，你的第5-7个准备阶段开始时，你减1点体力上限。",
  rangjie: "让节",
  rangjie_info:
    "当你受到1点伤害后，你可以选择一项并摸一张牌：获得牌堆里你选择的类型的一张牌，或移动场上的一张牌。",
  yizheng: "义争",
  yizheng2: "义争",
  yizheng_info:
    "出牌阶段限一次，你可以和一名体力值不大于你的其他角色拼点。若你赢，其跳过下个摸牌阶段。若你没赢，你减1点体力上限。",
  re_heqi: "手杀贺齐",
  reqizhou: "绮胄",
  reqizhou_info:
    "锁定技，你根据装备区里牌的花色数获得以下技能：1种或以上：〖英姿〗；2种或以上：〖奇袭〗；3种或以上：〖旋风〗。",
  reshanxi: "闪袭",
  reshanxi2: "闪袭",
  reshanxi_info:
    "出牌阶段开始时，你可以弃置一张红色基本牌并选择一名有牌的其他角色，将其的至多X张牌置于其的武将牌上（X为你的体力值）。回合结束时，该角色获得这些牌。",
  chendeng: "手杀陈登",
  zhouxuan: "周旋",
  zhouxuan2: "周旋",
  zhouxuan_info:
    "出牌阶段限一次，你可以弃置一张牌并指定一名角色，然后选择一个基本牌的名称或非基本牌的类型。其使用或打出下一张牌时，若此牌的名称或类型和你选择的相同，则你观看牌堆顶的三张牌，然后将这些牌分配给任意角色。",
  fengji: "丰积",
  fengji_info:
    "锁定技，回合结束时，你记录你的手牌数。准备阶段开始时，若你的手牌数不小于你记录的手牌数，则你摸两张牌且本回合手牌上限为体力上限。",
  re_guanqiujian: "手杀毌丘俭",
  rezhengrong: "征荣",
  rehongju: "鸿举",
  reqingce: "清侧",
  reqingce_backup: "清侧",
  rezhengrong_info:
    "当你于出牌阶段使用的指定了其他角色为目标的牌结算完成后，若此牌是你本局游戏内于出牌阶段使用的指定了其他角色为目标的第偶数张牌，则你可以将一名其他角色角色的随机一张牌置于你的武将牌上，称为「荣」。",
  rehongju_info:
    "觉醒技，准备阶段，若你武将牌上「荣」的数量不小于3且有角色死亡，则你摸等同于「荣」数量的牌。然后可以用任意数量的手牌交换等量的「荣」。你减1点体力上限并获得技能〖清侧〗。",
  reqingce_info:
    "出牌阶段，你可以将一张「荣」置入弃牌堆，然后弃置场上的一张牌。",
  re_pangtong: "手杀庞统",
  dongcheng: "手杀董承",
  chengzhao: "承诏",
  chengzhao_info:
    "一名角色的结束阶段，若你于本回合内获得了两张以上的牌，则你可以与一名其他角色拼点。若你赢，你视为对其使用一张无视防具的【杀】。",
  yangyi: "手杀杨仪",
  duoduan: "度断",
  duoduan_info:
    "每回合限一次，当你成为【杀】的目标后，你可以重铸一张牌。若如此做，你选择一项：①令使用者摸两张牌，且此【杀】无效。②令使用弃置一张牌，且你不能响应此【杀】。",
  gongsun: "共损",
  gongsun_info:
    "出牌阶段开始时，你可以弃置两张牌并指定一名其他角色。你选择一个基本牌或普通锦囊牌的牌名。直到你的下回合开始或你死亡，你与其不能使用或打出或弃置此名称的牌。",
  gongsun_shadow: "共损",
  xin_chengpu: "手杀程普",
  relihuo: "疠火",
  relihuo_damage: "疠火",
  relihuo_baigei: "疠火",
  relihuo_info:
    "当你使用普【杀】时，你可以将此杀改为火属性。若如此做，当你因执行此【杀】的效果而对横置角色造成伤害时，此伤害+1；当你使用的火【杀】结算完成后，你失去X点体力（X为你因此【杀】造成的伤害总点数的一半且向下取整）",
  dengzhi: "手杀邓芝",
  jimeng: "急盟",
  jimeng_info:
    "出牌阶段开始时，你可以获得一名其他角色的一张牌，然后交给该角色X张牌（X为你当前体力值）。",
  shuaiyan: "率言",
  shuaiyan_info:
    "弃牌阶段开始时，若你的手牌数大于1，则你可以展示所有手牌，然后你令一名其他角色交给你一张牌。",
  zhengxuan: "郑玄",
  zhengjing: "整经",
  zhengjing_info:
    "出牌阶段，你可以整理卡牌。然后，你将整理出的卡牌中的至少一张作为“经”置于一名角色的武将牌上，然后获得其余的牌。该角色的准备阶段获得这些牌，且跳过此回合的判定和摸牌阶段。",
  zhengjing2: "整经",

  mobile_yijiang: "将星独具",
  yj_zhanghe: "☆张郃",
  yj_zhangliao: "☆张辽",
  yj_xuhuang: "☆徐晃",
  yj_ganning: "☆甘宁",
  xhzhiyan: "治严",
  xhzhiyan_info:
    "出牌阶段，若你的手牌数不等于体力上限，则你可以将手牌摸至/弃至手牌上限，然后本回合不能对其他角色使用牌/可以将弃置的一张牌交给一名其他角色。",
  zhilve: "知略",
  zhilve_info:
    "锁定技，准备阶段，你选择一项：1.移动场上装备区的一张牌并失去1点体力。2.移动场上判定区的一张牌并令本回合手牌上限-1。3.本回合摸牌阶段多摸一张牌且使用的第一张【杀】无距离限制且不计入次数限制。",
  xinzhilve: "知略",
  xinzhilve_backup: "知略",
  xinzhilve_mark: "知略",
  xinzhilve_info:
    "出牌阶段限一次，你可以失去1点体力并选择一项：1.移动场上的一张牌；2.视为使用一张无距离限制且不计入次数限制的【杀】并摸一张牌。然后你本回合的手牌上限+1。",
  xinxhzhiyan: "治严",
  xinxhzhiyan_false: "治严",
  xinxhzhiyan_info:
    "出牌阶段每项各限一次，若你的手牌数：大于体力值，则你可以将X张手牌交给一名其他角色（X为你的手牌数与体力值之差）；小于体力上限，则你可以摸X张牌且本阶段内不能再对其他角色使用牌。（X为你的手牌数与体力上限之差）",
  weifeng: "威风",
  weifeng2: "威风",
  weifeng3: "威风",
  weifeng_info:
    "锁定技，当你于出牌阶段内使用第一张伤害性基本牌或普通锦囊牌后，你令此牌的一名没有“惧”的其他目标角色获得一枚名称为此牌牌名的“惧”。有“惧”的角色受到伤害时，其移去“惧”，然后若造成伤害的牌名称和“惧”：相同，此伤害+1；不同，你获得该角色的一张牌。准备阶段开始时或你死亡时，你移去场上的所有“惧”。",
  gnjinfan: "锦帆",
  gnjinfan_gain: "锦帆",
  gnjinfan_info:
    "弃牌阶段开始时，你可将任意张手牌置于武将牌上，称为“铃”（每种花色的“铃”限一张）。你可以如手牌般使用或打出“铃”。当有“铃”移动到处理区后，你从牌堆中获得与“铃”花色相同的一张牌。",
  gnsheque: "射却",
  gnsheque_info:
    "一名其他角色的准备阶段开始时，若其装备区内有牌，则你可以对其使用一张【杀】（无距离关系的限制且无视防具）。",
  sp_sufei: "手杀苏飞",
  zhengjian: "诤荐",
  zhengjian_draw: "诤荐",
  zhengjian_mark: "诤荐",
  zhengjian_info:
    "锁定技，结束阶段，你令一名角色获得一枚“诤”。回合开始时，你令有“诤”的角色移去“诤”并摸X张牌（X为其最后一次获得“诤”后使用和打出的牌数，且至多不能超过其体力上限或5）。",
  gaoyuan: "告援",
  gaoyuan_info:
    "当你成为【杀】的目标时，你可弃置一张牌将此【杀】转移给一名有“诤”且不是此【杀】使用者的其他角色。",
  tongqu: "通渠",
  tongqu_info:
    "游戏开始时，你拥有一个“渠”标记。准备阶段，你可以失去1点体力令一名没有“渠”标记的角色获得“渠”标记。有“渠”的角色摸牌阶段额外摸一张牌，然后将一张牌交给其他有“渠”的角色或弃置。若以此法给出的是装备牌则使用之。当有“渠”的角色进入濒死状态时，移除其“渠”标记。",
  xinwanlan: "挽澜",
  xinwanlan_info:
    "当一名角色受到会令其进入濒死状态的伤害时，你可以弃置装备区中的所有牌（至少一张） 防止此伤害。",
  re_xusheng: "手杀徐盛",
  re_dongzhuo: "手杀董卓",
  rejiuchi: "酒池",
  rejiuchi_info:
    "你可以将一张黑桃手牌当做【酒】使用。锁定技，当你于回合内使用带有【酒】效果的【杀】造成伤害时，你令你的【崩坏】失效直到回合结束。",
  furong: "傅肜",
  xuewei: "血卫",
  xuewei_info:
    "准备阶段，你可以选择一名其他角色（仅自己可见）。若如此做，直到你的下回合开始前，当其第一次受到伤害时，你防止此伤害，改为由你受到等量的伤害并对伤害来源造成等量同属性的伤害。",
  liechi: "烈斥",
  liechi_info: "锁定技，当你进入濒死状态时，伤害来源弃置一张牌。",
  xin_liaohua: "手杀廖化",
  redangxian: "当先",
  redangxian_info:
    "锁定技，回合开始时，你从弃牌堆中获得一张【杀】并进行一个额外的出牌阶段。",
  refuli: "伏枥",
  refuli_info:
    "限定技，当你处于濒死状态时，你可以将体力值回复至X点（X为势力数）。然后若你的体力值为全场唯一最多，你翻面。",
  xin_caozhang: "手杀曹彰",
  rejiangchi: "将驰",
  rejiangchi_info:
    "出牌阶段开始时，你可以选择一项：1、摸一张牌，若如此做，你本阶段内不能使用【杀】。 2、弃置一张牌，若如此做，此阶段你使用【杀】无距离限制且你可以额外使用一张【杀】。",
  rezhenxing: "镇行",
  rezhenxing_info:
    "结束阶段开始时或当你受到伤害后，你可以观看牌堆顶的三张牌，然后你获得其中与其余牌花色均不相同的一张牌。",
  xin_jianyong: "手杀简雍",
  xinqiaoshui: "巧说",
  xinqiaoshui_info:
    "出牌阶段限一次，你可以和一名其他角色拼点。若你赢，则你本阶段内使用的下一张基本牌或普通锦囊牌可以增加减少一个目标。若你没赢，你本阶段内不能使用锦囊牌。",
  xinjyzongshi: "纵适",
  xinjyzongshi_info:
    "当你拼点后，你可以观看牌堆顶的一张牌，然后选择一项：获得此牌，或获得两张拼点牌中点数较小的一张。",
  dingyuan: "手杀丁原",
  beizhu: "备诛",
  beizhu_draw: "备诛",
  beizhu_info:
    "出牌阶段限一次，你可以观看一名其他角色的手牌。若其中：没有【杀】，你弃置其一张牌，然后你可令其获得牌堆中的一张【杀】；有【杀】，其依次对你使用这些【杀】，当你因此受到1点伤害后，你摸一张牌。",
  xin_zhuran: "手杀朱然",
  mobiledanshou: "胆守",
  mobiledanshou_info:
    "一名其他角色的结束阶段开始时，若X：为0，你摸一张牌；不等于0，你可弃置X张牌并对其造成1点伤害（X为其本回合内使用的目标包含你的牌的数量）",
  yanghuiyu: "羊徽瑜",
  hongyi: "弘仪",
  hongyi2: "弘仪",
  hongyi_info:
    "出牌阶段限一次，你可以选择一名其他角色。你的下回合开始前，该角色造成伤害时进行判定，若结果为：黑色，此伤害-1。红色，受到伤害的角色摸一张牌。",
  requanfeng: "劝封",
  requanfeng_gain: "劝封",
  requanfeng_info:
    "限定技。①其他角色死亡时，你可失去〖弘仪〗，然后获得其武将牌上的所有非主公技，非隐匿技和非Charlotte技，加1点体力上限并回复1点体力。②当你处于濒死状态时，你可以加2点体力上限，然后回复4点体力。",
  quanfeng: "劝封",
  quanfeng_info:
    "锁定技，限定技，一名角色死亡时，你选择获得其的一个技能（主公技，限定技，觉醒技，隐匿技，使命技，带有Charlotte标签的技能除外），然后加1点体力上限并回复1点体力。",
  simashi: "司马师",
  baiyi: "败移",
  baiyi_info: "限定技，出牌阶段，若你已受伤，你可以交换两名其他角色的座次。",
  jinglve: "景略",
  jinglve2: "景略",
  jinglve3: "景略",
  jinglve_info:
    "出牌阶段限一次，若场上没有与你对应的「死士」牌，则你可以观看一名其他角色的手牌，将其中一张牌标记为「死士」。当其使用对应的实体牌中包含「死士」的牌时，你取消此牌的所有目标。当「死士」牌不因使用而进入弃牌堆，或其回合结束后，若「死士」牌仍在其区域内，则你获得此牌。",
  shanli: "擅立",
  shanli_info:
    "觉醒技，准备阶段，若你已发动过〖败移〗且对至少两名角色发动过〖景略〗，则你减1点体力上限并选择一名角色。系统随机选择三个不为〖忘隙(仲村由理)〗的主公技，然后你选择其中一个技能，令其获得之。其将交互表情中的【拖鞋】和【酒杯】替换为【枷锁】和【玉玺】。",
  re_lingtong: "手杀凌统",
  re_liubiao: "手杀刘表",
  hucheer: "胡车儿",
  daoji: "盗戟",
  daoji_info:
    "出牌阶段限一次，你可以弃置一张非基本牌并选择一名装备区里有牌的其他角色，你获得其装备区中的一张牌并使用之。若你以此法获得的牌是武器牌，则你使用此牌后对其造成1点伤害。",
  xin_hansui: "手杀韩遂",
  xinniluan: "逆乱",
  xinniluan_info:
    "其他角色的结束阶段，若其本回合对除其以外的角色使用过牌，则你可以对其使用一张【杀】。若以此法使用的【杀】造成伤害，则你弃置其一张牌。",
  xiaoxi_hansui: "骁袭",
  xiaoxi_hansui_info: "你可以将一张黑色牌当做【杀】使用或打出。",
  xin_zhangfei: "手杀张飞",
  liyong: "厉勇",
  liyong2: "厉勇",
  liyong3: "厉勇",
  liyong_info:
    "锁定技，若你于出牌阶段使用的【杀】被【闪】抵消，本阶段你下一张【杀】不可被响应且伤害+1，指定的目标本回合非锁定技失效，当此【杀】造成伤害后，若目标角色未死亡，你失去1点体力。",
  gongsunkang: "公孙康",
  juliao: "据辽",
  juliao_info: "锁定技，其他角色计算与你的距离始终+X（X为场上势力数-1）。",
  taomie: "讨灭",
  taomie1: "讨灭",
  taomie2: "讨灭",
  taomie3: "讨灭",
  taomie4: "讨灭",
  taomie_info:
    "当你受到伤害后或当你造成伤害后，你可以令伤害来源或受伤角色获得“讨灭”标记（如场上已有标记则转移给该角色）；你和拥有“讨灭”标记的角色视为在彼此的攻击范围内，且当你对该角色造成伤害时，选择一项：1. 此伤害+1；2. 你获得其区域内的一张牌并可将之交给另一名角色；3. 依次执行前两项并于伤害结算后弃置其“讨灭”标记。",
  xin_guohuai: "手杀郭淮",
  mobilejingce: "精策",
  mobilejingce_info:
    "结束阶段，若此回合因使用或打出而置入弃牌堆的牌的数量不小于你的体力值，则你可以摸两张牌。",
  xin_panzhangmazhong: "手杀潘璋马忠",
  xinduodao: "夺刀",
  xinduodao_info: "当你受到伤害后，你可以获得伤害来源装备区里的武器牌。",
  xinanjian: "暗箭",
  xinanjian_info:
    "锁定技，当你使用【杀】指定目标后，若你不在目标角色攻击范围内，你选择一项：1. 令其无法响应此【杀】；2. 其受到此【杀】造成的伤害+1。",
  xin_fuhuanghou: "手杀伏寿",
  xinzhuikong: "惴恐",
  xinzhuikong_info:
    "每轮限一次，其他角色的回合开始时，若其体力值不小于你，你可与其拼点。若你赢，其本回合无法使用牌指定除其以外的角色为目标；若你没赢，你获得其拼点的牌，然后其视为对你使用一张【杀】。",
  xinqiuyuan: "求援",
  xinqiuyuan_info:
    "当你成为【杀】的目标时，你可以令另一名其他角色交给你一张除【杀】以外的基本牌，否则其也成为此【杀】的目标。",
  xin_gongsunzan: "手杀公孙瓒",
  re_dengai: "手杀邓艾",
  flappybird: "飞鸟",
  flappybird_info: "出牌阶段，你可游玩一局Flappy Bird。",
  sp_wangcan: "手杀王粲",
  spqiai: "七哀",
  spqiai_info:
    "出牌阶段限一次，你可以将一张非基本牌交给一名其他角色。然后其选择一项：①你回复1点体力。②你摸两张牌。",
  spshanxi: "善檄",
  spshanxi_suoming: "善檄",
  spshanxi_info:
    "出牌阶段开始时，你可令一名其他角色获得“檄”标记并清除场上已有的其他“檄”标记（若有）。有“檄”标记的角色回复体力时，若其体力值大于0，则其需选择一项：①交给你两张牌。②失去1点体力。",
  sp_chenzhen: "陈震",
  shameng: "歃盟",
  shameng_info:
    "出牌阶段限一次，你可弃置两张颜色相同的手牌并选择一名其他角色。其摸两张牌，然后你摸三张牌。",
  sp_sunshao: "手杀孙邵",
  fubi: "辅弼",
  fubi2: "辅弼",
  fubi_info: "游戏开始时，你可选择一名其他角色。该角色的手牌上限于你死亡前+3。",
  zuici: "罪辞",
  zuici_info:
    "当你进入濒死状态时，你可废除你的一个不为空的装备栏，然后将体力值回复至1点。",
  sp_xunchen: "手杀荀谌",
  jianzhan: "谏战",
  jianzhan_info:
    "出牌阶段限一次，你可选择一名其他角色A和其攻击范围内的另一名手牌数小于其的角色B。A选择一项：①视为对B使用一张【杀】。②令你摸一张牌。",
  duoji: "夺冀",
  duoji_info:
    "限定技，出牌阶段，你可弃置两张手牌并选择一名装备区有牌的其他角色。你获得其装备区里的所有牌。",
  re_handang: "手杀韩当",
  luotong: "骆统",
  qinzheng: "勤政",
  qinzheng_info:
    "锁定技，当你使用或打出牌时，若你本局游戏内使用或打出过的牌数和：为3的倍数，你从牌堆中获得一张【杀】或【闪】；为5的倍数，你从牌堆中获得一张【桃】或【酒】；为8的倍数，你从牌堆中获得一张【决斗】或【无中生有】（可获得对应的衍生替换牌）。",
  sp_duyu: "手杀杜预",
  spwuku: "武库",
  spwuku_info:
    "锁定技，当有角色使用装备牌时，若你的“武库”数小于3，则你获得一个“武库”。",
  spwuku_info_guozhan:
    "锁定技，当有其他势力的角色使用装备牌时，若你的“武库”数小于2，则你获得一个“武库”。",
  spsanchen: "三陈",
  spsanchen_info:
    "觉醒技，结束阶段，若你的“武库”数大于2，则你加1点体力上限并回复1点体力，然后获得〖灭吴〗。",
  spmiewu: "灭吴",
  spmiewu2: "灭吴",
  spmiewu_backup: "灭吴",
  spmiewu_info:
    "每回合限一次。你可弃置一枚“武库”并将一张牌当做任意基本牌或锦囊牌使用，然后摸一张牌。",
  sp_bianfuren: "手杀卞夫人",
  spwanwei: "挽危",
  spwanwei_info:
    "每轮累计限一次。①出牌阶段，你可选择一名其他角色。②当有其他角色处于濒死状态时。你可令该角色回复X+1点体力（至少回复至1），然后你失去X点体力。（X为你的体力值）",
  spyuejian: "约俭",
  spyuejian_info:
    "锁定技，你的手牌上限基数等于你的体力上限。当你处于濒死状态时，你可弃置两张牌，然后回复1点体力。",
  feiyi: "费祎",
  reshengxi: "生息",
  reshengxi_info: "结束阶段，若你于本回合内未造成过伤害，则你可摸两张牌。",
  fyjianyu: "谏喻",
  fyjianyu_info:
    "每轮限一次。出牌阶段，你可选择两名角色，令这些角色获得“喻”直到你的下回合开始。当一名有“喻”的角色A使用牌指定另一名有“喻”的角色B为目标时，你令B摸一张牌。",
  fyjianyux: "谏喻",
  refubi: "辅弼",
  refubi_info:
    "游戏开始时，你可令一名其他角色获得“辅弼”标记。有“辅弼”标记的角色的准备阶段开始时，你可选择一项：①令其本回合使用【杀】的次数上限+1。②令其本回合的手牌上限+3。",
  rezuici: "罪辞",
  rezuici_backup: "罪辞",
  rezuici_info:
    "出牌阶段，或当你处于濒死状态时，你可以废除一个有牌的装备栏并回复2点体力，然后可以移动“辅弼”标记。",
  nanhualaoxian: "手杀南华老仙",
  yufeng: "御风",
  yufeng2: "御风",
  yufeng_info:
    "出牌阶段限一次，你可以表演“御风飞行”。若表演失败，则你摸X张牌。若表演成功，则你可以选择至多X名其他角色获得“御风”效果，然后摸X-Y张牌（准备阶段开始时，你进行判定。若结果为：红色，你跳过摸牌阶段；黑色，你跳过出牌阶段和弃牌阶段。X为你的得分。Y为你选择的角色数）。",
  tianshu: "天书",
  tianshu_info:
    "出牌阶段限一次，若场上没有【太平要术】，则你可以弃置一张牌并选择一名角色。该角色获得并使用【太平要术】。",
  wujing: "吴景",
  heji: "合击",
  heji_info:
    "当有角色使用的【决斗】或红色【杀】结算完成后，若此牌对应的目标数为1，则你可以对相同的目标使用一张【杀】或【决斗】（无距离和次数限制）。若你以此法使用的牌不为转化牌，则你从牌堆中随机获得一张红色牌。",
  liubing: "流兵",
  liubing_info:
    "锁定技。①当你声明使用【杀】时，若此牌是你本回合使用的第一张有唯一对应实体牌的【杀】，则你将此牌的花色改为♦。②其他角色于其出牌阶段内使用的非转化黑色杀结算结束后，若此【杀】未造成伤害，则你获得之。",
  sp_mifuren: "糜夫人",
  spcunsi: "存嗣",
  spcunsi2: "存嗣",
  spcunsi_info:
    "出牌阶段限一次，你可将武将牌翻至背面并选择一名其他角色。其从牌堆或弃牌堆中获得一张【杀】，且下一张杀的伤害值基数+1。",
  spguixiu: "闺秀",
  spguixiu_info:
    "锁定技，当你受到伤害后，若你的武将牌背面朝上，则你将武将牌翻至正面。当你的武将牌从背面翻至正面时，你摸一张牌。",
  sp_xinpi: "手杀辛毗",
  spyinju: "引裾",
  spyinju2: "引裾",
  spyinju_info:
    "出牌阶段限一次，你可令一名其他角色选择一项：①对你使用一张【杀】（无距离限制）。②其下个回合的准备阶段开始时，跳过出牌阶段和弃牌阶段。",
  spchijie: "持节",
  spchijie_info:
    "每回合限一次。当你成为其他角色使用牌的唯一目标时，你可判定。若结果大于6，则你取消此牌的所有目标。",
  reduoji: "夺冀",
  reduoji_info:
    "出牌阶段限一次，你可将一张牌置于其他角色的武将牌上，称为“冀”。当有装备牌因使用而进入一名角色的装备区后，若该角色有“冀”且其为使用者，则你获得此装备牌，其移去一个“冀”并摸一张牌。一名其他角色的回合结束后，若其有“冀”，则你获得其的所有“冀”。",
  re_jiangwei: "手杀姜维",
  retiaoxin: "挑衅",
  retiaoxin_info:
    "出牌阶段限一次，你可以指定一名有牌的其他角色，该角色需对你使用一张【杀】，否则你弃置其一张牌。",
  re_zhurong: "手杀祝融",
  relieren: "烈刃",
  relieren_info:
    "当你使用【杀】指定目标后，你可以和目标角色进行拼点。若你赢，你获得其一张牌。若你没赢，你获得对方的拼点牌，其获得你的拼点牌。",
  zhouqun: "周群",
  tiansuan: "天算",
  tiansuan_info:
    "出牌阶段限一次，若场上没有因你产生的“命运签”，则你可以抽取一张“命运签”，然后令一名角色获得“命运签”直到你的下回合开始。若你以此法抽取的“命运签”为：上上签，你观看其手牌；上上签/上签，你获得其区域内的一张牌。",
  tiansuan_faq: "【命运签】说明",
  tiansuan_faq_info:
    "当你抽取“命运签”时，你可以令其中一种命运签的权重+1。<br>上上签（权重1）：当你受到伤害时，防止此伤害。<br>上签（权重2）：当你受到伤害时，你令伤害值改为1；当你受到1点伤害后，你摸一张牌。<br>中签（权重3）：当你受到伤害时，你令伤害属性改为火属性并将伤害值改为1。<br>下签（权重2）：当你受到伤害时，你令此伤害+1。<br>下下签（权重1）：当你受到伤害时，你令此伤害+1。你不能使用【酒】或【桃】。",
  tiansuan2_0: "命运签",
  tiansuan2_1: "命运签",
  tiansuan2_2: "命运签",
  tiansuan2_damage: "命运签",
  tiansuan2_fire: "命运签",
  tiansuan2_3: "命运签",
  tiansuan2_4: "命运签",
  wangling: "王凌",
  mouli: "谋立",
  mouli_info:
    "出牌阶段限一次，你可以将一张手牌交给一名其他角色，其获得如下效果直到你的下回合开始：其可以将黑色牌当做【杀】，红色牌当做【闪】使用。其第一次触发“使用【杀】/【闪】结算完成后”的时机时，你摸三张牌。",
  zifu: "自缚",
  zifu_info:
    "锁定技，当有角色死亡时，若其因你获得的“谋立”效果未过期，则你减2点体力上限。",
  wangfuzhaolei: "王甫赵累",
  xunyi: "殉义",
  xunyi2: "殉义",
  xunyi3: "殉义",
  xunyi_info:
    "游戏开始时，或当上一个拥有“殉义”效果的角色死亡后，你可以选择一名角色获得如下效果：当其/你对二者之外的角色造成伤害后，你/其摸一张牌；当其/你受到二者之外的角色造成的伤害后，你/其弃置一张牌。",
  zhouchu: "手杀周处",
  xianghai: "乡害",
  xianghai_info: "锁定技，其他角色的手牌上限-1。你手牌区的装备牌均视为【酒】。",
  chuhai: "除害",
  chuhai_info:
    "出牌阶段限一次，你可以摸一张牌，然后和一名其他角色拼点。若你赢，则你观看其手牌，并从牌堆/弃牌堆中获得其手牌中包含的类型的牌各一张，且当你于此阶段内对其造成伤害后，你将牌堆/弃牌堆中的一张装备牌置于你的一个空置装备栏内。",
  sp_kongrong: "孔融",
  spmingshi: "名士",
  spmingshi_info: "锁定技，当你受到1点伤害后，伤害来源弃置一张牌。",
  splirang: "礼让",
  splirang_info:
    "出牌阶段限一次，你可以弃置所有手牌，然后将其中的至多X张牌交给一名其他角色（X为你的体力值），之后摸一张牌。",
  ol_yujin: "手杀于禁",
  rejieyue: "节钺",
  rejieyue_info:
    "结束阶段开始时，你可以将一张牌交给一名其他角色。然后其选择一项：令你摸三张牌：或其保留一张手牌和装备区的牌，然后弃置其余的牌。",
  caizhenji: "蔡贞姬",
  sheyi: "舍裔",
  sheyi_info:
    "每轮限一次。当有体力值小于你的其他角色受到伤害时，你可以交给其至少X张牌并防止此伤害（X为你的体力值）。",
  tianyin: "天音",
  tianyin_info:
    "锁定技，结束阶段开始时，你从牌堆中获得每种本回合未使用过的类型的牌各一张。",
  xiangchong: "向宠",
  guying: "固营",
  guying_info:
    "锁定技。每回合限一次，当你于回合外因使用/打出/弃置而失去牌后，若牌数为1，则你获得一枚“固”并令当前回合角色选择一项：①随机交给你一张牌。②令你获得本次失去的牌，若为装备牌，则你使用之。准备阶段开始时，你移去所有“固”并弃置等量的牌。",
  muzhen: "睦阵",
  muzhen_backup: "睦阵",
  muzhen_info:
    "出牌阶段各限一次。①你可以将两张牌交给一名装备区内有牌的其他角色，然后获得其装备区内的一张牌。②你可以将装备区内的一张牌置于其他角色的装备区内，然后获得其一张手牌。",
  sp_huaxin: "手杀华歆",
  hxrenshi: "仁仕",
  hxrenshi_info: "出牌阶段每名角色限一次。你可以将一张手牌交给一名其他角色。",
  debao: "德保",
  debao_info:
    "锁定技，当其他角色获得你的牌后，若你的“仁”数小于你的体力上限，则你将牌堆顶的一张牌置于你的武将牌上，称为“仁”。准备阶段，你获得所有“仁”。",
  buqi: "不弃",
  buqi_info:
    "锁定技，当有角色进入濒死状态时，若你的“仁”数大于1，则你移去两张“仁”并令其回复1点体力。一名角色死亡后，你将所有“仁”置入弃牌堆。",
  sp_xujing: "手杀许靖",
  boming: "博名",
  boming_info:
    "出牌阶段限两次，你可以将一张牌交给一名其他角色。结束阶段，若你本回合以此法失去了两张以上的牌，则你摸一张牌。",
  ejian: "恶荐",
  ejian_info:
    "锁定技，每名角色限一次。当有其他角色因〖博名〗而获得了你的牌后，若其拥有与此牌类型相同的其他牌，则你令其选择一项：①受到1点伤害。②展示所有手牌，并弃置所有与此牌类别相同的牌。",
  xin_zhoucang: "手杀周仓",
  mobilezhongyong: "忠勇",
  mobilezhongyong_info:
    "当你于出牌阶段使用【杀】结算结束后，若没有目标角色使用【闪】响应过此【杀】，则你可获得此【杀】；否则你可选择一项：①获得目标角色使用的【闪】，然后可将此【杀】交给另一名其他角色。②将目标角色使用的【闪】交给另一名其他角色，然后你本回合使用【杀】的次数上限+1且下一张【杀】的伤害值基数+1。（你不能使用本回合因执行〖忠勇〗的效果获得的牌）",
  mjdingyi: "定仪",
  mjdingyi_info:
    "游戏开始时，你选择一个效果（相同效果不可叠加）并令全场角色获得之：①摸牌阶段额定摸牌数+1。②手牌上限+2。③攻击范围+1。④脱离濒死状态时回复1点体力。",
  mjzuici: "罪辞",
  mjzuici_info:
    "当你受到伤害后，你可令伤害来源失去〖定仪〗效果，然后令其从牌堆中获得一张由你选择的智囊。",
  mjfubi: "辅弼",
  mjfubi_info:
    "每轮限一次。出牌阶段，你可选择一项：①更换一名角色的〖定仪〗效果。②弃置一张牌并令一名角色的〖定仪〗效果翻倍直到你的下回合开始。",
  mjshengxi: "生息",
  mjshengxi_info:
    "准备阶段，你可以获得一张【调剂盐梅】；结束阶段，若你本回合使用过牌且未造成伤害，则你可以获得一张智囊。",
  mjkuanji: "宽济",
  mjkuanji_info:
    "每回合限一次。当你因弃置而失去牌后，你可令一名其他角色获得其中的一张牌，然后你摸一张牌。",
  tiaojiyanmei: "调剂盐梅",
  tiaojiyanmei_info:
    "出牌阶段，对两名手牌数不均相同的其他角色使用。若目标角色于此牌使用准备工作结束时的手牌数大于此时所有目标的平均手牌数，其弃置一张牌。若小于则其摸一张牌。此牌使用结束后，若所有目标角色的手牌数均相等，则你可令一名角色获得所有因执行此牌效果而弃置的牌。",
  binglinchengxiax: "兵临城下",
  binglinchengxiax_info:
    "出牌阶段，对一名其他角色使用。你展示牌堆顶的四张牌，依次对其使用其中所有的【杀】，然后将剩余的牌置于牌堆顶。",
  mjweipo: "危迫",
  mjweipo_effect: "危迫",
  mjweipo_remove: "危迫",
  mjweipo_info:
    "出牌阶段限一次。你可以选择一个智囊或【兵临城下】，令一名没有〖危迫〗效果的角色获得如下一次性效果直到你下回合开始：其可于出牌阶段弃置一张【杀】，并获得一张你选择的牌。",
  mjchenshi: "陈势",
  mjchenshi_player: "陈势",
  mjchenshi_target: "陈势",
  mjchenshi_info:
    "当有角色使用【兵临城下】指定第一个目标后，其可交给你一张牌，并将牌堆的顶三张牌中所有不为【杀】的牌置入弃牌堆；当有角色成为【兵临城下】的目标后，其可交给你一张牌，然后将牌堆顶三张牌中所有的【杀】置入弃牌堆。",
  mjmouzhi: "谋识",
  mjmouzhi_info:
    "锁定技，当你受到伤害时，若伤害渠道对应的牌和你上次受到的伤害花色相同，则你防止此伤害。",
  zhangzhongjing: "张机",
  jishi: "济世",
  jishi_info:
    "锁定技。①当你使用的牌结算完成后，若你未因此牌造成过伤害，则你将此牌对应的所有实体牌置于仁库中。②当有牌不因溢出而离开仁库时，你摸一张牌。",
  liaoyi: "疗疫",
  liaoyi_info:
    "其他角色的回合开始时，若其：①手牌数小于体力值且仁库内牌数大于等于X，则你可令其从仁库中获得X张牌；②手牌数大于体力值，则你可以令其将X张牌置于仁库中（X为其手牌数与体力值之差且至多为4）。",
  xinliaoyi: "疗疫",
  xinliaoyi_info:
    "其他角色的回合开始时，你可选择一项：①令其从仁库中获得一张牌。②若其手牌数大于体力值，则令其将X张手牌置入仁库（X为其手牌数与体力值之差）。",
  binglun: "病论",
  binglun_info:
    "出牌阶段限一次，你可以将仁库中的一张牌置于弃牌堆并选择一名角色。该角色选择一项：①摸一张牌。②于其下回合结束时回复1点体力。",
  sp_zhangwen: "手杀张温",
  gebo: "戈帛",
  gebo_info: "锁定技，当有角色回复体力后，你将牌堆顶的一张牌置入仁库。",
  spsongshu: "颂蜀",
  spsongshu_info:
    "其他角色的摸牌阶段开始时，若其体力值大于你且仁库内有牌，则你可以令其放弃摸牌。其改为获得X张仁（X为你的体力值且至多为5），且本回合内不能使用牌指定其他角色为目标。",
  liuzhang: "刘璋",
  xiusheng: "休生",
  xiusheng_info:
    "锁定技。准备阶段，你将所有“生”置入弃牌堆，然后摸X张牌，并将等量的牌置于武将牌上，称为“生”（X为你因〖引狼〗而选择的势力的存活角色数）。",
  yinlang: "引狼",
  yinlang_info:
    "①每轮限一次。回合开始时，你选择场上的一个势力。②一名角色的出牌阶段开始时，若其势力与你选择的势力相同，则其选择一项：1.获得你的一张“生”，然后其本回合使用牌时不能指定你以外的角色为目标。2.你获得一张“生”。",
  huaibi: "怀璧",
  huaibi_info:
    "主公技，锁定技。你的手牌上限+X（X为你因〖引狼〗而选择的势力的存活角色数）。",
  qiaogong: "桥公",
  yizhu: "遗珠",
  yizhu_info:
    "①结束阶段，你摸两张牌，然后将两张牌随机插入牌堆前2X张牌的位置中（X为角色数，选择牌的牌名对其他角色可见）。②当有其他角色使用“遗珠”牌指定唯一目标时，你可清除对应的“遗珠”标记并取消此目标，然后你可使用此牌。③当有“遗珠”牌进入弃牌堆后，你摸一张牌并清除对应的“遗珠”标记。",
  luanchou: "鸾俦",
  luanchou_info:
    "出牌阶段限一次，你可令两名角色获得“姻”标记并清除原有标记。拥有“姻”标记的角色视为拥有技能〖共患〗。",
  gonghuan: "共患",
  gonghuan_info:
    "锁定技。每回合限一次，一名其他角色受到伤害时，若其拥有“姻”标记且其体力值小于你，则你将伤害转移给自己。此伤害结算结束后，你与其移去“姻”标记。",
  sp_yanghu: "手杀羊祜",
  mingfa: "明伐",
  mingfa_info:
    "①结束阶段，你可展示一张牌并记录为“明伐”。②出牌阶段开始时，若“明伐”牌在你的手牌区或装备区，则你可以使用“明伐”牌与一名其他角色拼点。若你赢：你获得对方一张牌并从牌堆中获得一张点数等于“明伐”牌牌面点数-1的牌。若你没赢：你本回合不能使用牌指定其他角色为目标。③你的拼点牌亮出后，你令此牌的点数+2。",
  rongbei: "戎备",
  rongbei_info:
    "限定技。出牌阶段，你可选择一名有空装备栏的角色。系统为该角色的每个空装备栏选择一张装备牌，然后该角色使用之。",
  xin_caifuren: "手杀蔡夫人",
  xinqieting: "窃听",
  xinqieting_info:
    "其他角色的回合结束时，若其本回合内未对其他角色造成过伤害，则你可选择一项：①摸一张牌。②观看其两张手牌并获得其中的一张。③将其装备区内的一张牌移动至你的装备区。",
  xinguixiu: "闺秀",
  xinguixiu_info:
    "锁定技。结束阶段，若你的体力值为：奇数，你摸一张牌；偶数，你回复1点体力。",
  qingyu: "清玉",
  qingyu_info:
    "使命技。①当你受到伤害时，你弃置两张牌，然后防止此伤害。②使命：准备阶段，若你的体力值等于体力上限且你没有手牌，则你获得〖悬存〗。③失败：当你进入濒死状态时，你减1点体力上限。",
  xuancun: "悬存",
  xuancun_info:
    "其他角色的回合结束时，若你的手牌数小于体力值，则你可以令其摸X张牌（X为你的体力值与手牌数之差且至多为2）",
  xinlirang: "礼让",
  xinlirang_info:
    "①其他角色的摸牌阶段开始时，若你没有“谦”标记，则你可以获得一枚“谦”标记。若如此做，其额定摸牌数+2，且本回合的弃牌阶段开始时，你可以获得其弃置的至多两张牌。②摸牌阶段开始时，若你有“谦”标记，则你跳过此摸牌阶段并移除“谦”标记。",
  xinmingshi: "名仕",
  xinmingshi_info:
    "锁定技，当你受到伤害后，若你有“谦”标记，则伤害来源弃置一张牌。若此牌为：黑色：你获得之。红色，你回复1点体力。",
  xingqi: "星启",
  xingqi_info:
    "①当你使用牌时，若此牌不为延时锦囊牌且你没有同名的“备”，则你获得一枚与此牌名称相同的“备”。②结束阶段，你可移去一枚“备”，然后从牌堆中获得一张与此“备”名称相同的牌。",
  xinzifu: "自缚",
  xinzifu_info:
    "锁定技。出牌阶段结束时，若你本阶段内未使用牌，则你移去所有“备”且本回合的手牌上限-1。",
  mibei: "秘备",
  mibei_info:
    "使命技。①使命：当你使用的牌结算完成后，若你的“备”中包含的基本牌，锦囊牌，装备牌数量均大于1，则你从牌堆中获得这三种类型的牌各一张并获得技能“谋立”。②失败：结束阶段开始时，若你没有“备”，且你于本回合的准备阶段开始时也没有“备”，则你减1点体力上限。",
  xinmouli: "谋立",
  xinmouli_info:
    "出牌阶段限一次，你可以指定一名其他角色。其移去你的一个“备”，然后从牌堆中获得一张与此“备”名称相同的牌。",
  re_zhonghui: "手杀钟会",
  requanji: "权计",
  requanji_info:
    "出牌阶段结束时，若你的手牌数大于体力值，或当你受到1点伤害后，你可以摸一张牌，然后将一张手牌置于武将牌上，称为“权”；你的手牌上限+X（X为“权”的数量）。",
  xin_guyong: "手杀顾雍",
  xinshenxing: "慎行",
  xinshenxing_info:
    "出牌阶段限X次（X为你的体力值），你可以弃置两张牌，然后摸一张牌。若这两张牌颜色不同，则改为摸两张牌。",
  xinbingyi: "秉壹",
  xinbingyi_info:
    "结束阶段，你可展示所有手牌。若这些牌的颜色或类型均相同，则你可以令至多X名角色各摸一张牌（X为你的手牌数）。",
  db_wenyang: "文鸯",
  dbquedi: "却敌",
  dbquedi_info:
    "每回合限一次。当你使用【杀】或【决斗】指定唯一目标后，你可选择：①获得目标角色的一张手牌。②弃置一张基本牌，并令此牌的伤害值基数+1。③背水：减1点体力上限，然后依次执行上述所有选项。",
  dbzhuifeng: "椎锋",
  dbzhuifeng_info:
    "魏势力技。每回合限两次，你可以失去1点体力并视为使用一张【决斗】。当你因此【决斗】而受到伤害时，你防止此伤害并令此技能失效直到出牌阶段结束。",
  dbchongjian: "冲坚",
  dbchongjian_backup: "冲坚",
  dbchongjian_info:
    "吴势力技。你可以将一张装备牌当做一种【杀】（无距离限制且无视防具）或【酒】使用。当你以此法使用【杀】造成伤害后，你获得目标角色装备区内的X张牌（X为伤害值）。",
  dbchoujue: "仇决",
  dbchoujue_info:
    "锁定技。当你杀死其他角色后，你加1点体力上限并摸两张牌，然后本回合发动【却敌】的次数上限+1。",
  qiaozhou: "谯周",
  zhiming: "知命",
  zhiming_info:
    "准备阶段开始时或弃牌阶段结束时，你摸一张牌，然后可以将一张牌置于牌堆顶。",
  xingbu: "星卜",
  xingbu_info:
    "结束阶段，你可以展示牌堆顶的三张牌，然后根据X值（X为这三张牌中红色牌的数量），令一名其他角色获得对应的效果直到其下回合结束：①三张：其摸牌阶段多摸两张牌，使用【杀】的次数上限+1。②两张：其使用【杀】的次数上限-1，跳过弃牌阶段。③小于两张：其于准备阶段开始时弃置一张手牌。",
  yuanqing: "渊清",
  yuanqing_info:
    "锁定技，出牌阶段结束时，你随机将弃牌堆中你本阶段使用过的牌类型的各一张牌置于仁库中。",
  shuchen: "疏陈",
  shuchen_info:
    "锁定技，当有角色进入濒死状态时，若仁库中的牌数大于四，则你获得仁库中的所有牌，然后其回复1点体力。",
  rechuhai: "除害",
  rechuhai_info:
    "使命技。①出牌阶段限一次，你可以摸一张牌，然后和一名其他角色拼点。若你赢，则你观看其手牌，并从牌堆/弃牌堆中获得其手牌中包含的类型的牌各一张，且当你于此阶段内对其造成伤害后，你将牌堆/弃牌堆中的一张装备牌置于你的一个空置装备栏内。②当你因发动〖除害①〗而展示拼点牌时，你令此牌的点数+X（X=(4-你装备区的牌数)）。③使命：当有装备牌进入你的装备区后，若你的装备区内有至少三张牌，则你将体力值回复至上限，失去〖乡害〗并获得〖彰名〗。④失败：当你因发动〖除害①〗发起的拼点没赢时，若你的最终点数不大于6，则你触发使命失败分支。",
  zhangming: "彰名",
  zhangming_info:
    "锁定技。①你使用的♣牌不能被其他角色响应。②每回合限一次，当你对其他角色造成伤害后，你随机弃置其一张手牌，然后你从牌堆或弃牌堆中获得与其展示牌类型不同类型的牌各一张（若其没有手牌，则你改为从牌堆或弃牌堆中获得所有类型牌各一张），且以此法获得的牌不计入本回合的手牌上限。",
  xin_sunluban: "手杀孙鲁班",
  xinzenhui: "谮毁",
  xinzenhui_info:
    "出牌阶段限一次。当你使用【杀】或黑色普通锦囊牌指定目标时，你可选择另一名能成为此牌目标的其他角色并选择一项：①令其也成为此牌的目标。②获得其一张牌，然后将此牌的使用者改为该角色。",
  xinjiaojin: "骄矜",
  xinjiaojin_info:
    "当你受到男性角色造成的伤害时，你可以弃置一张装备牌并防止此伤害。",
  xin_caozhen: "手杀曹真",
  discretesidi: "司敌",
  discretesidi_info:
    "①当你使用的不为延时锦囊牌的牌结算结束后，你可选择一名R内不存在以a为第一序偶的二元序偶的其他角色a，并选择一名角色b，在关系R内建立二元序偶&lt;a,b&gt;（b对其他角色不可见）。②一名角色a使用不为延时锦囊牌的牌指定b为目标时，若(aRb)∧(此牌目标数为1)为真，则{你从R内移除&lt;a,b&gt;，且：若b为你，你摸一张牌；若b不为你，你可选择：⒈取消此牌的目标，然后若场上没有处于濒死状态的角色，则你对a造成1点伤害。⒉摸两张牌}；否则{你清除R内以a为第一元素的二元序偶}。",
  sp_chendong: "陈武董袭",
  spyilie: "毅烈",
  spyilie_info:
    "出牌阶段开始时，你可选择：①本阶段内使用【杀】的次数上限+1。②本回合内使用【杀】被【闪】抵消时，摸一张牌。③背水：失去1点体力，然后依次执行上述所有选项。",
  spfenming: "奋命",
  spfenming_info:
    "出牌阶段限一次，你可以选择一名体力值不大于你的角色。若其：未横置，其横置；已横置，你获得其一张牌。",
  yuanhuan: "袁涣",
  qingjue: "请决",
  qingjue_info:
    "每轮限一次。当有其他角色A使用牌指定另一名体力值小于A且不处于濒死状态的其他角色B为目标时，你可以摸一张牌，然后与A拼点。若你赢，你取消此目标。若你没赢，你将此牌的目标改为自己。",
  fengjie: "奉节",
  fengjie2: "奉节",
  fengjie_info:
    "锁定技，准备阶段开始时，你选择一名其他角色并获得如下效果直到你下回合开始：一名角色的结束阶段开始时，你将手牌摸至（至多摸四张）或弃置至与其体力值相等。",
  sp_zongyu: "手杀宗预",
  zhibian: "直辩",
  zhibian_info:
    "准备阶段，你可以和一名其他角色拼点。若你赢，你可选择：①将其装备区/判定区内的一张牌移动到你的对应区域。②回复1点体力。③背水：跳过下个摸牌阶段，然后依次执行上述所有选项；若你没赢，你失去1点体力。",
  yuyan: "御严",
  yuyan_info:
    "锁定技。当你成为非转换的【杀】的目标时，若使用者的体力值大于你且此【杀】有点数，则你令使用者选择一项：①交给你一张点数大于此【杀】的牌。②取消此目标。",
  fuqian: "傅佥",
  jueyong: "绝勇",
  jueyong_info:
    "锁定技。①当你不因〖绝勇〗成为唯一牌的目标时，若此牌不为转化牌且对应的实体牌牌数为1且不为【桃】或【酒】且你的“绝”数小于你的体力值的二倍，则你将此牌置于你的武将牌上，称为“绝”，且取消此牌的目标。②结束阶段开始时，若你有“绝”，则你令所有“绝”的原使用者依次对你使用所有“绝”，将无法使用的“绝”置入弃牌堆。",
  poxiang: "破降",
  poxiang_info:
    "出牌阶段限一次。你可以将一张牌交给一名其他角色。你摸三张牌（不计入本回合的手牌上限），移去所有“绝”并失去1点体力。",
  jutu: "据土",
  jutu_info:
    "锁定技，准备阶段，你获得所有你武将牌上的“生”，然后摸X+1张牌，然后将X张牌置于你的武将牌上，称为“生”（X为你因〖邀虎〗选择势力的角色数量)。",
  yaohu: "邀虎",
  yaohu_info:
    "每轮限一次，你的回合开始时，你须选择场上一个势力。该势力其他角色的出牌阶段开始时，其获得你的一张“生”，然后其须选择一项：①对你指定的另一名的其他角色使用一张【杀】（无距离和次数限制）；②交给你两张牌。",
  rehuaibi: "怀璧",
  rehuaibi_info:
    "主公技，锁定技，你的手牌上限+X（X为你因〖邀虎〗选择势力的角色数量)。",
  simafu: "司马孚",
  xunde: "勋德",
  xunde_info:
    "一名角色受到伤害后，若你至其的距离不大于1，则你可判定。若判定结果：大于5，你令该角色获得判定牌；小于7，你令伤害来源弃置一张牌。",
  chenjie: "臣节",
  chenjie_info:
    "一名角色的判定牌生效前，你可打出一张花色相同的牌。系统将你打出的牌作为新判定牌，将原判定牌置入弃牌堆。然后你摸两张牌。",
  mayuanyi: "马元义",
  jibing: "集兵",
  jibing_info:
    "①摸牌阶段开始时，若你的“兵”数小于势力数，则你可以改为将牌堆顶的两张牌置于你的武将牌上，称为“兵”。②你可以将一张“兵”当做【杀】或【闪】使用或打出。",
  wangjing: "往京",
  wangjing_info:
    "锁定技。当你因〖集兵〗而使用或打出牌时，若对方是场上体力值最高的角色，则你摸一张牌。",
  moucuan: "谋篡",
  moucuan_info:
    "觉醒技。准备阶段，若你的“兵”数不小于势力数，则你减1点体力上限并获得〖兵祸〗。",
  binghuo: "兵祸",
  binghuo_info:
    "一名角色的结束阶段开始时，若你本回合内因〖集兵〗而使用或打出过牌，则你可令一名角色判定。若判定结果为黑色，则你对其造成1点雷属性伤害。",
  yanpu: "阎圃",
  huantu: "缓图",
  huantu_info:
    "每轮限一次。一名角色的摸牌阶段开始前，若其在你攻击范围内，则你可以交给其一张牌并令其跳过此阶段。然后你于此回合的结束阶段选择一项：①令其回复1点体力并摸两张牌。②你摸三张牌，然后交给其两张手牌。",
  bihuo: "避祸",
  bihuo_info:
    "限定技。一名角色脱离濒死状态时，你可以令其摸三张牌，然后其他角色计算至其的距离时+X直到本轮结束（X为角色数）。",
  sp_wangshuang: "手杀王双",
  yiyong: "异勇",
  yiyong_info:
    "当你受到其他角色造成的渠道为【杀】的伤害后，若你的装备区内有武器牌，则你可以获得此【杀】对应的所有实体牌，然后将这些牌当做【杀】对伤害来源使用（无距离限制）。若其装备区内没有武器牌，则此伤害+1。",
  shanxie: "擅械",
  shanxie_info:
    "①出牌阶段限一次，你可从牌堆中获得一张武器牌。若牌堆中没有武器牌，则你改为随机获得一名角色装备区内的一张武器牌。②当其他角色使用【闪】响应你使用的【杀】时，若此【闪】没有点数或点数不大于你攻击范围的二倍，则你令此【闪】无效。",
  shanxie_info_old:
    "①出牌阶段限一次，你可选择一项：⒈从牌堆中获得一张武器牌。⒉获得一名其他角色装备区内的一张武器牌并使用，然后其将一张手牌当做【杀】对你使用。②当其他角色使用【闪】响应你使用的【杀】时，若此【闪】没有点数或点数不大于你攻击范围的二倍，则你令此【闪】无效。",
  sunyi: "手杀孙翊",
  zaoli: "躁厉",
  zaoli_info:
    "锁定技。①你不能于回合内使用你手牌中不为本回合获得的牌。②当你使用或打出手牌时，你获得一个“厉”（至多4个）。③回合开始时，若你有“厉”，则你移去所有“厉”并弃置任意张牌，然后摸X+Y张牌。若X大于2，你失去1点体力（X为你移去的标记数，Y为你弃置的牌数）。",
  sp_gaolan: "手杀高览",
  spjungong: "峻攻",
  spjungong_info:
    "出牌阶段，你可失去X+1点体力或弃置X+1张牌，视为对一名其他角色使用【杀】（不计入次数和距离限制，X为你本回合内发动过〖等力〗的次数）。若你因此【杀】造成了伤害，则你令此技能失效直到回合结束。",
  spdengli: "等力",
  spdengli_info:
    "当你使用【杀】指定目标后，或成为【杀】的目标后，若使用者和目标的体力值相等，则你摸一张牌。",
  sp_huaman: "手杀花蔓",
  spxiangzhen: "象阵",
  spxiangzhen_info:
    "锁定技。①【南蛮入侵】对你无效。②当有角色使用的【南蛮入侵】结算结束后，若有角色因此牌受到过伤害，则你和使用者各摸一张牌。",
  spfangzong: "芳踪",
  spfangzong_info:
    "锁定技。若你于当前回合内未发动过〖嬉战〗选择过选项二，则：①你不能于回合内使用具有伤害标签的牌指定攻击范围内的角色为目标。②攻击范围内包含你的角色不能使用具有伤害标签的牌指定你为目标。③结束阶段，你将手牌摸至X张（X为场上存活人数且至多为8）",
  spxizhan: "嬉战",
  spxizhan_info:
    "其他角色的回合开始时，你须选择一项：①失去1点体力。②弃置一张牌。然后若此牌的花色为：♠，其视为使用一张【酒】；♥，你视为使用一张【无中生有】；♣，你视为对其使用【铁索连环】；♦：你视为对其使用火【杀】（无距离限制）。",
  sp_cuiyan: "手杀崔琰",
  spyajun: "雅俊",
  spyajun_info:
    "①摸牌阶段，你令额定摸牌数+1。②出牌阶段开始时，你可以用一张本回合获得的牌与其他角色拼点。若你赢，则你可将其中一张拼点牌置于牌堆顶。若你没赢，你本回合的手牌上限-1。",
  spzundi: "尊嫡",
  spzundi_info:
    "出牌阶段限一次，你可以弃置一张手牌并选择一名角色，然后你进行判定。若结果为：黑色，其摸三张牌；红色，其可以移动场上的一张牌。",
  sp_zhangchangpu: "手杀张昌蒲",
  spdifei: "抵诽",
  spdifei_info:
    "锁定技。每回合限一次，当你受到伤害后，你摸一张牌或弃置一张手牌，然后展示所有手牌。若此伤害的渠道为没有花色的牌或你的手牌中没有与此牌花色相同的牌，则你回复1点体力。",
  spyanjiao: "严教",
  spyanjiao_info:
    "出牌阶段限一次。你可以将手牌中一种花色的所有牌交给一名其他角色，对其造成1点伤害。然后你于自己的下回合开始时摸等量的牌。",
  sp_jiangwan: "蒋琬",
  spzhenting: "镇庭",
  spzhenting_info:
    "每回合限一次。当你攻击范围内的角色成为【杀】或延时锦囊的目标时，若你不是此牌的使用者且不是此牌的目标，则你可以将此目标改为自己。然后你选择一项：①弃置使用者的一张手牌。②摸一张牌。",
  spjincui: "尽瘁",
  spjincui_info:
    "限定技。出牌阶段，你可以和一名其他角色交换位置，然后失去X点体力（X为你的体力值）。",
  sp_jiangqing: "蒋钦",
  spjianyi: "俭衣",
  spjianyi_info:
    "锁定技。其他角色的回合结束时，若弃牌堆中有于本回合内因弃置而进入弃牌堆的防具牌，则你获得其中一张。",
  spshangyi: "尚义",
  spshangyi_info:
    "出牌阶段限一次。你可以弃置一张牌并选择一名其他角色。其观看你的手牌，然后你观看其手牌并获得其中的一张。",
  sunhanhua: "孙寒华",
  chongxu: "冲虚",
  chongxu_info:
    "出牌阶段限一次，你可以随机演奏一首音乐，并根据完成度来获得相应的分数（至多五分）。然后你可修改〖妙剑〗或〖莲华〗（消耗3分），并使用剩余的分数进行摸牌（每张2分）。",
  chongxu_faq: "目前的曲库",
  chongxu_faq_info:
    "　<br>《鸟之诗》- 折户伸治<br>《竹取飛翔　～ Lunatic Princess》- ZUN<br>《ignotus》- ak+q<br>《Super Mario 3D World Theme》- 横田真人",
  miaojian: "妙剑",
  miaojian_info:
    "出牌阶段限一次。你可将一张【杀】当做刺【杀】使用，或将一张锦囊牌当做【无中生有】使用。",
  miaojian1: "妙剑·改",
  miaojian1_info:
    "出牌阶段限一次。你可将一张基本牌当做刺【杀】使用，或将一张非基本牌当做【无中生有】使用。",
  miaojian2: "妙剑·极",
  miaojian2_info: "出牌阶段限一次。你可视为使用一张刺【杀】或【无中生有】。",
  shhlianhua: "莲华",
  shhlianhua_info: "当你成为【杀】的目标后，你摸一张牌。",
  shhlianhua1: "莲华·改",
  shhlianhua1_info:
    "当你成为【杀】的目标后，你摸一张牌。然后你进行判定，若结果为黑桃，则此【杀】对你无效。",
  shhlianhua2: "莲华·极",
  shhlianhua2_info:
    "当你成为【杀】的目标后，你摸一张牌。然后此【杀】的使用者选择一项：①弃置一张牌。②令此【杀】对你无效。",
  re_yufan: "手杀虞翻",
  rezongxuan: "纵玄",
  rezongxuan_place: "纵玄",
  rezongxuan_info:
    "当你的牌因弃置而进入弃牌堆后，你可以将其以任意顺序置于牌堆顶。出牌阶段限一次，你可以摸一张牌，然后将一张牌置于牌堆顶。",
  sp_lvfan: "吕范",
  spdiaodu: "调度",
  spdiaodu_info:
    "准备阶段，你可令一名角色摸一张牌，然后移动其装备区内的一张牌。",
  spdiancai: "典财",
  spdiancai_info:
    "其他角色的结束阶段开始时，你可以令至多X名角色各摸一张牌（X为你本回合失去的手牌数）。",
  spyanji: "严纪",
  spyanji_info: "出牌阶段开始时，你可以进行“整肃”。",
  yj_huangzhong: "☆黄忠",
  spshidi: "势敌",
  spshidi_info:
    "转换技，锁定技。①准备阶段/结束阶段开始时，若你发动此分支的累计次数为奇数/偶数，则你获得一个“☯”。②若你的“☯”数为偶数，则你至其他角色的距离-1，且你使用的黑色【杀】不可被响应。③若你的“☯”数为奇数，则其他角色至你的距离+1，且你不可响应红色【杀】。",
  spyishi: "义释",
  spyishi_info:
    "当你对装备区有牌的其他角色造成伤害时，你可令此伤害-1，然后获得其装备区内的一张牌。",
  spqishe: "骑射",
  spqishe_info:
    "你可以将一张装备牌当做【酒】使用。你的手牌上限+X（X为你装备区内的牌数）。",
  sp_huangfusong: "手杀皇甫嵩",
  spzhengjun: "整军",
  spzhengjun_info:
    "①出牌阶段开始时，你可进行“整肃”。②当你因整肃而摸牌或回复体力后，你可令一名其他角色选择摸两张牌或回复1点体力。",
  spshiji: "势击",
  spshiji_info:
    "当你对其他角色造成属性伤害时，若你的手牌数不为全场唯一最多，则你可以观看其手牌。你令其弃置其中的所有红色牌，然后摸等量的牌。",
  sptaoluan: "讨乱",
  sptaoluan_info:
    "每回合限一次。一名角色的判定牌生效后，若判定结果的花色为♠，则你可以终止导致此判定发生的上级事件。然后选择一项：①获得判定牌对应的实体牌。②视为对判定角色使用一张火【杀】（无距离和次数限制）",
  sp_zhujun: "手杀朱儁",
  yangjie: "佯解",
  yangjie_info:
    "出牌阶段限一次，你可以摸一张牌并和一名其他角色A拼点。当你以此法展示你的拼点牌时，你令此牌点数-X（X为你已损失的体力值）。若你没赢，则你可以令另一名其他角色B获得两张拼点牌，然后其视为对A使用一张火【杀】。",
  zjjuxiang: "拒降",
  zjjuxiang_info:
    "限定技。一名其他角色脱离濒死状态时，你可以对其造成1点伤害，然后摸X张牌（X为其体力上限且至多为5）。",
  houfeng: "厚俸",
  houfeng_info:
    "每轮限一次。一名其他角色的出牌阶段开始时，若其在你的攻击范围内，则你可以令其进行“整肃”。然后当其于本回合内因整肃而摸牌或回复体力后，你可选择摸两张牌或回复1点体力。",
  sp_maojie: "毛玠",
  bingqing: "秉清",
  bingqing_info:
    "当你于出牌阶段内使用的牌结算结束后，若你于本阶段内使用的所有其他牌与此牌花色均不相同，则你可根据X的值执行对应效果：为2，你令一名角色摸两张牌；为3，你弃置一名角色区域内的一张牌；为4，你对一名其他角色造成1点伤害。（X为你本阶段内使用过的牌中包含的花色数）",
  yingfeng: "迎奉",
  yingfeng_info:
    "准备阶段，你可以令一名角色获得“奉”标记并移除场上所有其他的“奉”标记。有“奉”标记的角色使用牌没有距离限制。",
  xin_sunxiu: "手杀孙休",
  mobileyanzhu: "宴诛",
  mobileyanzhu_info:
    "出牌阶段限一次，你可以令一名有牌的其他角色选择一项：①你获得其装备区里所有的牌，然后你失去技能〖宴诛〗。②你获得其一张牌。",
  mobilexingxue: "兴学",
  mobilexingxue_info:
    "结束阶段开始时，你可以令至多X名角色依次摸一张牌并将一张牌置于牌堆顶（X为你的体力值，若你未拥有〖宴诛〗，则将X改为你的体力上限，且其可以改为将一张牌交给一名其他目标角色）。",
  re_wuguotai: "手杀吴国太",
  reganlu: "甘露",
  reganlu_info:
    "出牌阶段限一次，你可以选择装备区牌数之差的绝对值不大于X的两名角色或包含你在内的两名角色，然后交换这两名角色装备区内的牌。（X为你已损失的体力值）",
  taoqian: "手杀陶谦",
  miheng: "手杀祢衡",
  re_gaoshun: "手杀高顺",
  peixiu: "裴秀",
  xingtu: "行图",
  xingtu_info:
    "锁定技。①当你使用有点数的牌结算结束后，你将此牌点数记录为X。②当你使用牌时，若X÷Y的余数为0，则你摸一张牌（Y为此牌的点数）。③你使用Y÷X的余数为0的牌无次数限制（Y为此牌的点数）。",
  juezhi: "爵制",
  juezhi_info:
    "出牌阶段，你可以弃置至少两张牌，然后从牌堆中获得一张点数为X的牌（X=min(13, 这些牌的点数和)）。",
  sp_jianggan: "手杀蒋干",
  spdaoshu: "盗书",
  spdaoshu_info:
    "每轮限一次。一名敌方角色的出牌阶段开始时，若其有手牌，则你可以令其视为使用一张【酒】。其须声明一个基本牌的牌名，然后你判断其手牌区内是否有该牌名的牌。若你判断正确，则你随机获得其五张手牌，否则你不能响应其使用的牌直到回合结束。",
  spdaizui: "戴罪",
  spdaizui_info:
    "限定技。当你受到伤害值不小于体力值的伤害时，你可防止此伤害并将此伤害渠道对应的所有实体牌置于伤害来源的武将牌上，称为“释”。本回合结束时，其获得所有“释”。",
  re_caiwenji: "手杀蔡琰",
  re_bulianshi: "手杀步练师",
  reanxu: "安恤",
  reanxu_info:
    "出牌阶段限一次，你可以选择两名其他角色，令其中一名角色获得另一名角色的一张牌。若以此法移动的牌不来自装备区，则你摸一张牌。然后你可以令二者中手牌数较少的一名角色摸一张牌。",
  liuba: "刘巴",
  duanbi: "锻币",
  duanbi_info:
    "出牌阶段限一次。若场上所有角色的手牌数之和大于角色数之和的二倍，则你可以令所有其他角色各弃置X张手牌（X为该角色手牌数的一半且向下取整且至多为3）。然后你可选择一名角色，令其随机获得三张以此法被弃置的牌。",
  tongduo: "统度",
  tongduo_info:
    "每回合限一次。当你成为其他角色使用牌的唯一目标后，你可令一名角色重铸一张牌。",
  xin_jushou: "手杀沮授",
  xinjianying: "渐营",
  xinjianying_info:
    "锁定技。①当你于出牌阶段内使用与此阶段你使用的上一张牌点数或花色相同的牌时，你可以摸一张牌。②出牌阶段限一次，你可以将一张牌当做任意基本牌使用（不计入次数限制）。若你于此阶段内使用的上一张牌有花色，则此牌的花色视为上一张牌的花色。",
  re_xunyu: "手杀荀彧",
  rejieming: "节命",
  rejieming_info:
    "当你受到1点伤害后，你可以令一名角色摸两张牌。然后若其手牌数小于体力上限，则你摸一张牌。",
  xin_quancong: "手杀全琮",
  sbyaoming: "邀名",
  sbyaoming_info:
    "①游戏开始时，你获得2枚“名”。②当你受到1点伤害后，若你的“名”少于4枚，则你获得一枚“名”。③出牌阶段或当你受到伤害后，你可以移除一枚“名”并选择一项：⒈弃置一名手牌数不小于你的角色的一张牌。⒉令一名手牌数不大于你的角色摸一张牌。若你上次发动〖邀名③〗时未获得过“名”且你选择的选项和上次不同，则你获得一枚“名”。",
  ruanhui: "阮慧",
  mingcha: "明察",
  mingcha_info:
    "摸牌阶段开始时，你亮出牌堆顶的两张牌。若这两张牌中有点数小于7的牌，则你可以放弃摸牌并获得这些牌，然后你可以获得一名其他角色的随机一张牌。",
  jingzhong: "敬重",
  jingzhong_info:
    "弃牌阶段结束时，若你于本阶段内弃置过至少两张黑色牌，则你可以选择一名其他角色并获得如下效果直到其回合结束：每阶段限三次，其于出牌阶段内使用的牌结算结束后，你获得此牌对应的实体牌。",
  xin_mamidi: "手杀马日磾",
  chengye: "承业",
  chengye_info:
    "锁定技。①其他角色使用的非转化牌结算结束后，或其他角色的装备牌和延时锦囊牌进入弃牌堆后，或有延时锦囊牌因其他角色执行判定阶段的流程而进入弃牌堆后，若你的“六经”有空缺的位置可以置入此牌，则你将此牌置于你武将牌上，填补“六经”的对应位置。②出牌阶段开始时，若你的“六经”没有空缺的位置，则你获得所有“六经”。",
  chengye_append:
    '<span style="font-family: yuanli"><li>《诗经》：伤害类锦囊牌<br><li>《尚书》：基本牌<br><li>《仪礼》：无懈可击<br><li>《易经》：无中生有<br><li>《乐经》：乐不思蜀<br><li>《春秋》：装备牌</span>',
  buxu: "补叙",
  buxu_backup: "补叙",
  buxu_info:
    "出牌阶段，若你的“六经”中有空缺的位置，则你可以弃置X+1张牌并选择一种空缺的“六经”。系统从牌堆或弃牌堆中检索一张对应的牌，然后你将此牌置于你武将牌上，填补“六经”的对应位置。",

  mobile_standard: "手杀异构·标准包",
  mobile_shenhua: "手杀异构·神话再临",
  mobile_yijiang1: "手杀异构·将1",
  mobile_yijiang2: "手杀异构·将2",
  mobile_yijiang3: "手杀异构·将3",
  mobile_yijiang4: "手杀异构·将4",
  mobile_yijiang5: "手杀异构·将5",
  mobile_yijiang67: "手杀异构·原创设计",
  mobile_sp: "手杀异构·SP",
  mobile_shijiren: "始计篇·仁",
  mobile_shijizhi: "始计篇·智",
  mobile_shijixin: "始计篇·信",
  mobile_shijiyong: "始计篇·勇",
  mobile_shijiyan: "始计篇·严",
};

export const translate_mtg = {
  mtg_jiding: "基定",
  mtg_qianzhuo: "茜卓",
  mtg_jiesi: "杰斯",
  mtg_lilianna: "莉莲娜",
  mtg_nisha: "妮莎",
  mtg_ayeni: "阿耶尼",

  mduohun: "夺魂",
  mduohun_info:
    "锁定技，当你解除濒死状态后，令你进入濒死状态的角色失去一点体力",
  lingyong: "灵俑",
  lingyong2: "灵俑",
  lingyong3: "灵俑",
  lingyong3_bg: "俑",
  lingyong_info:
    "锁定技，每当一名其他角色死亡，你获得一个与该角色同名且体力上限为1、初始手牌为2的随从；出牌阶段，你可以调遣以此法获得的随从（直到随从死亡不可再次切换）",
  mbaizhan: "百战",
  mbaizhan_info: "锁定技，每当你造成一点伤害，你获得一点护甲",
  msilian: "祀炼",
  msilian_info:
    "结束阶段，若你有护甲，你可以移去全部护甲，然后进行一个额外回合；在额外回合中，你的摸牌阶段摸牌基数为你移去的护甲数；额外回合结束后，若你未造成伤害，你失去一点体力",
  mtongnian: "通念",
  mtongnian_info:
    "锁定技，出牌阶段开始时，你获得一张替身牌，此牌对应一名随机敌人的一张随机手牌；每当你使用一张非替身牌，随机更换替身牌对应的牌；当你使用替身牌时，改为使用替身牌对应的牌；当出牌阶段结束，或替身牌离开手牌区，或敌方角色没有手牌时，销毁替身牌",
  msuoling: "塑灵",
  msuoling_info:
    "每轮限一次，当一名其他角色使用一张非转化的普通锦囊牌时，你可以弃置一张与之花色相同的牌取消之，然后你视为使用该锦囊牌",
  msuoling_old_info:
    "出牌阶段限一次，若你手牌中有替身牌且手牌数不超过5，你可以展示手牌，若其中的非替身手牌能通过四则运算得到你的替身牌的点数，你将替身牌转化为非替身牌，然后获得一张新的替身牌（此技能托管无效）",
  mhuanyi: "幻逸",
  mhuanyi_info:
    "每两轮限一次，结束阶段，你可以选择一名其他角色和一种卡牌类型（选择结果对其他角色不可见），直到下一回合开始，当你首次成为该类型卡牌的惟一目标时，你将目标转移给你指定的角色（目标须合法）",
};

export const translate_offline = {
  sp_gongsunzan: "SP公孙瓒",
  sp_simazhao: "SP司马昭",
  sp_wangyuanji: "SP王元姬",
  sp_xinxianying: "SP辛宪英",
  sp_liuxie: "SP刘协",
  spyicong_info:
    "弃牌阶段结束时，你可以将任意张牌置于你的武将牌上，称为「扈」。每有一张「扈」，其他角色与你计算距离时便+1。",
  spyicong: "义从",
  sptuji: "突骑",
  sptuji_info:
    "准备开始时，你将所有「扈」置于弃牌堆，然后你本回合内计算与其他角色的距离时-X。若X不大于1，你摸一张牌。（X为以此法进入弃牌堆的「扈」的数量）",
  sphuangen: "皇恩",
  sphuangen_info:
    "一名角色使用锦囊牌指定目标时，若此牌的目标数大于1，则你可以令此牌对其中的至多X个目标无效，然后摸一张牌。（X为你的体力值）",
  sphantong: "汉统",
  sphantong_gain: "汉统",
  sphantong_info:
    "当你的牌因弃牌阶段的游戏规则要求而进入弃牌堆后，你可以将这些牌置于你的武将牌上，称为「诏」。一名角色的回合开始时，你可以弃置一张「诏」并获得〖护驾〗/〖激将〗/〖救援〗/〖血裔〗中的一个技能直至当前回合结束。",
  spzhaoxin: "昭心",
  spzhaoxin_info:
    "摸牌阶段结束时，你可以展示所有手牌，然后视为使用一张【杀】。",
  splanggu: "狼顾",
  splanggu_rewrite: "狼顾",
  splanggu_info:
    "当你受到有来源的伤害后，你可以进行判定（此判定结果生效前，你可以打出一张手牌替换判定牌）。然后你可以观看伤害来源的手牌并弃置其中的任意张与判定结果花色相同的牌。",
  spfuluan: "扶乱",
  spfuluan_info:
    "出牌阶段限一次，你可以弃置三张花色相同的牌并选择攻击范围内的一名角色。若如此做，该角色翻面且你不能使用【杀】直到回合结束",
  spshude: "淑德",
  spshude_info: "结束阶段开始时，你可以将手牌补至体力上限。",
  spmingjian: "明鉴",
  spmingjian_info:
    "一名角色的回合开始时，你可以选择一项：①弃置一张牌，然后其跳过本回合的判定阶段。②将一张手牌置于其武将牌上，然后其本回合内进行判定时不触发「判定结果生效前」的时机，且其回合结束时将此牌置入弃牌堆。",
  spyinzhi: "隐智",
  spyinzhi_info:
    "当你受到1点伤害后，你可以展示牌堆顶的两张牌。若其中有黑桃牌，则你可以进行至多X次「令一名角色获得伤害来源的一张手牌」的步骤。然后获得其余的牌。（X为其中黑桃牌的数量）",
  yj_caoang: "SP曹昂",
  yjxuepin: "血拼",
  yjxuepin_info:
    "出牌阶段限一次，你可以选择攻击范围内的一名角色并失去1点体力。你弃置其两张牌。若这两张牌类型相同，你回复1点体力。",
  ns_chendao: "SP陈到",
  nsjianglie: "将烈",
  nsjianglie_info:
    "当你使用【杀】指定目标后，你可以令其展示所有手牌，然后弃置其中一种颜色的牌。",
  ns_jiaxu: "☆贾诩",
  nsyice: "遗策",
  nsyice_info:
    "锁定技，当你使用/打出/弃置的牌进入弃牌堆后，你将这些牌以任意顺序置于你的武将牌上，称为“策”。若这些“策”中有点数相同的牌，则你获得这两张牌中的所有牌，将这两张牌置于牌堆两端。若场上没有处于濒死状态的角色，则你对一名角色造成1点伤害。",
  ns_lijue: "SP李傕",
  ns_zhangji: "SP张济",
  nsfeixiong: "飞熊",
  nsfeixiong_info:
    "出牌阶段开始时，你可以和一名其他角色拼点。赢的角色对没赢的角色造成1点伤害。",
  nscesuan: "策算",
  nscesuan_info:
    "锁定技，当你受到伤害时，你防止此伤害并失去一点体力上限。若你因以此法失去体力上限导致体力值减少，则你摸一张牌。",
  nslulve: "掳掠",
  nslulve_info:
    "出牌阶段限一次，你可以弃置X张牌并选择一名装备区内有牌的其他角色，然后对其造成1点伤害（X为其装备区内的牌数）。",
  ns_fanchou: "SP樊稠",
  nsyangwu: "扬武",
  nsyangwu_info:
    "出牌阶段限一次，你可以弃置一张♥手牌并选择一名手牌数大于你的其他角色。你观看其手牌并获得其中的X张牌（X为其与你手牌数之差的一半且向上取整）。",
  jsp_liubei: "群刘备",
  jsp_liubei_ab: "刘备",
  jsprende: "仁德",
  jsprende_info:
    "出牌阶段，你可以将至少一张手牌交给其他角色；若你于此阶段内给出的牌首次达到两张，你可以视为使用一张基本牌",
  ns_caoanmin: "曹安民",
  nskuishe: "窥舍",
  nskuishe_info:
    "出牌阶段限一次，你可以选择一名其他角色A的一张牌，并将此牌交给不为A的一名角色。然后A可以对你使用一张【杀】。",
  sp_xiahoushi: "SP夏侯氏",
  xinfu_yanyu: "燕语",
  xinfu_yanyu_info:
    "一名角色的出牌阶段开始时，你可以弃置一张牌。若如此做，则该出牌阶段内，当有与你弃置的牌类别相同的其他牌进入弃牌堆后，你可令任意一名角色获得此牌。每阶段以此法获得的牌不能超过三张。",
  xinfu_yanyu2: "燕语",
  xinfu_xiaode: "孝德",
  xinfu_xiaode_info:
    "其他角色死亡后，你可以声明该角色武将牌上的一个技能（主公技、觉醒技、隐匿技、使命技除外）。若如此做，你获得此技能且不能再发动〖孝德〗直到你的回合结束。",
  jsp_zhaoyun: "☆SP赵云",
  chixin: "赤心",
  chixin1: "赤心",
  chixin2: "赤心",
  chixin_info:
    "你可以将♦牌当作【杀】或【闪】使用或打出。出牌阶段，你对在你攻击范围内且本回合内未成为过你使用的【杀】的目标的角色使用的【杀】没有次数限制。",
  suiren: "随仁",
  suiren_info:
    "限定技，准备阶段开始时，你可以失去技能〖义从〗，然后加1点体力上限并回复1点体力，然后令一名角色摸三张牌。",
  huangjinleishi: "黄巾雷使",
  fulu: "符箓",
  fulu_info: "当你声明使用普通【杀】时，你可以将此【杀】改为雷【杀】。",
  fuji: "助祭",
  fuji_info:
    "当一名角色造成雷属性伤害时，你可以令其进行判定，若结果为黑色，此伤害+1；若结果为红色，该角色获得判定牌。",
  sp_pangtong: "SP庞统",
  manjuan: "漫卷",
  manjuan_info:
    "其他角色的牌因弃置而进入弃牌堆后，你可以弃置一张花色与之不同的牌，然后获得此牌。",
  xinmanjuan: "漫卷",
  xinmanjuan_info:
    "锁定技，当你不因【漫卷】或【醉乡】而获得牌时，你将此牌置入弃牌堆。然后若此时处于你的回合内，则你可以从弃牌堆中选择获得一张与此牌点数相同的其他牌。",
  zuixiang: "醉乡",
  zuixiang2: "醉乡",
  zuixiang_info:
    "限定技，准备阶段开始时，你可以展示牌堆顶的3张牌并置于你的武将牌上。你不能使用或打出与该些牌同类的牌，所有同类牌对你无效。之后的每个准备阶段，你须重复展示一次，直到这些牌中任意两张点数相同。然后，你获得这些牌。",
  sp_daqiao: "☆SP大乔",
  yanxiao: "言笑",
  yanxiao_info:
    "出牌阶段，你可以将一张♦牌置于一名角色的判定区内。判定区内有〖言笑〗牌的角色下个判定阶段开始时，其获得判定区里的所有牌。",
  anxian: "安娴",
  anxian_info:
    "当你使用【杀】对目标角色造成伤害时，你可以防止此伤害，令其弃置一张手牌，然后你摸一张牌；当你成为【杀】的目标后，你可以弃置一张手牌，令此【杀】对你无效，然后此【杀】的使用者摸一张牌。",
  sp_ganning: "☆SP甘宁",
  yinling: "银铃",
  yinling_bg: "锦",
  yinling_info:
    "出牌阶段，若你的“锦”小于四张，你可以弃置一张黑色牌并指定一名其他角色。若如此做，你将其的一张牌置于你的武将牌上，称为“锦”。",
  junwei: "军威",
  junwei2: "军威",
  junwei_info:
    "结束阶段开始时，你可以移去三张“锦”。若如此做，你须指定一名角色并令其选择一项：1.展示一张【闪】，然后你将此【闪】交给一名其他角色。2.该角色失去1点体力，然后你将其装备区内的一张牌移出游戏。该角色的回合结束后，将以此法移出游戏的装备牌移回原处。",
  sp_xiahoudun: "☆SP夏侯惇",
  fenyong: "愤勇",
  fenyong2: "愤勇",
  fenyong2_bg: "勇",
  fenyong_info:
    "每当你受到一次伤害后，你可以获得一枚「愤勇」标记；当你拥有「愤勇」标记时，防止你受到的所有伤害。",
  xuehen: "雪恨",
  xuehen_info:
    "每个角色的结束阶段开始时，若你有愤勇标记，你弃置之，然后选择一项：1.弃置当前回合角色X张牌（X为你已损失的体力值）；2.视为对一名任意角色使用一张【杀】。",
  sp_lvmeng: "☆SP吕蒙",
  tanhu: "探虎",
  tanhu2: "探虎",
  tanhu3: "探虎",
  tanhu_info:
    "出牌阶段限一次，你可以与一名其他角色拼点。若你赢，你获得以下效果直到回合结束：你与该角色的距离为1，你对该角色使用的普通锦囊牌不能被【无懈可击】响应。",
  mouduan: "谋断",
  mouduan_info:
    "游戏开始时，你获得标记“武”并获得技能〖激昂〗和〖谦逊〗。当你失去手牌后，若手牌数不大于2，你须将你的标记变为“文”，将这两项技能改为〖英姿〗和〖克己〗。一名角色的回合开始前，你可弃一张牌将标记翻回。",
  sp_zhangfei: "☆SP张飞",
  jie: "嫉恶",
  jie_info: "锁定技，当你使用红色【杀】造成伤害时，此伤害+1。",
  dahe: "大喝",
  dahe2: "大喝",
  dahe2_bg: "喝",
  dahe_info:
    "出牌阶段限一次，你可以与一名其他角色拼点。若你赢，该角色不能使用或打出不为♥花色的【闪】直到回合结束，且你可将该角色拼点的牌交给场上一名体力不多于你的角色。若你没赢，你须展示手牌并弃置其中的一张。",
  sp_liubei: "☆SP刘备",
  zhaolie: "昭烈",
  zhaolie_info:
    "摸牌阶段摸牌时，你可以少摸一张牌并指定攻击范围内的一名角色。你展示牌堆顶的三张牌，将其中的非基本牌和【桃】置于弃牌堆，然后该角色选择一项：1.你对其造成X点伤害，然后其获得这些基本牌；2.其弃置X张牌，然后你获得这些基本牌。（X为其中非基本牌的数量）",
  shichou: "誓仇",
  shichou2: "誓仇",
  shichou_info:
    "主公技，限定技，准备阶段，你可指定一名蜀势力角色并交给其两张牌。本局游戏中，当你受到伤害时，改为该角色受到等量的伤害并摸等量的牌，直至该角色第一次进入濒死状态。",
  longyufei: "龙羽飞",
  longyi: "龙裔",
  longyi_info:
    "你可将所有手牌当做任意基本牌使用或打出。若此牌对应的实体牌中：有锦囊牌，你摸一张牌；有装备牌，此牌不可被响应。",
  zhenjue: "阵绝",
  zhenjue_info:
    "一名角色的结束阶段开始时，若你没有手牌，则你可以令其选择一项：①弃置一张牌。②令你摸一张牌。",
  yj_caocao: "SP曹操",
  yjxiandao: "献刀",
  yjxiandao_info:
    "每回合限一次。当你对其他角色发动〖赠予〗后，你令其不能使用或打出与本次赠予移动的牌A花色相同的牌直到回合结束。然后若牌A：为锦囊牌，你摸两张牌。为装备牌，你获得其一张不为A的牌。为武器牌，你对其造成1点伤害。",
  yjsancai: "散财",
  yjsancai_info:
    "出牌阶段限一次，你可以展示所有手牌。若这些牌的类别均相同，则你可以发动一次〖赠予〗（可以选择任意手牌）。",
  yjyibing: "义兵",
  yjyibing_info:
    "当你不因〖赠予〗而于摸牌阶段外获得牌时，你可以将此次获得的所有牌当做【杀】使用（无距离限制且不计入使用次数）。",

  offline_star: "桌游志·SP",
  offline_sticker: "桌游志·贴纸",
  offline_luanwu: "文和乱武",
  offline_yongjian: "用间篇",
  offline_others: "线下其他系列",
};

export const translate_old = {
  old_zhangxingcai: "旧张星彩",
  old_majun: "骰子马钧",
  old_yuanshu: "手杀袁术",
  old_xusheng: "旧徐盛",
  old_lingtong: "旧凌统",
  old_zhuran: "旧朱然",
  old_caoxiu: "旧曹休",
  old_caozhen: "旧曹真",
  old_lingju: "旧灵雎",
  old_maliang: "旧马良",
  old_chenqun: "旧陈群",
  old_zhuhuan: "旧朱桓",
  old_zhuzhi: "旧朱治",
  old_machao: "☆SP马超",
  old_zhugezhan: "旧诸葛瞻",
  zhangliang: "SP张梁",
  yuji: "旧于吉",
  old_zhangfei: "OL张飞",
  old_huatuo: "OL华佗",
  jsp_caoren: "☆SP曹仁",
  ol_zhangrang: "旧张让",
  ol_liaohua: "OL廖化",
  ol_zhuran: "OL朱然",
  ol_guansuo: "OL关索",
  ol_manchong: "OL满宠",
  old_fuhuanghou: "旧伏寿",
  old_caochong: "旧曹冲",
  old_guanqiujian: "旧毌丘俭",
  old_huangfusong: "旧皇甫嵩",
  ol_maliang: "旧马良",
  ol_liuyu: "OL刘虞",
  old_wangyun: "旧王允",
  old_zhaoyun: "旧赵云",
  ol_huaxiong: "旧华雄",

  old_guhuo: "蛊惑",
  old_guhuo_info:
    "你可以说出任何一种基本牌或普通锦囊牌，并正面朝下使用或打出一张手牌。体力值不为0的其他角色依次选择是否质疑。若无角色质疑，则该牌按你所述之牌结算。若有角色质疑则亮出验明：若为真，质疑者各失去1点体力；若为假，质疑者各摸一张牌。无论真假，弃置被质疑的牌。仅当被质疑的牌为红桃花色且为真时，该牌仍然可以进行结算。",
  old_guhuo_guess: "蛊惑",
  old_guhuo_wuxie: "蛊惑",
  old_jijun: "集军",
  old_jijun_info:
    "出牌阶段，你可以将任意张手牌置于你的武将牌上。（均称为“方”）",
  old_fangtong: "方统",
  old_fangtong_info:
    "锁定技，结束阶段，若你的“方”的数目大于等于36，则你所在的游戏阵营直接取得游戏胜利。",
  old_zuilun: "罪论",
  old_zuilun_info:
    "出牌阶段，你可以获得一名其他角色的一张牌（手牌、装备区各一次），然后该角色摸一张牌。",
  old_fuyin: "父荫",
  old_fuyin_info:
    "锁定技，若你的装备区内没有防具牌，手牌数大于或等于你的其他角色不能使用【杀】、【决斗】或【火攻】指定你为目标",
  oldanxu: "安恤",
  oldanxu_info:
    "出牌阶段限一次，你可以选择手牌数不相等的两名其他角色，令其中手牌少的角色获得手牌多的角色的一张手牌并展示之，然后若此牌不为黑桃，你摸一张牌。",
  oldfaen: "法恩",
  oldfaen_info: "当一名角色翻面或横置后，你可以令其摸一张牌。",
  oldxuanfeng: "旋风",
  oldxuanfeng_info:
    "每当你失去一次装备区里的牌时，你可以执行下列两项中的一项：1.视为对任意一名其他角色使用一张【杀】（此【杀】不计入每回合的使用限制）；2.对与你距离1以内的一名其他角色造成一点伤害",
  ol_yuanshu: "旧袁术",
  fazheng: "旧法正",
  junk_simayi: "旧晋司马懿",
  junk_simayi_ab: "司马懿",
  madai: "旧马岱",
  old_yangzhi: "旧杨芷",
  old_yangyan: "旧杨艳",

  old_standard: "标准包",
  old_shenhua: "神话再临",
  old_refresh: "界限突破",
  old_yijiang1: "一将成名2011",
  old_yijiang2: "一将成名2012",
  old_yijiang3: "一将成名2013",
  old_yijiang4: "一将成名2014",
  old_yijiang5: "一将成名2015",
  old_yijiang67: "原创设计",
  old_sp: "SP",
  old_yingbian: "文德武备",
  old_mobile: "移动版",
};

export const translate_ow = {
  woliu: "涡流",
  woliu2: "涡流",
  woliu_info:
    "结束阶段，你可以选择至多两名角色，当你或目标中的任意一名角色成为杀的目标时，其余角色也将被追加为目标，直到你死亡或下一回合开始",
  qianggu: "强固",
  qianggu_info:
    "出牌阶段限一次，你可以弃置两张牌并获得两点护甲，若如此做，直到你的下个回合开始，其他角色对你使用杀时需要弃置一张基本牌，否则杀对你无效",
  qianggu2: "强固",
  qianggu2_bg: "固",
  qianggu2_info: "其他角色对你使用杀时需要弃置一张基本牌，否则杀对你无效",
  pingzhang: "屏障",
  pingzhang_info:
    "每轮各限一次，当你受到伤害时，你可以弃置一张红桃牌令伤害-1；当一名其他角色受到伤害时，你可以弃置一张黑桃牌令伤害-1",
  pingzhang_info_alter:
    "每轮各限一次，当你受到伤害时，你可以弃置一张红桃手牌令伤害-1；当一名其他角色受到伤害时，你可以弃置一张黑桃手牌令伤害-1",
  owliyong: "力涌",
  owliyong_info: "锁定技，你摸牌阶段摸牌数+X，X为你上一轮发动屏障的次数",
  dianji: "电击",
  dianji_info:
    "出牌阶段限一次，你可以将一张手牌当作惊雷闪对距离2以内的角色使用",
  feitiao: "飞跳",
  feitiao2: "飞跳",
  feitiao_info:
    "出牌阶段开始时，你可以弃置一张牌并指定一名角色，你与该角色的距离视为1直到回合结束，然后该角色随机弃置一张牌",
  bshaowei: "哨卫",
  bshaowei_info:
    "结束阶段，你可以切换至哨卫模式。当处于此模式时，你的杀无视距离和防具、无数量限制且不可闪避；你不能闪避杀",
  zhencha: "侦查",
  zhencha_info:
    "结束阶段，你可以切换至侦查模式。当处于此模式时，每当你使用一张杀，你摸一张牌或回复一点体力",
  liangou: "链钩",
  liangou_info:
    "出牌阶段限一次，你可以弃置一张牌，指定一名其他角色并进行一次判定，若结果不为红桃，该角色与你距离为1且受到的首次伤害+1直到回合结束",
  xiyang: "吸氧",
  xiyang_info: "结束阶段，若你武将牌正面朝上，你可以翻面并回复两点体力",
  qinru: "侵入",
  qinru_info:
    "每当你使用杀指定目标时，你可以令其进行一次判定，若结果不为红桃，该角色的非锁定技失效直到其下一回合结束",
  yinshen: "隐身",
  yinshen_info: "锁定技，每当你失去最后一张基本牌，你获得潜行直到下一回合开始",
  yinshen_info_old: "结束阶段，你可以弃置一张装备牌并获得潜行直到下一回合开始",
  maichong: "脉冲",
  maichong_info:
    "锁定技，每当你使用一张普通锦囊牌，你令最近三回合内被你侵入过的角色各随机弃置一张牌",
  maichong_info_alter:
    "准备阶段，你可以令最近两名被你侵入的角色各随机弃置一张牌",
  lichang: "力场",
  lichang2: "力场",
  lichang_info:
    "结束阶段，你可以弃置一张红色牌，若如此做，你可以在下个准备阶段令一名距离1以内的角色回复一点体力或摸两张牌",
  mengji: "猛击",
  mengji_info: "锁定技，若你已发动重盾，当你没有护甲时，你的杀造成的伤害+1",
  zhongdun: "重盾",
  zhongdun_info:
    "游戏开始时，你获得8点护甲；出牌阶段限一次，你可以弃置一张牌并将一点护甲分给一名没有护甲的其他角色",
  zhongdun_info_alter:
    "游戏开始时，你获得6点护甲；出牌阶段限一次，你可以弃置一张牌并将一点护甲分给一名没有护甲的其他角色",
  paotai: "炮台",
  paotai2: "炮台",
  paotai_info:
    "出牌阶段，你可以弃置一张杀布置或升级一个炮台（最高3级）；结束阶段，炮台有一定机率对一名随机敌人造成一点火焰伤害；每当你受到一点伤害，炮台降低一级",
  maoding: "铆钉",
  maoding2: "铆钉",
  maoding_info:
    "每当你造成或受到一次伤害，你可以获得一个零件；出牌阶段，你可以弃置两张零件牌令一名没有护甲的角色获得一点护甲",
  maoding_info_alter:
    "每当你造成一次伤害，你可以获得一个零件；出牌阶段，你可以弃置两张零件牌令一名没有护甲的角色获得一点护甲",
  bfengshi: "风矢",
  bfengshi2: "风矢",
  bfengshi_info:
    "锁定技，在一合内每当你使用一张牌，你的攻击范围+1；你的首张杀增加20%的概率强制命中；你的首张杀造成伤害后增加20%的概率令伤害+1",
  bfengshi_info_alter:
    "锁定技，在一合内每当你使用一张牌，你的攻击范围+1；你的首张杀增加15%的概率强制命中；你的首张杀造成伤害后增加15%的概率令伤害+1",
  yinbo: "音波",
  yinbo_info:
    "出牌阶段限一次，你可以弃置一张黑桃牌，然后随机弃置三名敌人各一张牌",
  liudan: "榴弹",
  liudan_info:
    "每当你使用一张杀，你可以令所有不是此杀目标的其他角色有50%概率成为此杀的额外目标",
  shoujia: "兽夹",
  shoujia2: "兽夹",
  shoujia3: "兽夹",
  shoujia_info:
    "出牌阶段限一次，你可以将一张牌背面朝上置于一名其他角色的武将牌上，当该角色使用一张与此牌花色相同的牌指定其他角色为目标时，移去此牌，该角色将武将牌翻至背面；当你受到伤害时，移去此牌",
  shihuo: "嗜火",
  shihuo_info: "锁定技，每当一名角色受到火焰伤害，你摸一张牌",
  shanguang: "闪光",
  shanguang_info:
    "出牌阶段限一次，你可以弃置一张方片牌令攻击范围内的一名其他角色本回合内不能使用或打出卡牌",
  tiandan: "填弹",
  tiandan_info:
    "摸牌阶段开始时，你可以跳过出牌和弃牌阶段，然后获得若干张杀直到你的手牌数等于你的体值（最多为5）",
  shenqiang: "神枪",
  shenqiang_info:
    "锁定技，每当你在出牌阶段使用杀造成伤害，本阶段内出杀次数上限+1",
  mianzhen: "眠针",
  mianzhen2: "眠针",
  mianzhen_info:
    "出牌阶段限一次，你可以弃置一张牌并令一名其他角色打出一张闪，否则该角色不能使用或打出卡牌直到其受到伤害或下一回合结束",
  aqianghua: "强化",
  aqianghua2: "强化",
  aqianghua_info:
    "出牌阶段限一次，你可以将你的全部手牌（至少一张）交给一名其他角色，该角色获得一点护甲且下一次造成的伤害+1",
  aqianghua_info_alter:
    "出牌阶段限一次，你可以将你的全部手牌（至少一张）交给一名其他角色，该角色下一次造成的伤害+1",
  zhiyuan: "支援",
  zhiyuan_info:
    "每当你即将造成伤害，你可以防止此伤害，改为令目标回复等量的体力",
  juji: "狙击",
  juji2: "狙击",
  juji3: "狙击",
  juji_info:
    "出牌阶段限一次，你可以弃置任意张花色不同的牌并指定一名有手牌的其他角色，若该角色的手牌中含有与你弃置的牌花色相同的牌，则本回合内你与其距离为1且该角色不能闪避你的杀",
  duwen: "毒吻",
  duwen2: "毒吻",
  duwen_info: "锁定技，当你造成伤害时，若你的手牌数与受伤害角色相等，此伤害+1",
  zhuagou: "抓钩",
  zhuagou_info: "出牌阶段限一次，你可以弃置一张手牌并将你的座位移到任意位置",
  dulei: "诡雷",
  dulei2: "诡雷",
  dulei_info:
    "出牌阶段，若你武将牌上没有牌，你可以将一张牌背面朝上置于你的武将牌上，当一名角色使用与该牌花色相同的牌指定你为目标时，你展示并移去此牌，然后该角色失去一点体力并随机弃置一张牌",
  shuangqiang: "霜枪",
  shuangqiang_info:
    "每当你对一名未翻面的角色造成伤害，你可以令伤害-1，然后令受伤害角色翻面",
  baoxue: "暴雪",
  baoxue_info:
    "限定技，出牌阶段，若你未翻面，你可以展示并弃置你的所有黑色牌，然后令至多X名其他角色随机弃置一张牌并将武将牌翻至背面，X为你的弃牌数；结算后你将武将牌翻至背面",
  baoxue_info_alter:
    "限定技，出牌阶段，你可以展示并弃置你的所有黑色牌，并选择等量其他角色将武将牌翻至背面，结算后你将武将牌翻至背面",
  bingqiang: "冰墙",
  bingqiang2: "冰墙",
  bingqiang2_bg: "墙",
  bingqiang3: "冰墙",
  bingqiang3_bg: "墙",
  bingqiang4: "冰墙",
  bingqiang4_bg: "墙",
  bingqiang5: "冰墙",
  bingqiang5_bg: "障",
  bingqiang_info:
    "出牌阶段，你可以弃置X张红色牌令一名角色和其相邻角色的防御离+X，或弃置X张黑色牌令一名角色和其相邻角色的进攻离-X，效果持续到你的下个回合开始",
  jidong: "急冻",
  jidong_info:
    "在一名角色的结束阶段，若你的体力值为1且未翻面，你可以翻面并回复两点体力，在你的武将牌翻至正面前，你防止所有伤害，也不能成为其他角色卡牌的目标",
  jidong_info_alter:
    "在一名角色的结束阶段，若你的体力值为1，你可以翻面并回复两点体力",
  jijia: "机甲",
  jijia_info:
    "锁定技，游戏开始时，你获得一个体力为4的机甲；你的手牌上限为你和机甲的体力之和；你受到的伤害由机甲承担",
  zihui: "自毁",
  zihui_info:
    "出牌阶段，你可以令距离2以内的所有其他角色选择一项：弃置数量等同你机甲体力值的牌，或受到2点火焰伤害，并在结算完毕后摧毁你的机甲",
  zihui_info_alter:
    "出牌阶段，你可以令距离2以内的所有其他角色选择一项：1. 弃置数量等同你机甲体力值的牌（不足则全弃，至少弃1张）；2. 或受到2点火焰伤害，并在结算完毕后摧毁你的机甲",
  tuijin: "推进",
  tuijin2: "推进",
  tuijin_info:
    "出牌阶段限一次，若你有机甲，你可以指定一名角色，本回合内视为与其距离为1",
  chongzhuang: "重装",
  chongzhuang_info: "在你失去机甲后，当你累计造成了4点伤害时，你重新获得机甲",
  shouge: "收割",
  shouge_info: "每当你杀死一名角色，你可以获得一张治疗波",
  tuji: "突击",
  tuji_info: "锁定技，在你的回合内，每当你使用一张牌，你的进攻距离+1",
  mujing: "目镜",
  mujing2: "目镜",
  mujing_info:
    "你可以将一张黑色牌当作杀使用或打出；当你的杀被闪避后，此杀不计入出杀次数",
  mujing_old_info:
    "每当你对攻击范围不含你的角色使用一张牌，你可以弃置目标一张牌；若你的手牌数不多于目标，你摸一张牌",
  feiren: "飞刃",
  feiren2: "飞刃",
  feiren_info:
    "你的杀无视距离；你的黑桃杀造成的伤害+1，梅花杀可以额外指定一个目标",
  feiren_info_alter: "你的杀无视距离；你的梅花杀可以额外指定一个目标",
  zhanlong: "斩龙",
  zhanlong_info:
    "限定技，准备阶段，若你体力值为1，你可以弃置所有牌（至少一张），然后将三张杀置入你的手牌，若如此做，你本回合使用杀无次数限制",
  xie: "谐",
  xie2: "谐",
  xie_info:
    "出牌阶段，你可以弃置一张红桃手牌并指定一名角色，该角色自其下一回合开始每隔六回合回复一点体力，直到你死亡。同一时间只能对一人发动",
  luan: "乱",
  luan2: "乱",
  luan_old_info:
    "出牌阶段，你可以弃置一张黑桃手牌并指定一名角色，该角色自其下一回合开始每隔六回合失去一点体力，直到你死亡。同一时间只能对一人发动",
  luan_info:
    "出牌阶段，你可以弃置一张黑桃手牌并指定一名角色，该角色受到伤害后流失一点体力，直到你死亡或其首次进入濒死状态。同一时间只能对一人发动",
  sheng: "圣",
  sheng_info:
    "限定技，出牌阶段，你可以将你的武将牌翻面，然后令任意名角色回复一点体力，若如此做，你不能成为其他角色的卡牌目标直到下一回合开始",
  xiandan: "霰弹",
  xiandan_info:
    "每当你使用一张杀，你可以弃置一张红色牌令此杀不可闪避，或弃置一张黑色牌令此杀伤害+1",
  yihun: "移魂",
  yihun_info:
    "结束阶段，你可以弃置一张黑色牌并指定一名其他角色，你在该角色下一准备阶段视为对其使用一张杀；在此之前，你不能使用卡牌，也不能成为卡牌的目标",
  feidan: "飞弹",
  feidan_info:
    "你的杀只能对距离1以外的角色使用；每当你使用杀造成伤害后，你可以弃置一张牌对距离目标1以内的其他角色各造成一点伤害",
  huoyu: "火雨",
  huoyu_info: "限定技，出牌阶段，你可以弃置两张红色牌，视为使用两张炽羽袭",
  yuedong: "乐动",
  yuedong_info: "出牌阶段结束时，你可以令一名角色摸一张牌",
  kuoyin: "扩音",
  kuoyin_info:
    "出牌阶段，你可以弃置一张牌令本回合乐动的目标数改为3，或弃置两张牌令本回合乐动的摸牌量改为2",
  kuoyin_info_alter: "出牌阶段，你可以弃置一张牌令本回合乐动的目标数改为3",
  huhuan: "互换",
  huhuan_info:
    "出牌阶段，你可以弃置两张牌令本回合乐动的摸牌效果改为回复等量体力",
  guangshu: "光枢",
  guangshu_heart: "光盾",
  guangshu_spade: "光塔",
  guangshu_club: "光井",
  guangshu_diamond: "光流",
  guangshu_info:
    "出牌阶段，你可以弃置一张牌，并指定一名角色，根据弃置牌的花色执行如下效果：♥该角色下次受到伤害时回复一点体力；♦︎该角色下次造成伤害时摸两张牌；♣该角色无法使用杀直到下一回合结束；♠该角色于下个结束阶段受到一点无来源的雷电伤害",
  ziyu: "自愈",
  ziyu_info:
    "在一名角色的结束阶段，你可以回复一点体力或摸一张牌，每隔四回合发动一次",
  ziyu_info_alter:
    "在一名角色的结束阶段，你可以回复一点体力或摸一张牌，每隔六回合发动一次",
  shouhu: "守护",
  shouhu_info:
    "你不能使用杀；出牌阶段，你可以弃置一张杀令一名其他角色回复一点体力",
  shanxian: "闪现",
  shanxian_info:
    "在一名其他角色的回合开始前，若你的武将牌正面朝上，你可以摸一张牌并进行一个额外回合，并在回合结束后将武将牌翻至背面。若如此做，你对其使用卡牌无视距离直到回合结束。",
  shanxian_info_alter:
    "在一名其他角色的回合开始前，若你的武将牌正面朝上，你可以进行一个额外回合，并在回合结束后将武将牌翻至背面。若如此做，你对其使用卡牌无视距离直到回合结束。",
  shanhui: "闪回",
  shanhui_info:
    "当你造成或受到伤害后，你可以将你的牌重置为上次发动闪现时的状态，若你的牌数因此而减少，你回复一点体力",
  ow_liekong: "猎空",
  ow_sishen: "死神",
  ow_tianshi: "天使",
  ow_falaozhiying: "法老之鹰",
  ow_zhixuzhiguang: "秩序之光",
  ow_luxiao: "卢西奥",
  ow_shibing: "士兵76",
  ow_yuanshi: "源氏",
  ow_chanyata: "禅雅塔",
  ow_dva: "DVA",
  ow_mei: "小美",
  ow_heibaihe: "黑百合",
  ow_ana: "安娜",
  ow_baolei: "堡垒",
  ow_maikelei: "麦克雷",
  ow_banzang: "半藏",
  ow_kuangshu: "狂鼠",
  ow_tuobiang: "托比昂",
  ow_laiyinhate: "莱因哈特",
  ow_luba: "路霸",
  ow_wensidun: "温斯顿",
  ow_zhaliya: "查莉娅",
  ow_heiying: "黑影",
  ow_orisa: "奥丽莎",
};

export const translate_refresh = {
  re_zhangliao: "界张辽",
  re_huangyueying: "新黄月英",
  re_simayi: "界司马懿",
  re_xuzhu: "界许褚",
  re_xiahoudun: "界夏侯惇",
  re_lvmeng: "界吕蒙",
  re_zhouyu: "界周瑜",
  re_luxun: "界陆逊",
  re_zhaoyun: "界赵云",
  re_guanyu: "界关羽",
  re_zhangfei: "界张飞",
  re_machao: "界马超",
  re_caocao: "界曹操",
  re_guojia: "界郭嘉",
  re_lvbu: "界吕布",
  re_huanggai: "界黄盖",
  re_daqiao: "界大乔",
  re_ganning: "界甘宁",
  re_huatuo: "界华佗",
  re_liubei: "界刘备",

  re_diaochan: "界貂蝉",
  re_huangyueying: "界黄月英",
  re_sunquan: "界孙权",
  re_sunshangxiang: "界孙尚香",
  re_zhugeliang: "界诸葛亮",
  re_zhenji: "界甄宓",
  re_huaxiong: "界华雄",

  ol_sp_zhugeliang: "界卧龙",
  re_dianwei: "界典韦",
  re_yanwen: "界颜良文丑",
  xin_yuanshao: "手杀袁绍",
  re_zhangjiao: "界张角",
  re_sunce: "界孙策",
  ol_yuanshao: "界袁绍",
  ol_liushan: "界刘禅",

  olfangquan: "放权",
  olfangquan_info:
    "出牌阶段开始前，你可以跳过此阶段。若如此做，弃牌阶段开始时，你可以弃置一张手牌，令一名其他角色进行一个额外回合。",
  olruoyu: "若愚",
  olruoyu_info:
    "主公技，觉醒技，准备阶段，若你的体力值为全场最少，则你加1点体力上限，将体力回复至3点，然后获得技能〖思蜀〗和〖激将〗。",
  sishu: "思蜀",
  sishu_info:
    "出牌阶段开始时，你可以选择一名角色。该角色本局游戏内【乐不思蜀】的判定效果反转。",
  olluanji: "乱击",
  olluanji_info:
    "你可以将两张花色相同的手牌当做【万箭齐发】使用。当你使用【万箭齐发】选择目标后，你可以为此牌减少一个目标。",
  olluanji_remove: "乱击",
  olxueyi: "血裔",
  olxueyi_info:
    "主公技，锁定技。①游戏开始时，你获得2X个“裔”标记（X为场上群势力角色的数目）。②出牌阶段开始时，你可以移去一个“裔”标记，然后摸一张牌。③你的手牌上限+Y（Y为“裔”标记数）。",
  olxueyi_draw: "血裔",
  olhunzi: "魂姿",
  olhunzi_info:
    "觉醒技，准备阶段，若你的体力值为1，你减1点体力上限并回复1点体力，然后获得技能〖英姿〗和〖英魂〗。",
  olzhiba: "制霸",
  olzhiba_info:
    "主公技，其他吴势力的角色的出牌阶段限一次，其可以与你拼点（你可拒绝此拼点）。若其没赢，你可以获得两张拼点牌。你的出牌阶段限一次，你可以和一名吴势力角色拼点，若你赢，你获得两张拼点牌。",
  olzhiba2: "制霸",
  xinleiji: "雷击",
  xinleiji_misa: "雷击",
  xinguidao: "鬼道",
  xinleiji_info:
    "①当你使用或打出【闪】或【闪电】时，你可以进行判定。②当你的判定的判定牌生效后，若结果为：黑桃，你可对一名其他角色造成2点雷电伤害；梅花：你回复1点体力并可对一名其他其他角色造成1点雷电伤害。",
  xinleiji_append:
    '<span style="font-family: yuanli">不能触发〖雷击〗的判定：〖暴虐〗、〖助祭〗、<br>〖弘仪〗、〖孤影〗。</span>',
  xinleiji_faq: "不能触发〖雷击〗的判定",
  xinleiji_faq_info:
    "<br>董卓/界董卓〖暴虐〗<br>黄巾雷使〖助祭〗<br>羊徽瑜〖弘仪〗<br>鸣濑白羽〖孤影〗",
  xinguidao_info:
    "一名角色的判定牌生效前，你可以打出一张黑色牌作为判定牌并获得原判定牌。若你以此法打出的牌为黑桃2-9，则你摸一张牌。",
  xinhuangtian: "黄天",
  xinhuangtian2: "黄天",
  xinhuangtian_info:
    "主公技。其他群势力角色的出牌阶段限一次，该角色可以交给一张【闪】或黑桃手牌。",
  reqiangxi: "强袭",
  reqiangxi_info:
    "出牌阶段对每名其他角色限一次，你可以选择一项：1. 失去一点体力并对你攻击范围内的一名其他角色造成一点伤害；2. 弃置一张武器牌并对你攻击范围内的一名其他角色造成一点伤害。",
  rehuoji: "火计",
  rehuoji_info: "出牌阶段，你可一张红色牌当作【火攻】使用。",
  rekanpo: "看破",
  rekanpo_info: "你可以将一张黑色牌当作【无懈可击】使用。",
  reshuangxiong: "双雄",
  reshuangxiong_info:
    "摸牌阶段，你可以放弃摸牌。若如此做，你展示牌堆顶的两张牌并选择获得其中的一张。然后，你本回合内可以将与此牌颜色不同的一张手牌当做【决斗】使用。当你受到【决斗】造成的伤害时，你可以获得对方于此决斗中打出的所有【杀】",
  reshuangxiong2: "双雄",
  reshuangxiong2_info: "",

  reguanxing: "观星",
  reguanxing_info:
    "准备阶段，你可以观看牌堆顶的5张牌（存活角色小于4时改为3张），并将其以任意顺序置于牌堆项或牌堆底，若你将〖观星〗的牌都放在了牌堆底，则你可以在结束阶段再次发动〖观星〗。",
  reluoshen: "洛神",
  reluoshen_info:
    "准备阶段，你可以进行判定，若结果为黑色则获得此判定牌，且可重复此流程直到出现红色的判定结果。你通过〖洛神〗获得的牌，不计入当前回合的手牌上限",
  reluoshen_info_guozhan:
    "准备阶段，你可以进行判定，若为黑色则可以继续判定，直到出现红色。然后你获得所有黑色的判定牌。你通过〖洛神〗获得的牌，不计入当前回合的手牌上限。（结果为黑色的判定牌于此过程中不会进入弃牌堆）",
  rejieyin: "结姻",
  rejieyin_info:
    "出牌阶段限一次，你可以选择一名男性角色并弃置一张手牌或将装备区内的一张装备牌置于其装备区，你与其体力较高的角色摸一张牌，体力值较低的角色回复1点体力。",
  rebiyue: "闭月",
  rebiyue_info: "结束阶段，你可以摸一张牌，若你没有手牌，则改为摸两张牌。",
  rejizhi: "集智",
  rejizhi_info:
    "当你使用锦囊牌时，你可以摸一张牌。若此牌为基本牌，则你可以弃置之，然后令本回合手牌上限+1。",
  reqicai: "奇才",
  reqicai_info:
    "锁定技，你使用锦囊牌无距离限制，你装备区内的防具牌和宝物牌不能被其他角色弃置。",
  rezhiheng: "制衡",
  rezhiheng_info:
    "出牌阶段限一次，你可以弃置任意张牌并摸等量的牌，若你在发动〖制衡〗时弃置了所有手牌，则你多摸一张牌。",
  rejiuyuan: "救援",
  rejiuyuan_info:
    "主公技，其他吴势力角色对自己使用【桃】时，若其体力值大于你，则其可以选择令你回复1点体力，然后其摸1张牌。",

  new_yajiao: "涯角",
  new_yajiao_info:
    "每当你于回合外使用或打出牌时，你可以亮出牌堆顶的一张牌，并将其交给一名角色。若此牌与你此次使用或打出的牌类别不同，则你弃置一张牌。",
  new_liyu: "利驭",
  new_liyu_info:
    "当你使用【杀】对一名其他角色造成伤害后，你可以获得其区域内的一张牌。若此牌不为装备牌，则其摸一张牌。若此牌为装备牌，则视为你对其选择的另一名角色使用一张【决斗】。",
  new_retuxi: "突袭",
  new_retuxi_info:
    "摸牌阶段摸牌时，你可以少摸任意张牌，然后获得等量的角色的各一张手牌。",
  new_retuxi_info_guozhan:
    "摸牌阶段摸牌时，你可以少摸至多两张牌，然后获得等量的角色的各一张手牌。",
  new_reyiji: "遗计",
  new_reyiji_info:
    "当你受到1点伤害后，你可以摸两张牌，然后可以将至多两张手牌交给其他角色。",
  new_rejianxiong: "奸雄",
  new_rejianxiong_info:
    "当你受到伤害后，你可以获得对你造成伤害的牌并摸一张牌。",
  new_reluoyi: "裸衣",
  new_reluoyi_info:
    "摸牌阶段开始时，你展示牌堆顶的三张牌。然后，你可以放弃摸牌。若如此做，你获得其中的基本牌、武器牌和【决斗】，且直到你的下回合开始，你使用的【杀】或【决斗】造成伤害时，此伤害+1。否则，你将这些牌置入弃牌堆。",
  new_rewusheng: "武圣",
  new_rewusheng_info:
    "你可以将一张红色牌当做【杀】使用或打出。你使用的方片杀没有距离限制。",
  new_yijue: "义绝",
  new_yijue_info:
    "出牌阶段限一次，你可以弃置一张牌并令一名有手牌的其他角色展示一张手牌。若此牌为黑色，则该角色不能使用或打出牌，非锁定技失效且受到来自你的红桃【杀】的伤害+1直到回合结束。若此牌为红色，则你可以获得此牌，并可以令其回复一点体力。",
  new_yijue2: "义绝",
  new_yijue2_info: "",
  new_repaoxiao: "咆哮",
  new_repaoxiao_info:
    "锁定技，出牌阶段，你使用【杀】没有数量限制。若你于此出牌阶段内使用过【杀】，则你本回合内使用【杀】没有距离限制。",
  new_tishen: "替身",
  new_tishen_info:
    "出牌阶段结束时，你可以弃置你所有的锦囊牌与坐骑牌。若如此做，直到你的下个回合开始，你获得所有以你为目标且未对你造成伤害的【杀】。",
  new_tishen2: "替身",
  new_tishen2_info: "",
  new_qingjian: "清俭",
  new_qingjian_info:
    "当你于摸牌阶段外获得牌时，你可以展示任意张牌并交给一名其他角色。然后，当前回合角色本回合的手牌上限+X（X为你给出的牌中包含的类别数）。每回合限一次。",
  qingjian_add: "清俭",
  qingjian_add_info: "",
  new_reqingnang: "青囊",
  new_reqingnang_info:
    "出牌阶段，你可以弃置一张手牌，令一名本回合内未成为过〖青囊〗的目标的角色回复一点体力。若你弃置的是黑色牌，则你本回合内不能再发动〖青囊〗。",
  new_reyaowu: "耀武",
  new_reyaowu_info:
    "锁定技，当一名角色使用【杀】对你造成伤害时，若此杀为红色，该角色回复1点体力或摸一张牌。否则你摸一张牌。",
  reyaowu: "耀武",
  reyaowu_info:
    "锁定技，当你受到牌造成的伤害时，若此牌为红色，则伤害来源摸一张牌；否则你摸一张牌。",
  reqingguo: "倾国",
  reqingguo_info: "你可以将一张黑色牌当做【闪】使用或打出。",

  qinxue: "勤学",
  retuxi: "突袭",
  reluoyi: "裸衣",
  reluoyi2: "裸衣",
  reganglie: "刚烈",
  qingjian: "清俭",
  reyingzi: "英姿",
  refanjian: "反间",
  refanjian_card: "弃牌",
  refanjian_hp: "流失体力",
  reqianxun: "谦逊",
  reqianxun2: "谦逊",
  relianying: "连营",
  retishen: "替身",
  retishen2: "替身",
  reyajiao: "涯角",
  rejianxiong: "奸雄",
  rejianxiong_mopai: "摸牌",
  rejianxiong_napai: "拿牌",
  reyiji: "遗计",
  reyiji2: "遗计",
  yijue: "义绝",
  yijue2: "义绝",
  retieji: "铁骑",
  refankui: "反馈",
  reyicong: "义从",
  qiaomeng: "趫猛",
  rekurou: "苦肉",
  zhaxiang: "诈降",
  zhaxiang2: "诈降",
  zhuhai: "诛害",
  qianxin: "潜心",
  jianyan: "荐言",
  reguicai: "鬼才",
  xunxun: "恂恂",
  wangxi: "忘隙",
  reguose: "国色",
  fenwei: "奋威",
  chulao: "除疠",
  liyu: "利驭",
  rerende: "仁德",
  rerende_info:
    "出牌阶段，你可以将至少一张手牌交给其他角色，然后你于此阶段内不能再以此法交给该角色牌；若你于此阶段内给出的牌首次达到两张，你可以视为使用一张基本牌",
  liyu_info:
    "当你使用【杀】对一名其他角色造成伤害后，该角色可令你获得其一张牌，若如此做，则视为你对其选择的另一名角色使用一张【决斗】",
  xunxun_info:
    "摸牌阶段，你可以观看牌堆顶的四张牌，然后将其中的两张牌置于牌堆顶，并将其余的牌以任意顺序置于牌堆底。",
  wangxi_info:
    "每当你对其他角色造成1点伤害后，或受到其他角色造成的1点伤害后，你可与该角色各摸一张牌。",
  reguose_info:
    "出牌阶段限一次，你可以选择一项：将一张方片花色牌当做【乐不思蜀】使用；或弃置一张方片花色牌并弃置场上的一张【乐不思蜀】。选择完成后，你摸一张牌。",
  fenwei_info:
    "限定技，当一名角色使用的锦囊牌指定了至少两名角色为目标时，你可以令此牌对其中任意名角色无效。",
  chulao_info:
    "出牌阶段限一次，若你有牌，你可以选择任意名势力各不相同的其他角色，你弃置你和这些角色的各一张牌。然后以此法弃置黑桃牌的角色各摸一张牌。",
  reguicai_info: "在任意角色的判定牌生效前，你可以打出一张牌代替之",
  zhuhai_info:
    "一名其他角色的结束阶段开始时，若该角色本回合造成过伤害，你可以对其使用一张【杀】。",
  qianxin_info:
    "觉醒技，当你造成一次伤害后，若你已受伤，你须减1点体力上限，并获得技能“荐言”。",
  jianyan_info:
    "出牌阶段限一次，你可以声明一种牌的类别或颜色，并亮出牌库中第一张符合你声明的牌，然后你令一名男性角色获得此牌",
  rekurou_info: "出牌阶段限一次，你可以弃置一张牌，然后失去1点体力。",
  zhaxiang_info:
    "锁定技 每当你失去1点体力后，你摸三张牌。然后若此时是你的出牌阶段，则直到回合结束，你使用红色【杀】无距离限制且不能被【闪】响应，你可以额外使用一张【杀】。",
  qiaomeng_info:
    "当你使用黑色【杀】对一名角色造成伤害后，你可以弃置该角色装备区里的一张牌，若此牌是坐骑牌，你于此牌置入弃牌堆后获得之。",
  reyicong_info:
    "锁定技，你计算与其他角色的距离时-1。若你的体力值不大于2，则其他角色计算与你的距离时+1。",
  refankui_info: "每当你受到1点伤害后，你可以获得伤害来源的一张牌。",
  retieji_info:
    "当你使用【杀】指定一名角色为目标后，你可以进行一次判定并令该角色的非锁定技失效直到回合结束，除非该角色弃置一张与判定结果花色相同的牌，否则不能使用【闪】抵消此【杀】。",
  yijue_info:
    "出牌阶段限一次，你可以与一名其他角色拼点，若你赢，则直到回合结束，该角色不能使用或打出手牌且其非锁定技失效，若你没赢，你可令该角色回复一点体力。",
  reyiji_info:
    "每当你受到1点伤害后，你可以摸两张牌。然后你可以在至多两名角色的武将牌旁边分别扣置至多两张手牌，这些角色的下个摸牌阶段开始时，该角色获得其武将牌旁的这些牌。",
  rejianxiong_info:
    "每当你受到伤害后，你可以获得对你造成伤害的牌，然后摸一张牌。",
  reyajiao_info:
    "每当你于回合外使用或打出一张手牌时，你可以亮出牌堆顶的一张牌，若此牌与你此次使用或打出的牌类别相同，你可以将之交给任意一名角色；若不同则你可以将之置入弃牌堆。",
  retishen_info:
    "限定技，准备阶段开始时，你可以将体力回复至等同于你上回合结束时的体力值，然后你每以此法回复1点体力，便摸一张牌。",
  reqianxun_info:
    "每当一张延时类锦囊牌或其他角色使用的普通锦囊牌生效时，若你是此牌的唯一目标，你可以将所有手牌置于你的武将牌上，若如此做，此回合结束时，你获得你武将牌上的所有牌。",
  relianying_info:
    "当你失去最后的手牌时，你可以令至多X名角色各摸一张牌（X为你此次失去的手牌数）。",
  reyingzi_info:
    "锁定技，摸牌阶段摸牌时，你额外摸一张牌；你的手牌上限为你的体力上限。",
  refanjian_info:
    "出牌阶段限一次，你可以展示一张手牌并将此牌交给一名其他角色。然后该角色选择一项：展示其手牌并弃置所有与此牌花色相同的牌，或失去一点体力。",
  qingjian_info:
    "每当你于摸牌阶段外获得牌时，你可以将其中任意牌以任意顺序交给其他角色，每回合最多发动四次",
  qinxue_info:
    "觉醒技。准备阶段或结束阶段开始时，若你的手牌数减体力值大于1，则你减一点体力上限，回复1点体力或摸两张牌，获得技能【攻心】。",
  retuxi_info:
    "摸牌阶段摸牌时，你可以少摸任意张牌，然后选择等量的手牌数大于或等于你的其他角色，获得这些角色的各一张手牌。",
  reluoyi_info:
    "你可以跳过摸牌阶段，然后展示牌堆顶的三张牌，获得其中的基本牌、武器牌和【决斗】，若如此做，直到你的下回合开始，你为伤害来源的【杀】或【决斗】造成的伤害+1。",
  reganglie_info:
    "当你受到1点伤害后，你可进行判定，若结果为：红色，你对伤害来源造成1点伤害，；黑色，你弃置伤害来源一张牌。",
  reganglie_info_guozhan:
    "当你受到伤害后，你可进行判定，若结果为：红色，你对伤害来源造成1点伤害，；黑色，你弃置伤害来源一张牌。",
  botu: "博图",
  botu_info:
    "回合结束时，若你本回合出牌阶段内使用的牌包含四种花色，则你可以进行一个额外回合。",
  rebotu: "博图",
  rebotu_info:
    "每轮限X次。结束阶段，若本回合内置入弃牌堆的牌中包含至少四种花色，则你可获得一个额外的回合。（X为存活角色数且至多为3）",

  xin_yuji: "界于吉",
  re_zuoci: "界左慈",
  reguhuo: "蛊惑",
  reguhuo_info:
    "每名角色的回合限一次，你可以扣置一张手牌当作一张基本牌或普通锦囊牌使用或打出。其他角色同时选择是否质疑。然后，你展示此牌。若有质疑的角色：若此牌为假，则此牌作废，且所有质疑者各摸一张牌；为真，则所有质疑角色于此牌结算完成后依次弃置一张牌或失去1点体力，并获得技能〖缠怨〗。",
  reguhuo_guess: "蛊惑",
  reguhuo_guess_info: "",
  rechanyuan: "缠怨",
  rechanyuan_info:
    "锁定技，你不能于〖蛊惑〗的结算流程中进行质疑。当你的体力值不大于1时，你的其他技能失效。",
  reguhuo_sha: "蛊惑",
  reguhuo_shan: "蛊惑",
  reguhuo_wuxie: "蛊惑",
  reguhuo_ally: "信任",
  reguhuo_betray: "质疑",
  reguhuo_ally_bg: "真",
  reguhuo_betray_bg: "假",
  rehuashen: "化身",
  rehuashen_info:
    "游戏开始后，你随机获得三张未加入游戏的武将牌，选一张置于你面前并声明该武将牌的一项技能，你拥有该技能且同时将性别和势力属性变成与该武将相同直到该化身被替换。你的每个准备阶段和结束后，你可以选择一项：①弃置至多两张未展示的化身牌并重新获得等量化身牌；②更换所展示的化身牌或技能。（你不可声明限定技、觉醒技、隐匿技、使命技、主公技等特殊技能）。",
  rexinsheng: "新生",
  rexinsheng_info: "当你受到1点伤害后，你可以获得一张新的化身牌。",
  re_menghuo: "界孟获",
  re_sunjian: "手杀孙坚",
  re_caopi: "界曹丕",
  oljiuchi: "酒池",
  oljiuchi_info:
    "你可以将一张黑桃手牌当做【酒】使用。锁定技，你使用【酒】无次数限制，且当你于回合内使用带有【酒】效果的【杀】造成伤害后，你令你的【崩坏】失效直到回合结束。",
  repolu: "破虏",
  repolu_info:
    "当你杀死一名角色/死亡时，你可以令任意名角色摸X+1张牌。（X为你此前发动过【破虏】的次数）",
  rexingshang: "行殇",
  rexingshang_info:
    "当其他角色死亡后，你可以选择一项：回复1点体力，或获得其所有牌。",
  refangzhu: "放逐",
  refangzhu_info:
    "当你受到伤害后，你可以令一名其他角色选择一项：摸X张牌并将武将牌翻面，或弃置X张牌并失去1点体力。（X为你已损失的体力值）",
  rezaiqi: "再起",
  rezaiqi_info:
    "结束阶段开始时，你可以令至多X名角色选择一项：1.摸一张牌，2.令你回复1点体力（X为本回合进入弃牌堆的红色牌数）",
  ol_caiwenji: "界蔡琰",
  re_baosanniang: "手杀鲍三娘",
  retuntian: "屯田",
  rebeige: "悲歌",
  retuntian_info:
    "当你于回合外失去牌时，你可以进行一次判定。若判定结果为♥，你获得此判定牌。否则你将此牌置于你的武将牌上，称之为【田】。锁定技，你计算与其他角色的距离时-X（X为你武将牌上【田】的数目）",
  rebeige_info:
    "当有角色受到【杀】造成的伤害后，你可以弃一张牌，并令其进行一次判定，若判定结果为：♥该角色回复X点体力(X为伤害点数)；♦︎该角色摸三张牌；♣伤害来源弃两张牌；♠伤害来源将其武将牌翻面",
  re_liushan: "手杀刘禅",
  re_sunben: "界孙笨",
  re_zhangzhang: "界张昭张纮",
  rehunzi: "魂姿",
  rehunzi_info:
    "觉醒技，准备阶段，若你的体力值不大于2，你减1点体力上限，并获得技能〖英姿〗和〖英魂〗。",
  rezhijian: "直谏",
  rezhijian_info:
    "出牌阶段，你可以将手牌中的一张装备牌置于一名其他角色装备区里（不得替换原装备），然后摸一张牌。当你使用装备牌时，你可以摸一张牌。",
  refangquan: "放权",
  refangquan_info:
    "你可跳过你的出牌阶段，若如此做，你本回合的手牌上限为你的体力上限，且回合结束时，你可以弃置一张手牌并令一名其他角色进行一个额外的回合。",
  xin_gaoshun: "界高顺",
  repojun: "破军",
  repojun2: "破军",
  repojun3: "破军",
  repojun_info:
    "当你使用【杀】指定目标后，你可以将其的至多X张牌置于其武将牌上（X为其体力值），然后其于当前回合结束时获得这些牌。当你因执行【杀】的效果而对一名角色造成伤害时，若该角色的手牌数和装备区内的牌数均不大于你，则此伤害+1。",
  rexianzhen: "陷阵",
  rexianzhen_info:
    "出牌阶段限一次，你可以和一名其他角色拼点。若你赢，你本回合内对其使用牌没有次数和距离限制且无视其防具。若你没赢，你本回合内不能使用【杀】。若你以此法失去的拼点牌为【杀】，则你的【杀】不计入本回合的手牌上限。",
  rejinjiu: "禁酒",
  rejinjiu_info:
    "锁定技，你的【酒】均视为【杀】。其他角色不能于你的回合内使用【酒】。当你受到酒【杀】的伤害时，你令此伤害-X（X为影响过此【杀】的伤害值的【酒】的数量）",
  rejinjiu2: "禁酒",
  rejinjiu3: "禁酒",
  ol_xiahouyuan: "界夏侯渊",
  shebian: "设变",
  shebian_info: "当你的武将牌翻面后，你可以移动场上的一张装备牌。",
  cangzhuo: "藏拙",
  cangzhuo_info:
    "弃牌阶段开始时，若你本回合内没有使用过锦囊牌，则你的锦囊牌不计入手牌上限。",
  re_zhangyi: "界张嶷",
  rewurong: "怃戎",
  rewurong_info:
    "出牌阶段限一次，你可以令一名其他角色与你同时展示一张手牌：若你展示的是【杀】且该角色展示的不是【闪】，则你对其造成1点伤害；若你展示的不是【杀】且该角色展示的是【闪】，则你获得其一张牌",
  ol_pangtong: "界庞统",
  olniepan: "涅槃",
  olniepan_info:
    "限定技，当你处于濒死状态时，你可以弃置你区域内的所有牌并复原你的武将牌，然后摸三张牌并将体力回复至3点。然后你选择获得以下技能中的一个：〖八阵〗/〖火计〗/〖看破〗",
  ol_weiyan: "界魏延",
  reqimou: "奇谋",
  reqimou_info:
    "限定技，出牌阶段，你可以失去任意点体力并摸等量的牌，然后直到回合结束，你计算与其他角色的距离时-X，且你可以多使用X张【杀】（X为你失去的体力值）",
  ol_xiaoqiao: "界小乔",
  rehongyan: "红颜",
  rehongyan_info:
    "锁定技，你区域内的黑桃牌和黑桃判定牌均视为红桃。当你于回合外正面朝上失去红桃牌后，若你的手牌数小于体力值，你摸一张牌。",
  re_caozhi: "界曹植",
  reluoying: "落英",
  reluoying_discard: "落英",
  reluoying_judge: "落英",
  reluoying_info:
    "当其他角色的梅花牌因弃置或判定而进入弃牌堆后，你可以获得之。",
  rejiushi: "酒诗",
  rejiushi_info:
    "当你需要使用【酒】时，若你的武将牌正面向上，你可以翻面，视为使用一张【酒】。当你受到伤害后，若你的武将牌背面向上，你可以翻面并获得牌堆中的一张随机锦囊。",
  rejiushi1: "酒诗",
  rejiushi3: "酒诗",
  rejiushi_mark: "酒诗·改",
  rejiushi_mark_info:
    "当你需要使用【酒】时，若你的武将牌正面向上，你可以翻面，视为使用一张【酒】。当你受到伤害后，若你的武将牌背面向上，你可以翻面。当你翻面时，你获得牌堆中的一张随机锦囊。",
  chengzhang: "成章",
  chengzhang_info:
    "觉醒技，准备阶段开始时，若你造成伤害与受到伤害值之和累计7点或以上，则你回复1点体力并摸1张牌，然后改写〖酒诗〗。",
  re_wuyi: "界吴懿",
  re_zhuran: "界朱然",
  re_quancong: "界全琮",
  re_liaohua: "界廖化",
  re_guohuai: "界郭淮",
  re_chengpu: "界程普",
  rechunlao: "醇醪",
  rechunlao2: "醇醪",
  rechunlao_info:
    "出牌阶段结束时，若你没有“醇”，你可以将至少一张【杀】置于你的武将牌上，称为“醇”。当一名角色处于濒死状态时，你可以移去一张“醇”，视为该角色使用一张【酒】，然后若此“醇”的属性为：火，你回复1点体力、雷，你摸两张牌。",
  re_caozhang: "界曹彰",
  yujin_yujin: "界于禁",
  rexuanfeng: "旋风",
  rexuanfeng_info:
    "当你失去装备区内的牌时，或于弃牌阶段弃置了两张或更多的手牌后，你可以依次弃置一至两名其他角色的共计两张牌，或将一名其他角色装备区内的一张牌移动到另一名其他角色的装备区内。",
  olpaoxiao: "咆哮",
  olpaoxiao2: "咆哮",
  olpaoxiao_info:
    "①锁定技，你使用【杀】无次数限制。②锁定技，当你使用的【杀】被【闪】抵消时，你获得一枚“咆”（→）当你因【杀】造成伤害时，你弃置所有“咆”并令伤害值+X（X为“咆”数）。回合结束后，你弃置所有“咆”。",
  oltishen: "替身",
  oltishen_info:
    "限定技，准备阶段，你可以将体力回复至上限，然后摸X张牌（X为你回复的体力值）。",
  ollongdan: "龙胆",
  ollongdan_info:
    "你可以将一张【杀】当做【闪】、【闪】当做【杀】、【酒】当做【桃】、【桃】当做【酒】使用或打出。",
  olyajiao: "涯角",
  olyajiao_info:
    "当你于回合外因使用或打出而失去手牌后，你可以展示牌堆顶的一张牌。若这两张牌的类别相同，你可以将展示的牌交给一名角色；若类别不同，你可弃置攻击范围内包含你的角色区域里的一张牌。",
  regongji: "弓骑",
  regongji_info:
    "出牌阶段限一次，你可以弃置一张非基本牌，然后弃置一名其他角色的一张牌。锁定技，当你的装备区内有坐骑牌时，你的攻击范围无限。",
  ol_sunjian: "界孙坚",
  wulie: "武烈",
  wulie2: "武烈",
  wulie_info:
    "限定技，结束阶段，你可以失去任意点体力并指定等量的其他角色。这些角色各获得一枚「烈」。有「烈」的角色受到伤害时，其移去一枚「烈」，然后防止此伤害。",
  re_sunluban: "界孙鲁班",
  re_masu: "界马谡",
  ol_pangde: "界庞德",
  rejianchu: "鞬出",
  rejianchu_info:
    "当你使用【杀】指定一名角色为目标后，你可以弃置其一张牌，若以此法弃置的牌不为基本牌，此【杀】不可被【闪】响应且你本回合使用【杀】的次数上限+1，为基本牌，该角色获得此【杀】",
  re_taishici: "界太史慈",
  hanzhan: "酣战",
  hanzhan_gain: "酣战",
  hanzhan_info:
    "当你发起拼点时，或成为拼点的目标时，你可以令对方选择拼点牌的方式改为随机选择一张手牌。当你拼点结束后，你可以获得双方拼点牌中点数最大的【杀】。",
  re_jianyong: "界简雍",
  xin_xusheng: "界徐盛",
  decadepojun: "破军",
  decadepojun2: "破军",
  decadepojun_info:
    "当你使用【杀】指定目标后，你可以将其的至多X张牌置于其武将牌上（X为其体力值）。若这些牌中：有装备牌，你将这些装备牌中的一张置于弃牌堆；有锦囊牌，你摸一张牌。其于回合结束时获得其武将牌上的这些牌。",
  re_wangyi: "界王异",
  wangyi: "王异",
  guanzhang: "界关兴张苞",
  rezishou: "自守",
  rezishou2: "自守",
  rezishou_info:
    "摸牌阶段，你可以多摸X张牌。若如此做，本回合你对其他角色造成伤害时，防止此伤害。",
  rezongshi: "宗室",
  rezongshi_info:
    "锁定技，你的手牌上限+X（X为势力数）。准备阶段，若你的手牌数大于体力值，则你本回合内使用【杀】无次数限制。",
  ol_dongzhuo: "界董卓",
  olbaonue: "暴虐",
  olbaonue_info:
    "主公技，其他群雄角色造成1点伤害后，你可进行判定，若为♠，你回复1点体力并获得判定牌。",
  re_panzhangmazhong: "界潘璋马忠",
  re_hanhaoshihuan: "界韩浩史涣",
  xinyicong: "义从",
  xinyicong_info:
    "锁定技，你计算与其他角色的距离时-X，其他角色计算与你的距离时+Y。（X为你的体力值-1，Y为你的已损失体力值-1）",
  oltianxiang: "天香",
  oltianxiang_info:
    "当你受到伤害时，你可以弃置一张红桃牌，防止此伤害并选择一名其他角色，然后你选择一项：1.令其受到伤害来源对其造成的1点伤害，然后摸X张牌（X为其已损失体力值且至多为5）；2.令其失去1点体力，然后获得你弃置的牌。",
  olhongyan: "红颜",
  olhongyan_info:
    "锁定技，你的黑桃牌的花色视为红桃。若你的装备区内有红桃牌，则你的手牌上限基数视为体力上限。",
  piaoling: "飘零",
  piaoling_info:
    "结束阶段，你可以进行判定。若判定结果为红桃，则你选择一项：1.将此牌交给一名角色。若你交给了自己，则你弃置一张牌。2.将此牌置于牌堆顶。",
  decadelihuo: "疠火",
  decadelihuo2: "疠火",
  decadelihuo3: "疠火",
  decadelihuo_info:
    "当你声明使用普【杀】时，你可以将此【杀】改为火【杀】。当你使用火【杀】选择目标时，可以选择一个额外目标。你使用的火【杀】结算完成后，若此【杀】的目标数大于1且你因此【杀】造成过伤害，则你失去1点体力。",
  decadechunlao: "醇醪",
  decadechunlao2: "醇醪",
  decadechunlao_info:
    "你可以对其他角色使用【酒（使用方法②）】。当你需要使用【酒】时，若你的武将牌未横置，则你可以将武将牌横置，然后视为使用【酒】。当你受到或造成伤害后，若伤害值大于1且你的武将牌横置，则你可以重置武将牌。",
  re_liru: "界李儒",
  rejuece: "绝策",
  rejuece_info: "结束阶段，你可以对一名本回合内失去过牌的角色造成1点伤害。",
  remieji: "灭计",
  remieji_info:
    "出牌阶段限一次，你可以将一张黑色锦囊牌置于牌堆顶，然后令一名有牌的其他角色选择一项：交给你一张锦囊牌，或依次弃置两张非锦囊牌。",
  re_manchong: "界满宠",
  rejunxing: "峻刑",
  rejunxing_info:
    "出牌阶段限一次，你可以弃置任意张手牌并选择一名其他角色。该角色选择一项：1.弃置X张牌并失去1点体力。2.翻面并摸X张牌。（X为你弃置的牌数）",
  re_gongsunzan: "OL公孙瓒",
  reqiaomeng: "趫猛",
  reqiaomeng_info:
    "当你使用【杀】对一名角色造成伤害后，你可以弃置该角色区域内的一张牌。若此牌为坐骑牌，则你于此弃置事件结算结束后获得此牌。",
  ol_dengai: "界邓艾",
  oltuntian: "屯田",
  olzaoxian: "凿险",
  oltuntian_info:
    "当你于回合外失去牌后，或于回合内因弃置而失去【杀】后，你可以进行判定。若判定结果不为♥，则你将此牌置于你的武将牌上，称之为【田】。锁定技，你计算与其他角色的距离时-X（X为你武将牌上【田】的数目）",
  olzaoxian_info:
    "觉醒技，准备阶段，若你武将牌上【田】的数量达到3张或更多，则你减1点体力上限，并获得技能〖急袭〗。你于当前回合结束后进行一个额外的回合。",
  re_sunxiu: "界孙休",
  re_caoxiu: "界曹休",
  xin_lingtong: "界凌统",
  decadexuanfeng: "旋风",
  decadexuanfeng_info:
    "当你于弃牌阶段弃置过至少两张牌，或当你失去装备区里的牌后，若场上没有处于濒死状态的角色，则你可以弃置至多两名其他角色的共计两张牌。若此时处于你的回合内，你可以对其中一名目标角色造成1点伤害。",
  yongjin: "勇进",
  yongjin_info: "限定技，出牌阶段，你可以依次移动场上的至多三张不同的装备牌。",
  xin_liubiao: "界刘表",
  decadezishou: "自守",
  decadezishou_zhiheng: "自守",
  decadezishou_info:
    "摸牌阶段，你可以多摸X张牌,然后本回合你对其他角色造成伤害时，防止此伤害。结束阶段，若你本回合没有使用牌指定其他角色为目标，你可以弃置任意张花色不同的手牌，然后摸等量的牌。",
  decadezongshi: "宗室",
  decadezongshi_info:
    "锁定技，你的手牌上限+X（X为现存势力数）。你的回合外，若你的手牌数大于等于手牌上限，则当你成为延时类锦囊牌或无颜色的牌的目标后，你令此牌对你无效。",
  re_fazheng: "界法正",
  reenyuan: "恩怨",
  reenyuan1: "恩怨",
  reenyuan2: "恩怨",
  reenyuan_info:
    "当你获得一名其他角色的至少两张牌后，你可以令其摸一张牌。当你受到1点伤害后，你可令伤害来源选择一项：①失去1点体力。②交给你一张手牌。若此牌不为♥，则你摸一张牌。",
  rexuanhuo: "眩惑",
  rexuanhuo_info:
    "摸牌阶段结束时，你可以交给一名其他角色两张手牌，然后该角色选择一项：1. 视为对你选择的另一名角色使用任意一种【杀】或【决斗】，2. 交给你所有手牌。",
  re_fuhuanghou: "界伏寿",
  reqiuyuan: "求援",
  reqiuyuan_info:
    "当你成为【杀】的目标时，你可选择另一名其他角色。除非该角色交给你一张除【杀】以外的基本牌，否则其也成为此【杀】的目标且该角色不能响应此【杀】。",
  rezhuikong: "惴恐",
  rezhuikong_info:
    "其他角色的回合开始时，若你已受伤，你可与其拼点：若你赢，本回合该角色只能对自己使用牌；若你没赢，你获得其拼点的牌，然后其视为对你使用一张【杀】。",
  re_gongsunyuan: "界公孙渊",
  rehuaiyi: "怀异",
  rehuaiyi_info:
    "出牌阶段限一次，你可以展示所有手牌，若这些牌的颜色：全部相同，你摸一张牌，并将此技能于本阶段内改为“限两次”，然后终止此技能的结算流程；不全部相同，则你选择一种颜色并弃置该颜色的所有手牌，然后你可以获得至多X名角色的各一张牌（X为你以此法弃置的手牌数）。若你以此法获得的牌不少于两张，则你失去1点体力。",
  re_caozhen: "界曹真",
  residi: "司敌",
  residi_push: "司敌",
  residi2: "司敌",
  residi3: "司敌",
  residi_info:
    "结束阶段，你可以将一张非基本牌置于武将牌上，称为“司”。其他角色的出牌阶段开始时，你可以移去一张“司”。若如此做，其本阶段内不能使用或打出与“司”颜色相同的牌。此阶段结束时，若其于此阶段内未使用过：【杀】，你视为对其使用一张【杀】。锦囊牌，你摸两张牌。",
  gz_re_xushu: "徐庶",
  re_zhangchunhua: "界张春华",
  xin_handang: "界韩当",
  xingongji: "弓骑",
  xingongji2: "弓骑",
  xingongji_info:
    "出牌阶段限一次，你可以弃置一张牌，然后你的攻击范围视为无限且使用与此牌花色相同的【杀】无次数限制直到回合结束。若你以此法弃置的牌为装备牌，则你可以弃置一名其他角色的一张牌。",
  xinjiefan: "解烦",
  xinjiefan_info:
    "限定技，出牌阶段，你可以选择一名角色，令攻击范围内含有该角色的所有角色依次选择一项：1.弃置一张武器牌；2.令其摸一张牌。然后若游戏轮数为1，则你于此回合结束时恢复此技能。",
  gzquanji: "权计",
  gzquanji_info:
    "每回合每项各限一次。当你受到伤害后或造成伤害后，你可以摸一张牌，然后你将一张牌置于武将牌上，称为“权”；你的手牌上限+X（X为“权”的数量）。",
  gzpaiyi: "排异",
  gzpaiyi_backup: "排异",
  gzpaiyi_info:
    "出牌阶段限一次。你可以移去一张“权”并选择一名角色。令其摸X张牌（X为你的“权”数且至多为7）。然后若其手牌数大于你，则你对其造成1点伤害。",
  ol_zhurong: "界祝融",
  changbiao: "长标",
  changbiao_info:
    "出牌阶段限一次，你可以将任意张手牌当做【杀】使用（无距离限制）。若你因此【杀】对目标角色造成过伤害，则你于出牌阶段结束时摸X张牌（X为此【杀】对应的实体牌数量）。",
  re_zhoucang: "界周仓",
  rezhongyong: "忠勇",
  rezhongyong_info:
    "当你使用【杀】后，你可以将此【杀】以及目标角色使用的【闪】交给一名其他角色，若其获得的牌中有红色，则其可以对你攻击范围内的角色使用一张【杀】。若其获得的牌中有黑色，其摸一张牌。",
  ollihuo: "疠火",
  ollihuo2: "疠火",
  ollihuo3: "疠火",
  ollihuo4: "疠火",
  ollihuo_info:
    "你使用普通的【杀】可以改为火【杀】，若此【杀】造成过伤害，你失去1点体力；你使用火【杀】可以多选择一个目标。你每回合使用的第一张牌如果是【杀】，则此【杀】结算完毕后可置于你的武将牌上。",
  xinjiangchi: "将驰",
  xinjiangchi_info:
    "出牌阶段开始时，你可选择：①摸一张牌。②摸两张牌，然后本回合内不能使用或打出【杀】。③弃置一张牌，然后本回合内可以多使用一张【杀】，且使用【杀】无距离限制。",
  re_chenqun: "界陈群",
  redingpin: "定品",
  redingpin_info:
    "出牌阶段，你可以弃置一张本回合未使用过/弃置过的类型的牌并选择一名角色。其进行判定，若结果为：黑色，其摸X张牌（X为其体力值且至多为3）且本回合内不能再成为〖定品〗的目标；红桃，你令此次弃置的牌不计入〖定品〗弃置牌合法性的检测；方片，你将武将牌翻面。",
  refaen: "法恩",
  refaen_info: "一名角色翻至正面或横置后，你可令其摸一张牌。",
  reshizhi: "矢志",
  reshizhi_info:
    "锁定技，若你的体力值为1，则你的【闪】视为【杀】，且当你使用对应的实体牌为一张【闪】的非转化普通杀造成伤害后，你回复1点体力。",
  re_guotufengji: "界郭图逢纪",
  rejigong: "急攻",
  rejigong2: "急攻",
  rejigong_info:
    "出牌阶段开始时，你可以摸至多三张牌。若如此做，你本回合的手牌上限基数改为X，且弃牌阶段结束时，若X不小于Y，则你回复1点体力。（X为你本回合内造成的伤害值之和，Y为你本回合内因〖急攻〗摸牌而获得的牌的数量总和）",
  ol_jiangwei: "界姜维",
  oltiaoxin: "挑衅",
  oltiaoxin_info:
    "出牌阶段限一次，你可以选择一名攻击范围内包含你的角色。然后除非该角色对你使用一张【杀】且此【杀】对你造成伤害，否则你弃置其一张牌，然后将此技能于此出牌阶段内修改为出牌阶段限两次。 ",
  olzhiji: "志继",
  olzhiji_info:
    "觉醒技，准备阶段或结束阶段，若你没有手牌，你回复1点体力或摸两张牌，然后减1点体力上限，获得〖观星〗。",
  decadezhenjun: "镇军",
  decadezhenjun_info:
    "准备阶段或结束阶段，你可以弃置一名角色X张牌（X为其手牌数减体力值且至少为1），若其中没有装备牌，你选择一项：1.你弃一张牌；2.该角色摸等量的牌。",
  decadejingce: "精策",
  decadejingce_info:
    "结束阶段，若你本回合使用过的牌数不小于你的体力值，则你可执行一个摸牌阶段或出牌阶段；若这些牌包含的花色数也不小于你的体力值，则你将“或”改为“并”。",
  re_guanping: "界关平",
  relongyin: "龙吟",
  relongyin_info:
    "当一名角色于其出牌阶段使用【杀】时，你可弃置一张牌令此【杀】不计入出牌阶段使用次数。若此【杀】为红色，则你摸一张牌；若你以此法弃置的牌与此【杀】点数相同，则你重置“竭忠”。",
  jiezhong: "竭忠",
  jiezhong_info:
    "限定技，出牌阶段开始时，你可以将手牌补至手牌上限（至多摸五张）。",
  re_caifuren: "界蔡夫人",
  reqieting: "窃听",
  reqieting_info:
    "其他角色的回合结束时，若其本回合内未造成过伤害，则你可将其装备区内的一张牌置于你的装备区内；若其本回合内未对其他角色使用过牌，则你可摸一张牌。",
  rexianzhou: "献州",
  rexianzhou_info:
    "限定技。出牌阶段，你可将装备区内的所有牌交给一名其他角色。你回复X点体力，然后对其攻击范围内的至多X名角色各造成1点伤害（X为你以此法给出的牌数）。",
  xin_zhonghui: "界钟会",
  xinquanji: "权计",
  xinquanji_info:
    "①当你受到1点伤害后，或你的牌被其他角色获得后，你可以摸一张牌，然后将一张手牌置于武将牌上，称为“权”。②你的手牌上限+X（X为“权”的数量）。",
  xinzili: "自立",
  xinzili_info:
    "觉醒技。准备阶段，若你的“权”数大于2，则你回复1点体力并摸两张牌，减1点体力上限并获得〖排异〗。",
  xinpaiyi: "排异",
  xinpaiyi_backup: "排异",
  xinpaiyi_info:
    "出牌阶段每项各限一次，你可移去一张“权”并选择一项：①令一名角色摸X张牌。②对至多X名角色各造成1点伤害。（X为“权”数）",
  re_guyong: "界顾雍",
  reshenxing: "慎行",
  reshenxing_info:
    "出牌阶段，你可以弃置X张牌（X为你本阶段内发动过〖慎行〗的次数且至多为2），然后摸一张牌。",
  rebingyi: "秉壹",
  rebingyi_info:
    "结束阶段，你可展示所有手牌。若这些牌：颜色均相同，则你可以令至多X名角色各摸一张牌（X为你的手牌数）；点数均相同，则你摸一张牌。",
  re_jiaxu: "界贾诩",
  rewansha: "完杀",
  rewansha_info:
    "锁定技。①你的回合内，不处于濒死状态的角色不能使用【桃】。②当有角色于你的回合内进入濒死状态时，你令其以外的所有其他角色的非锁定技失效直到此濒死状态结算结束。",
  reluanwu: "乱武",
  reluanwu_info:
    "限定技，出牌阶段，你可令所有其他角色依次选择一项：①对距离最近（或之一）的角色使用一张【杀】；②失去1点体力。然后你摸X张牌（X为选择①和②的角色数中的最大值）。",
  reweimu: "帷幕",
  reweimu_info:
    "锁定技。①你不能成为黑色锦囊牌的目标。②当你于回合内受到伤害时，防止此伤害。",
  ol_lusu: "界鲁肃",
  olhaoshi: "好施",
  olhaoshi_info:
    "摸牌阶段开始时，你可以多摸两张牌。然后摸牌阶段结束时，若你的手牌数大于5，则你将手牌数的一半（向下取整）交给一名手牌最少其他角色并获得如下效果直到你下回合开始：当你成为【杀】或普通锦囊牌的目标后，其可以交给你一张手 牌。",
  oldimeng: "缔盟",
  oldimeng_info:
    "出牌阶段限一次，你可令两名满足X≤Y的其他角色交换手牌并获得如下效果：出牌阶段结束时，你弃置X张牌（X为这两名角色手牌数之差的绝对值；Y为你的手牌数）。",

  rejijiang: "激将",
  rejijiang1: "激将",
  rejijiang2: "激将",
  rejijiang_info:
    "主公技。①当你需要使用或打出【杀】时，你可以令其他蜀势力角色依次选择是否打出一张【杀】。若有角色响应，则你视为使用或打出了此【杀】。②每回合限一次。当有蜀势力角色于回合外使用或打出【杀】时，其可以令你摸一张牌。",
  xin_yufan: "界虞翻",
  xinzongxuan: "纵玄",
  xinzongxuan_info:
    "当你的牌因弃置而进入弃牌堆后，你可将其中的任意张牌置于牌堆顶。若剩余的牌中有锦囊牌，则你可以令一名其他角色获得其中的一张。",
  xinzhiyan: "直言",
  xinzhiyan_info:
    "结束阶段开始时，你可令一名角色摸一张牌（正面朝上移动）。若此牌为基本牌，则你摸一张牌。若此牌为装备牌，则其回复1点体力并使用此装备牌。",
  re_xiahoushi: "界夏侯氏",
  reqiaoshi: "樵拾",
  reqiaoshi_info:
    "其他角色的结束阶段开始时，若你的手牌数与其相等，则你可以与其各摸一张牌。若这两张牌花色相同，则你可以重复此步骤。",
  reyanyu: "燕语",
  reyanyu2: "燕语",
  reyanyu_info:
    "①出牌阶段，你可以重铸【杀】。②出牌阶段结束时，你可以令一名男性角色摸X张牌（X为你本阶段内发动过〖燕语①〗的次数且至多为3）。",
  rehujia: "护驾",
  rehujia_info:
    "主公技。①当你需要使用或打出一张【闪】时，你可以令其他魏势力角色选择是否打出一张【闪】。若有角色响应，则你视为使用或打出了一张【闪】。②每回合限一次。当有魏势力角色于回合外使用或打出【闪】时，其可以令你摸一张牌。",
  ol_xuhuang: "界徐晃",
  olduanliang: "断粮",
  olduanliang_info:
    "你可以将一张黑色非锦囊牌当做【兵粮寸断】使用。若你于当前回合内未造成过伤害，则你使用【兵粮寸断】无距离限制。",
  oljiezi: "截辎",
  oljiezi_info:
    "①当有角色跳过摸牌阶段后，你可选择一名角色。若该角色：手牌数为全场最少且没有“辎”，则其获得一枚“辎”。否则其摸一张牌。②一名角色的摸牌阶段结束时，若其有“辎”，则你移去其“辎”，然后令其获得一个额外的摸牌阶段。",
  re_madai: "界马岱",
  reqianxi: "潜袭",
  reqianxi_info:
    "准备阶段开始时，你可摸一张牌，然后弃置一张牌并选择一名距离为1的其他角色。该角色于本回合内：{不能使用或打出与此牌颜色相同的牌，且其装备区内与此牌颜色相同的防具牌无效，且当其回复体力时，你摸两张牌。}",
  re_guohuanghou: "界郭皇后",
  rejiaozhao: "矫诏",
  rejiaozhao_info:
    "出牌阶段限一次。你可以展示一张手牌，并令一名距离你最近的角色选择一种基本牌或普通锦囊牌的牌名。你可将此牌当做其声明的牌使用直到此阶段结束（你不是此牌的合法目标）。",
  rejiaozhao_lv2: "矫诏·升级 Lv.1",
  rejiaozhao_lv2_info:
    "出牌阶段限一次。你可以将一张手牌当做一张基本牌或普通锦囊牌使用（你不是此牌的合法目标）。",
  rejiaozhao_lv3: "矫诏·升级 Lv.2",
  rejiaozhao_lv3_info:
    "出牌阶段每种类型各限一次。你可以将一张手牌当做一张基本牌或普通锦囊牌使用。",
  redanxin: "殚心",
  redanxin_info: "当你受到伤害后，你可以摸一张牌并升级〖矫诏〗。",
  xin_wuguotai: "界吴国太",
  xinganlu: "甘露",
  xinganlu_info:
    "出牌阶段限一次。你可以令两名角色交换装备区内的牌，然后若这两名角色装备区内牌数差的绝对值大于你已损失的体力值，则你弃置两张手牌。",
  xinbuyi: "补益",
  xinbuyi_info:
    "一名角色进入濒死状态时，你可展示其一张手牌。若此牌不为基本牌，则其弃置此牌并回复1点体力。若其以此法弃置的牌移动前为其的唯一一张手牌，则其摸一张牌。",
  decadexianzhen: "陷阵",
  decadexianzhen2: "陷阵",
  decadexianzhen_info:
    "每回合限一次。出牌阶段，你可以和一名其他角色拼点。若你赢：本回合你无视该角色的防具，且对其使用牌没有次数和距离限制，且本回合对其使用牌造成伤害时，此伤害+1（每种牌名每回合限一次）；若你没赢：你本回合内不能使用【杀】，且【杀】不计入手牌上限。",
  decadejinjiu: "禁酒",
  decadejinjiu_info:
    "锁定技。你的【酒】的牌名均视为【杀】且点数视为K；你的回合内，其他角色不能使用【酒】。",
  dc_xushu: "界徐庶",
  rezhuhai: "诛害",
  rezhuhai_info:
    "其他角色的回合结束时，若其本回合内造成过伤害，则你可以选择一项：⒈将一张手牌当做【杀】对其使用。⒉视为对其使用一张【过河拆桥】。",
  xsqianxin: "潜心",
  xsqianxin_info:
    "觉醒技。当你造成伤害后，若你已受伤，则你减1点体力上限并获得〖荐言〗。",
  rejianyan: "荐言",
  rejianyan_info:
    "出牌阶段每项各限一次。你可选择一种颜色或一种牌的类别，然后系统从牌堆中检索出一张满足该条件的牌并展示之。然后你将此牌交给一名男性角色或Key势力角色。",
  re_zhanghe: "界张郃",
  reqiaobian: "巧变",
  reqiaobian_info:
    "①游戏开始时，你获得两枚“变”。②判定阶段开始时，你可弃置一张牌或一枚“变”并跳过此阶段。③摸牌阶段开始时，你可弃置一张牌或一枚“变”并跳过此阶段，然后可以获得至多两名其他角色的各一张手牌。④出牌阶段开始时，你可弃置一张牌或一枚“变”并跳过此阶段，然后你可以移动场上的一张牌。⑤弃牌阶段开始时，你可弃置一张牌或一枚“变”并跳过此阶段。⑥结束阶段，若你的〖巧变⑥〗记录中不包含你的手牌数，则你获得一枚“变”并记录你的手牌数。",
  olbeige: "悲歌",
  olbeige_info:
    "当有角色受到渠道为【杀】的伤害后，若你有牌，你可令其进行判定。然后你可弃置一张牌，根据判定结果执行以下的一个选项：♥，其回复1点体力；♦，其摸两张牌；♣，伤害来源弃置两张牌️；♠，伤害来源将武将牌翻面。若你弃置的牌与判定结果：点数相同，则你获得你弃置的牌；花色相同，则你获得判定牌。",
  dc_bulianshi: "界步练师",
  dcanxu: "安恤",
  dcanxu_info:
    "出牌阶段限一次，你可以选择两名手牌数不同的其他角色，令其中手牌少的角色获得手牌多的角色的一张手牌并展示之。然后若此牌不为黑桃，则你摸一张牌；若这两名角色手牌数相等，则你回复1点体力。",
  dczhuiyi: "追忆",
  dczhuiyi_info:
    "当你死亡时，你可以令一名不为击杀者的其他角色摸X张牌（X为存活角色数），然后其回复1点体力。",
  re_jushou: "界沮授",
  dcshibei: "矢北",
  dcshibei_info:
    "锁定技，当你于一回合内第一次受到伤害后，你回复1点体力；当你于一回合内第二次受到伤害后，你失去1点体力。",
  dcjianying: "渐营",
  dcjianying_info:
    "当你使用与你使用的上一张牌点数或花色相同的牌时，你可以摸一张牌。",
  re_duji: "界杜畿",
  reandong: "安东",
  reandong_info:
    "当你受到其他角色造成的伤害时，你可以令伤害来源选择一项：⒈防止此伤害。然后其♥牌不计入本回合的手牌上限；⒉你观看其手牌并获得其中的所有♥牌，若其没有手牌，则你下次发动〖安东〗时改为自行选择。",
  reyingshi: "应势",
  reyingshi_info:
    "出牌阶段开始时，你可以展示一张手牌，选择一名角色A和一名其他角色B。A可以对B使用一张【杀】，然后获得你展示的牌。若A因此【杀】造成过伤害，则A获得牌堆中与展示牌花色点数相同的其他牌。",
  dcqiaomeng: "趫猛",
  dcqiaomeng_info:
    "当你使用黑色牌指定第一个目标后，你可以弃置目标角色中一名其他角色的一张牌。若你以此法弃置的牌为：装备牌，你获得此牌；锦囊牌，你令此牌不可被响应。",
  dc_gongsunzan: "界公孙瓒",
  re_liuchen: "界刘谌",
  rezhanjue: "战绝",
  rezhanjue_effect: "战绝",
  rezhanjue_info:
    "出牌阶段，若你本阶段内因〖战绝〗获得过的牌数小于3，则你可以将所有不具有“勤王”标记的手牌当做【决斗】使用。此【决斗】使用结算结束后，你摸一张牌。然后所有因此【决斗】受到过伤害的角色也各摸一张牌。",
  reqinwang: "勤王",
  reqinwang_info:
    "主公技。出牌阶段限一次，你可以令所有其他蜀势力角色依次选择是否交给你一张【杀】，然后你可以令选择是的角色摸一张牌。",
  shizhan: "势斩",
  shizhan_info:
    "出牌阶段限两次，你可以选择一名其他角色。该角色视为对你使用一张【决斗】。",
  ol_xunyu: "界荀彧",
  oljieming: "节命",
  oljieming_info:
    "当你受到1点伤害后或死亡后，你可令一名角色摸X张牌。然后若其手牌数大于X，则其将手牌弃置至X张（X为其体力上限且至多为5）。",
  re_liufeng: "界刘封",
  rexiansi: "陷嗣",
  rexiansi2: "陷嗣",
  rexiansi_info:
    "①准备阶段开始时，你可以将一至两名角色的各一张牌置于你的武将牌上，称为“逆”。②当一名角色需要对你使用【杀】时，其可以移去两张“逆”，然后视为对你使用一张【杀】。③若你的“逆”数大于体力值，则你可以移去一张“逆”并视为使用一张【杀】。",
  re_sp_taishici: "界SP太史慈",
  re_sp_taishici_ab: "太史慈",
  rejixu: "击虚",
  rejixu_info:
    "出牌阶段限一次。若你有手牌，则你可以选择至多X名角色，令这些角色猜测你的手牌区中是否有【杀】。若你：有【杀】，则你本阶段使用【杀】的次数上限+Y，且当你于本阶段内使用【杀】指定目标后，你可以令这Y名角色也成为此【杀】的目标；没有【杀】，则你弃置这Y名角色的各一张牌。然后你摸Y张牌（X为你的体力值，Y为这些角色中猜错的角色数）。",

  refresh_standard: "界限突破·标",
  refresh_feng: "界限突破·风",
  refresh_huo: "界限突破·火",
  refresh_lin: "界限突破·林",
  refresh_shan: "界限突破·山",
  refresh_yijiang1: "界限突破·将1",
  refresh_yijiang2: "界限突破·将2",
  refresh_yijiang3: "界限突破·将3",
  refresh_yijiang4: "界限突破·将4",
  refresh_yijiang5: "界限突破·将5",
  refresh_yijiang6: "界限突破·原6",
  refresh_xinghuo: "界限突破·星火",
};
export const translate_sb = {
  sp_yangwan: "手杀杨婉",
  spmingxuan: "瞑昡",
  spmingxuan_info:
    "锁定技。出牌阶段开始时，你须选择至多X张花色各不相同的手牌（X为未选择过选项一的角色），将这些牌随机交给这些角色中的等量角色。然后这些角色依次选择一项：⒈对你使用一张【杀】。⒉交给你一张牌，然后你摸一张牌。",
  spxianchou: "陷仇",
  spxianchou_info:
    "当你受到有来源的伤害后，你可选择一名不为伤害来源的其他角色。该角色可以弃置一张牌，然后视为对伤害来源使用一张【杀】（无距离限制）。若其因此【杀】造成了伤害，则其摸一张牌，你回复1点体力。",
  liucheng: "刘赪",
  splveying: "掠影",
  splveying_info:
    "锁定技。①每回合限两次，当你使用【杀】指定目标后，你获得一个“椎”。②当你使用的【杀】结算结束后，若你的“椎”数大于1，则你弃置两个“椎”，然后弃置所有目标角色的各一张手牌。",
  spyingwu: "莺舞",
  spyingwu_info:
    "若你拥有〖掠影〗，则：①每回合限两次，当你使用非伤害类普通锦囊牌指定目标后，你获得一个“椎”。②当你使用的非伤害类普通锦囊牌结算结束后，若你的“椎”数大于1，则你弃置两个“椎”，然后可以视为使用一张【杀】。",
  sb_huangzhong: "谋黄忠",
  sbliegong: "烈弓",
  sbliegong_info:
    "①若你的装备区内没有武器牌，则你手牌区内所有【杀】的属性视为无属性。②当你使用牌时，或成为其他角色使用牌的目标后，你记录此牌的花色。③当你使用【杀】指定唯一目标后，若你〖烈弓②〗的记录不为空，则你可亮出牌堆顶的X张牌（X为你〖烈弓②〗记录过的花色数-1），令此【杀】的伤害值基数+Y（Y为亮出牌中被〖烈弓②〗记录过花色的牌的数量），且目标角色不能使用〖烈弓②〗记录过花色的牌响应此【杀】。此【杀】使用结算结束后，你清除〖烈弓②〗的记录。",
  sb_huaxiong: "谋华雄",
  sbyangwei: "扬威",
  sbyangwei_info:
    "出牌阶段，你可以摸两张牌，令此技能于你的下下个结束阶段前失效，且你获得如下效果直到回合结束：使用【杀】无距离限制，次数上限+1且无视防具。",
  sb_yujin: "谋于禁",
  sbxiayuan: "狭援",
  sbxiayuan_info:
    "每轮限一次。其他角色受到伤害后，若其因此伤害触发过护甲效果且其没有护甲，则你可弃置两张手牌，令其获得X点护甲（X为其因此伤害触发护甲效果而失去的护甲数量）。",
  sbjieyue: "节钺",
  sbjieyue_info:
    "结束阶段，你可以令一名其他角色获得1点护甲。然后其可以交给你一张牌。",
};
export const translate_shenhua = {
  re_yuanshao: "袁绍",
  re_lusu: "鲁肃",
  re_yuji: "于吉",
  wangji: "王基",
  kuailiangkuaiyue: "蒯良蒯越",
  sunliang: "孙亮",
  yl_luzhi: "卢植",
  xuyou: "许攸",
  luji: "陆绩",
  wangping: "王平",
  yanyan: "严颜",

  zhugezhan: "诸葛瞻",
  lukang: "陆抗",
  haozhao: "郝昭",
  yl_yuanshu: "袁术",
  zhangxiu: "张绣",
  chendao: "陈到",
  guanqiujian: "毌丘俭",
  zhoufei: "周妃",

  nzry_jianxiang: "荐降",
  nzry_jianxiang_info:
    "当你成为其他角色使用牌的目标时，你可令手牌数最少的一名角色摸一张牌。",
  nzry_shenshi1: "审时",
  nzry_shenshi: "审时",
  nzry_shenshi_info:
    "转换技，阴：出牌阶段限一次，你可以将一张牌交给一名手牌数最多的角色，然后对其造成一点伤害，若该角色因此死亡，则你可以令一名角色将手牌摸至四张。阳：其他角色对你造成伤害后，你可以观看该角色的手牌，然后交给其一张牌，当前角色回合结束时，若此牌仍在该角色的区域内，你将手牌摸至四张。",
  nzry_mingren: "明任",
  nzry_mingren_info:
    "游戏开始时，你摸两张牌，然后将一张手牌置于你的武将牌上，称为“任”。结束阶段，你可以用一张手牌替换“任”。",
  nzry_zhenliang: "贞良",
  nzry_zhenliang_info:
    "转换技，阴：出牌阶段限一次，你可以弃置一张与“任”颜色相同的牌并对攻击范围内的一名角色造成1点伤害。阳：当你于回合外使用或打出的牌结算完成后，若此牌与“任”颜色相同，则你可以令一名角色摸一张牌。",
  nzry_chenglve1: "成略",
  nzry_chenglve: "成略",
  nzry_chenglve_info:
    "转换技，出牌阶段限一次，阴：你可以摸一张牌，然后弃置两张手牌。阳：你可以摸两张牌，然后弃置一张手牌。若如此做，直到本回合结束，你使用与弃置牌花色相同的牌无距离和次数限制。",
  nzry_shicai: "恃才",
  nzry_shicai_info:
    "当你使用牌时，若此牌与你本回合使用的牌类型均不同（包括装备牌），则你可以将此牌置于牌堆顶，然后摸一张牌。",
  nzry_cunmu: "寸目",
  nzry_cunmu_info: "锁定技，当你摸牌时，改为从牌堆底摸牌。",
  nzry_kuizhu: "溃诛",
  nzry_kuizhu_info:
    "弃牌阶段结束后，你可以选择一项：①令至多X名角色各摸一张牌。②对任意名体力值之和为X的角色造成一点伤害。（X为你此阶段弃置的牌数）",
  nzry_zhizheng: "掣政",
  rechezheng: "掣政",
  nzry_zhizheng_info:
    "锁定技，你的出牌阶段内，当你对攻击范围内不包含你的其他角色造成伤害时，防止此伤害。出牌阶段结束时，若你本阶段内使用的牌数小于这些角色的数量，则你弃置其中一名角色的一张牌。",
  nzry_lijun1: "立军",
  nzry_lijun: "立军",
  nzry_lijun_info:
    "主公技，其他吴势力角色的出牌阶段限一次，其使用【杀】结算后，可以将此【杀】对应的实体牌交给你，然后你可以令其摸一张牌且本阶段内使用【杀】的次数上限+1。",
  nzry_huaiju: "怀橘",
  nzry_huaiju_info:
    "锁定技，游戏开始时，你获得3个“橘”标记。（有“橘”的角色受到伤害时，防止此伤害，然后移去一个“橘”；有“橘”的角色摸牌阶段额外摸一张牌）",
  tachibana_effect: "怀橘",
  nzry_yili: "遗礼",
  nzry_yili_info:
    "出牌阶段开始时，你可以失去一点体力或移去一个“橘”，然后令一名其他角色获得一个“橘”",
  nzry_zhenglun: "整论",
  nzry_zhenglun_info: "若你没有“橘”，你可以跳过摸牌阶段然后获得一个“橘”",
  nzry_feijun: "飞军",
  nzry_feijun_info:
    "出牌阶段限一次。你可以弃置一张牌，然后选择一项：⒈令一名手牌数大于你的角色交给你一张牌；⒉令一名装备区里牌数大于你的角色弃置一张装备牌。",
  nzry_binglve: "兵略",
  nzry_binglve_info:
    "锁定技，当你发动“飞军”时，若目标与你之前指定的目标均不相同，则你摸两张牌",
  nzry_juzhan1: "拒战",
  nzry_juzhan: "拒战",
  nzry_juzhan_info:
    "转换技，阴：当你成为其他角色【杀】的目标后，你可以与其各摸一张牌，然后其本回合内不能再对你使用牌。阳：当你使用【杀】指定一名角色为目标后，你可以获得其一张牌，然后你本回合内不能再对其使用牌。",

  liangyin: "良姻",
  liangyin_info:
    "当有牌移至游戏外时，你可以令手牌数大于你的一名角色摸一张牌；当有牌从游戏外加入任意角色的手牌时，你可以令手牌数小于你的一名角色弃置一张牌",
  kongsheng: "箜声",
  kongsheng_info:
    "准备阶段，你可以将任意张牌置于你的武将牌上；结束阶段，你使用武将牌上的装备牌，并获得武将牌上的其他牌",
  kongsheng2: "箜声",
  kongsheng2_info: "",
  xinfu_zuilun: "罪论",
  xinfu_zuilun_info:
    "结束阶段，你可以观看牌堆顶三张牌，你每满足以下一项便保留一张，然后以任意顺序放回其余的牌：1.你于此回合内造成过伤害；2.你于此回合内未弃置过牌；3.手牌数为全场最少。若均不满足，你与一名其他角色失去一点体力。",
  xinfu_fuyin: "父荫",
  xinfu_fuyin_info:
    "锁定技，你每回合第一次成为【杀】或【决斗】的目标后，若你的手牌数小于等于该角色，此牌对你无效。",
  drlt_wanglie: "往烈",
  drlt_wanglie_info:
    "出牌阶段，你使用的第一张牌无距离限制；当你于回合内使用牌时，你可以令此牌不能被响应，若如此做，本回合内你不能再使用牌",
  drlt_xiongluan: "雄乱",
  drlt_xiongluan_info:
    "限定技，出牌阶段，你可以废除你的判定区和装备区，然后指定一名其他角色。直到回合结束，你对其使用牌无距离和次数限制，其不能使用和打出手牌",
  drlt_congjian: "从谏",
  drlt_congjian_info:
    "当你成为锦囊牌的目标时，若此牌的目标数大于1，则你可以交给其中一名其他目标角色一张牌，然后摸一张牌，若你给出的是装备牌，改为摸两张牌",
  drlt_yongsi: "庸肆",
  drlt_yongsi_info:
    "锁定技，摸牌阶段，你改为摸X张牌（X为存活势力数）；出牌阶段结束时，若你本回合：1.没有造成伤害，将手牌摸至当前体力值；2.造成的伤害超过1点，本回合手牌上限改为已损失体力值",
  drlt_weidi: "伪帝",
  drlt_weidi_info:
    "主公技，弃牌阶段开始时，若你的手牌数大于手牌上限，则你可以将至多X张手牌分别交给等量的其他群雄角色（X为你的手牌数与手牌上限之差）。",
  drlt_qianjie: "谦节",
  drlt_qianjie_info:
    "锁定技，当你横置时，取消之。你不能成为延时类锦囊的目标。你不能成为其他角色拼点的目标。",
  drlt_jueyan: "决堰",
  drlt_jueyan_info:
    "出牌阶段限一次，你可以废除一个装备栏，然后执行对应一项：武器栏，本回合内你可以多使用三张【杀】；防具栏，摸三张牌，本回合手牌上限+3；2个坐骑栏，本回合你使用的牌无距离限制；宝物栏，本回合获得技能集智",
  drlt_poshi: "破势",
  drlt_poshi_info:
    "觉醒技，准备阶段开始时，若你的装备栏均已被废除或体力值为1，则你减一点体力上限，将手牌摸至体力上限，失去技能“决堰”并获得技能“怀柔”",
  drlt_huairou: "怀柔",
  drlt_huairou_info: "出牌阶段，你可以重铸装备牌",
  drlt_zhenggu: "镇骨",
  drlt_zhenggu2: "镇骨",
  drlt_zhenggu_info:
    "结束阶段，你可以选择一名其他角色，你的回合结束后和该角色的下个回合结束时，其将手牌摸至或弃至X张。（X为你的手牌数且至多为5）",
  drlt_zhenrong: "徵荣",
  drlt_zhenrong_info:
    "当你对其他角色造成伤害后，若其手牌比你多，你可以将其一张牌置于你的武将牌上，称为“荣”",
  drlt_hongju: "鸿举",
  drlt_hongju_info:
    "觉醒技，准备阶段，若“荣”的数量大于或等于3且场上有角色死亡，则你可以用任意张手牌替换等量的“荣”，然后扣减一点体力上限并获得技能“清侧”",
  drlt_qingce: "清侧",
  drlt_qingce_info:
    "出牌阶段，你可以移去一张“荣”，然后弃置一名角色装备区或判定区内的一张牌。",

  zhengrong: "征荣",
  hongju: "鸿举",
  qingce: "清侧",
  qingce_backup: "清侧",
  zhengrong_info:
    "当你使用带有「伤害」标签的基本牌或锦囊牌指定目标后，你可以将一名手牌数不小于你的目标角色的一张牌置于你的武将牌上，称为「荣」。",
  hongju_info:
    "觉醒技，准备阶段，若你武将牌上「荣」的数量不小于3，则你触发此技能。你可以用任意数量的手牌交换等量的「荣」。你减1点体力上限并获得技能〖清侧〗。",
  qingce_info:
    "出牌阶段，你可以获得一张「荣」并弃置一张手牌，然后弃置场上的一张牌。",

  jianchu: "鞬出",
  jianchu_info:
    "当你使用【杀】指定一名角色为目标后，你可以弃置其一张牌，若以此法弃置的牌为装备牌，此【杀】不可被【闪】响应，若不为装备牌，该角色获得此【杀】",
  redimeng: "缔盟",
  redimeng_info:
    "出牌阶段限一次，你可以弃置X张牌选择两名其他角色（X为这两名角色的手牌差），你混合他们的手牌，然后令其中一名角色获得其中的一张牌，并令另一名角色获得其中的一张牌，然后重复此流程，直到这些牌均被获得为止",
  reluanji: "乱击",
  reluanji_info:
    "你可以将两张与你本回合以此法转化的花色均不相同的手牌当【万箭齐发】使用，然后当一名角色因响应此牌而打出【闪】时，该角色摸一张牌。若你以此法使用的【万箭齐发】未造成伤害，则你可以在此牌结算完成后摸X张牌。(X为此牌的目标数)",
  xintianxiang: "天香",
  xintianxiang2: "天香",
  xintianxiang3: "天香",
  xintianxiang4: "天香",
  xintianxiang_bg: "香",
  xintianxiang_info:
    "当你受到伤害时，你可以弃置一张♥牌，将此伤害转移给一名其他角色，然后你选择一项：令该角色摸X张牌（X为其已损失的体力值）；或防止其造成与受到的所有伤害，且此技能失效直到你的下回合开始",
  xinshensu: "神速",
  xinshensu_info:
    "你可以选择一至三项：1. 跳过判定阶段和摸牌阶段；2. 跳过出牌阶段并弃置一张装备牌；3. 跳过弃牌阶段并将你的武将牌翻面。你每选择一项，视为你对一名其他角色使用一张没有距离限制的【杀】",
  yinghun: "英魂",
  yinghun_info:
    "准备阶段开始时，你可令一名其他角色执行一项：摸X张牌，然后弃置一张牌；或摸一张牌，然后弃置X张牌（X为你已损失的体力值）",
  gzyinghun: "英魂",
  gzyinghun_info:
    "准备阶段开始时，若你已受伤，你可令一名其他角色执行一项：摸X张牌，然后弃置一张牌；或摸一张牌，然后弃置X张牌（X为你已损失的体力值）",

  tiaoxin: "挑衅",
  zhiji: "志继",
  zhiji_draw: "摸牌",
  zhiji_recover: "回血",
  xiangle: "享乐",
  fangquan: "放权",
  ruoyu: "若愚",
  qiaobian: "巧变",
  qiaobian1: "巧变·判定",
  qiaobian2: "巧变·摸牌",
  qiaobian3: "巧变·出牌",
  qiaobian4: "巧变·弃牌",
  tuntian: "屯田",
  tuntian_bg: "田",
  zaoxian: "凿险",
  jixi: "急袭",
  jiang: "激昂",
  hunzi: "魂姿",
  zhiba: "制霸",
  zhiba2: "制霸",
  zhijian: "直谏",
  guzheng: "固政",
  beige: "悲歌",
  duanchang: "断肠",
  // fushen:'附身',
  huashen: "化身",
  huashen1: "化身",
  huashen2: "化身",
  xinsheng: "新生",
  qimou: "奇谋",
  xinqiangxi: "强袭",
  xinjushou: "据守",
  xinjiewei: "解围",
  retianxiang: "天香",
  retianxiang_info:
    "当你受到伤害时，你可以弃置一张红桃手牌，防止此次伤害并选择一名其他角色，然后你选择一项：1.令其受到伤害来源对其造成的1点伤害，然后摸X张牌（X为其已损失体力值且至多为5）；2.令其失去1点体力，然后获得你弃置的牌。",
  xinjiewei_info:
    "你可以将装备区里的牌当【无懈可击】使用；当你的武将牌从背面翻至正面时，你可以弃置一张牌，然后移动场上的一张牌",
  xinjushou_info:
    "结束阶段，你可以翻面并摸四张牌，然后弃置一张手牌，若以此法弃置的是装备牌，则你改为使用之",
  jixi_info: "出牌阶段，你可以将任意一张【田】当作【顺手牵羊】使用",
  xinqiangxi_info:
    "出牌阶段各限一次，你可以选择一项：1. 失去一点体力并对你攻击范围内的一名其他角色造成一点伤害；2. 弃置一张装备牌并对你攻击范围内的一名其他角色造成一点伤害 ",
  qimou_info:
    "限定技，出牌阶段，你可以失去任意点体力，然后直到回合结束，你计算与其他角色的距离时-X，且你可以多使用X张【杀】（X为你失去的体力值）",
  tiaoxin_info:
    "出牌阶段限一次，你可以指定一名攻击范围内包含你的角色，该角色需对你使用一张【杀】，否则你弃置其一张牌。",
  zhiji_info:
    "觉醒技，准备阶段，若你没有手牌，你须回复1点体力或摸两张牌，然后减1点体力上限，并获得技能〖观星〗。",
  xiangle_info:
    "锁定技，当其他角色使用【杀】指定你为目标时，其需弃置一张基本牌，否则此【杀】对你无效。",
  fangquan_info:
    "你可跳过你的出牌阶段，若如此做，回合结束时，你可以弃置一张手牌并令一名其他角色进行一个额外的回合。",
  ruoyu_info:
    "主公技，觉醒技，准备阶段，若你的体力是全场最少的(或之一)，你须增加1点体力上限并回复1点体力，然后获得技能〖激将〗。",
  qiaobian_info:
    "你可以弃置一张手牌并跳过自己的一个阶段(准备阶段和结束阶段除外)；若你以此法跳过了摸牌阶段，则你可以获得至多两名其他角色的各一张手牌；若你以此法跳过了出牌阶段，则你可以移动场上的一张牌。",
  tuntian_info:
    "当你于回合外失去牌时，你可以进行一次判定。若判定结果不为♥，则你将此牌置于你的武将牌上，称之为【田】。锁定技，你计算与其他角色的距离时-X（X为你武将牌上【田】的数目）",
  zaoxian_info:
    "觉醒技，准备阶段，若你武将牌上【田】的数量达到3张或更多，则你减1点体力上限，并获得技能〖急袭〗",
  jiang_info:
    "每当你使用（指定目标后）或被使用（成为目标后）一张【决斗】或红色的【杀】时，你可以摸一张牌。",
  hunzi_info:
    "觉醒技，准备阶段，若你的体力值为1，你减1点体力上限，并获得技能〖英姿〗和〖英魂〗。",
  zhiba_info:
    "主公技，其他吴势力角色的出牌阶段限一次，其可与你进行一次拼点。若该角色没赢，你可以获得双方拼点的牌；你的觉醒技发动后，你可以拒绝此拼点。",
  zhijian_info:
    "出牌阶段，你可以将手牌中的一张装备牌置于一名其他角色装备区里（不得替换原装备），然后摸一张牌。",
  guzheng_info:
    "其他角色的弃牌阶段结束时，你可以令其获得本阶段内进入弃牌堆的牌中的一张，然后你获得其余的牌。",
  beige_info:
    "当有角色受到【杀】造成的伤害后，你可以弃一张牌，并令其进行一次判定，若判定结果为：♥该角色回复1点体力；♦︎该角色摸两张牌；♣伤害来源弃两张牌；♠伤害来源将其武将牌翻面",
  duanchang_info: "锁定技，杀死你的角色失去当前的所有技能。",
  // fushen_info:'回合开始前，你可以选择与任意一名角色交换控制权，该角色可选择在下一个回合开始前与你换回',
  huashen_info:
    "所有人都展示武将牌后，你随机获得两张未加入游戏的武将牌，选一张置于你面前并声明该武将的一项技能，你拥有该技能且同时将性别和势力属性变成与该武将相同直到该化身被替换。在你的每个准备阶段和结束后，你可以替换化身牌，你须为新的化身重新声明一项技能（你不可声明限定技、觉醒技、隐匿技、使命技、主公技等特殊技能）。",
  xinsheng_info: "每当你受到1点伤害后，你可获得一张新的化身牌。",
  jiangwei: "姜维",
  liushan: "刘禅",
  zhanghe: "张郃",
  dengai: "邓艾",
  sunce: "孙策",
  zhangzhang: "张昭张紘",
  caiwenji: "蔡琰",
  zuoci: "左慈",

  zhurong: "祝融",
  menghuo: "孟获",
  caopi: "曹丕",
  re_xuhuang: "徐晃",
  lusu: "旧鲁肃",
  sunjian: "孙坚",
  dongzhuo: "董卓",
  jiaxu: "贾诩",
  huoshou: "祸首",
  huoshou1: "祸首",
  huoshou2: "祸首",
  zaiqi: "再起",
  zaiqixx: "再起",
  juxiang: "巨象",
  juxiang1: "巨象",
  juxiang2: "巨象",
  lieren: "烈刃",
  xingshang: "行殇",
  fangzhu: "放逐",
  songwei: "颂威",
  songwei2: "颂威",
  duanliang: "断粮",
  duanliang1: "断粮",
  haoshi: "好施",
  dimeng: "缔盟",
  jiuchi: "酒池",
  roulin: "肉林",
  benghuai: "崩坏",
  baonue: "暴虐",
  baonue2: "暴虐",
  baonue_hp: "体力",
  baonue_maxHp: "体力上限",
  luanwu: "乱武",
  wansha: "完杀",
  weimu: "帷幕",
  jiezi: "截辎",
  jiezi_info: "锁定技，其他角色跳过摸牌阶段后，你摸一张牌。",
  huoshou_info:
    "锁定技，【南蛮入侵】对你无效；你视为所有【南蛮入侵】的伤害来源。",
  zaiqi_info:
    "摸牌阶段，若你已受伤，则你可以改为展示牌堆顶的X张牌（X为你已损失的体力值），并回复X点体力（X为其中♥牌的数目）。然后你将这些♥牌置入弃牌堆，并获得其余的牌。",
  zaiqixx_info:
    "摸牌阶段，若你已受伤，则你可以改为展示牌堆顶的X张牌（X为你已损失的体力值+1），并回复X点体力（X为其中♥牌的数目）。然后你将这些♥牌置入弃牌堆，并获得其余的牌。",
  juxiang_info:
    "锁定技。①【南蛮入侵】对你无效。②其他角色使用的【南蛮入侵】结算结束后，你获得此牌对应的所有实体牌。",
  lieren_info:
    "当你使用【杀】造成伤害后，可与受到该伤害的角色进行拼点；若你赢，你获得对方的一张牌。",
  xingshang_info: "当有角色死亡后，你可以获得该角色的所有牌。",
  fangzhu_info:
    "当你受到伤害后，你可令一名其他角色摸X张牌（X为你已损失的体力值），然后该角色将武将牌翻面。",
  songwei_info:
    "主公技，其他魏势力的角色的判定牌结果为黑色且生效后，其可以令你摸一张牌。",
  duanliang_info:
    "你可以将一张黑色基本牌或装备牌当做【兵粮寸断】使用；若一名角色的手牌数大于或等于你的手牌数，则你对其使用【兵粮寸断】没有距离限制。",
  haoshi_info:
    "摸牌阶段，你可以额外摸两张牌。若此时你的手牌数多于五张，你须将一半(向下取整)的手牌交给场上除你外手牌数最少的一名角色。",
  dimeng_info:
    "出牌阶段限一次，你可以选择其他两名角色，你弃置等同于这两名角色手牌数量之差的牌，然后交换他们的手牌。",
  yinghun_old_info:
    "准备阶段，若你已受伤，则你可以令一名其他角色执行下列两项中的一项： 1.摸X张牌，然后弃一张牌。 2.摸一张牌，然后弃X张牌。 （X为你已损失的体力值）",
  jiuchi_info: "你可以将一张♠手牌当作【酒】使用。",
  roulin_info:
    "锁定技。你对女性角色、女性角色对你使用【杀】时，都需连续使用两张【闪】才能抵消。",
  benghuai_info:
    "结束阶段，若你的体力不是全场最少的(或之一)，你须减1点体力或体力上限。",
  baonue_info:
    "主公技，其他群雄角色造成伤害后，可进行一次判定，若为♠，你回复1点体力。",
  luanwu_info:
    "限定技，出牌阶段，你可令除你外的所有角色依次对与其距离最近的另一名角色使用一张【杀】，否则失去1点体力。",
  wansha_info:
    "锁定技，你的回合内，除你以外，不处于濒死状态的角色不能使用【桃】。",
  weimu_info: "锁定技，你不能成为黑色锦囊牌的目标。",

  sp_zhugeliang: "卧龙",
  pangtong: "庞统",
  xunyu: "荀彧",
  dianwei: "典韦",
  taishici: "太史慈",
  yanwen: "颜良文丑",
  yuanshao: "旧袁绍",
  re_pangde: "庞德",
  huoji: "火计",
  bazhen: "八阵",
  kanpo: "看破",
  xinlianhuan: "连环",
  ollianhuan: "连环",
  lianhuan: "连环",
  lianhuan1: "连环",
  lianhuan3: "连环",
  lianhuan2: "连铸",
  lianhuan5: "连铸",
  ollianhuan3: "连环",
  niepan: "涅槃",
  oldniepan: "涅槃",
  quhu: "驱虎",
  jieming: "节命",
  qiangxix: "强袭",
  qiangxi: "强袭",
  tianyi: "天义",
  shuangxiong: "双雄",
  shuangxiong2: "双雄",
  luanji: "乱击",
  xueyi: "血裔",
  mengjin: "猛进",
  xinlianhuan_info:
    " 你可以将一张♣手牌当【铁索连环】使用或重铸。你使用【铁索连环】选择目标的上限数+1。",
  ollianhuan_info:
    " 你可以将一张♣牌当【铁索连环】使用或重铸。你使用【铁索连环】选择目标的上限数+1。",
  huoji_info: "出牌阶段，你可以将你的任意一张红色手牌当作【火攻】使用。",
  bazhen_info:
    "锁定技，若你的防具栏内没有牌且没有被废除，则你视为装备着【八卦阵】。",
  kanpo_info: "你可以将你的任意一张黑色手牌当做【无懈可击】使用。",
  lianhuan_info: "出牌阶段，你可以将一张梅花手牌当做【铁索连环】使用或重铸。",
  niepan_info:
    "限定技，出牌阶段或当你处于濒死状态时，你可以弃置你区域内的所有牌并复原你的武将牌，然后摸三张牌并将体力回复至3点。",
  oldniepan_info:
    "限定技，当你处于濒死状态时，你可以弃置你区域内的所有牌并复原你的武将牌，然后摸三张牌并将体力回复至3点。",
  quhu_info:
    "出牌阶段限一次，你可以与一名体力值大于你的角色拼点，若你赢，则该角色对其攻击范围内另一名由你指定的角色造成1点伤害。若你没赢，该角色对你造成一点伤害。",
  jieming_info:
    "当你受到1点伤害后，你可令一名角色将手牌摸至X张（X为其体力上限且至多为5）。",
  qiangxi_info:
    "出牌阶段限一次，你可以失去一点体力或弃置一张武器牌，然后对你攻击范围内的一名其他角色造成一点伤害。",
  qiangxix_info:
    "出牌阶段限两次，你可以失去一点体力或弃置一张武器牌，然后一名本阶段内未成为过〖强袭〗的目标的其他角色造成一点伤害。",
  tianyi_info:
    "出牌阶段限一次，你可以和一名其他角色拼点。若你赢，你获得以下技能效果直到回合结束：你使用【杀】没有距离限制；可额外使用一张【杀】；使用【杀】时可额外指定一个目标。若你没赢，你不能使用【杀】直到回合结束。",
  shuangxiong_info:
    "摸牌阶段，你可以改为进行一次判定：你获得此判定牌，且你可以于此回合内将任意一张与此判定牌不同颜色的手牌当做【决斗】使用。",
  luanji_info: "出牌阶段，你可以将任意两张相同花色的手牌当做【万箭齐发】使用。",
  xueyi_info:
    "主公技，锁定技，场上每有一名其他群雄角色存活，你的手牌上限便+2。",
  mengjin_info: "当你使用的【杀】被【闪】抵消时，你可以弃置目标角色的一张牌。",

  re_xiahouyuan: "夏侯渊",
  re_huangzhong: "界黄忠",
  re_weiyan: "魏延",
  re_xiaoqiao: "小乔",

  gz_xiahouyuan: "夏侯渊",
  gz_huangzhong: "黄忠",
  gz_weiyan: "魏延",
  gz_xiaoqiao: "小乔",
  gz_xuhuang: "徐晃",
  gz_pangde: "庞德",
  gz_caoren: "曹仁",
  gz_zhoutai: "周泰",

  old_zhoutai: "周泰",
  old_caoren: "曹仁",
  xuhuang: "旧徐晃",
  pangde: "旧庞德",
  xiahouyuan: "旧夏侯渊",
  caoren: "界曹仁",
  huangzhong: "黄忠",
  sp_zhangjiao: "张角",
  weiyan: "旧魏延",
  xiaoqiao: "旧小乔",
  zhoutai: "界周泰",
  zhangjiao: "张角",
  shensu: "神速",
  shensu1: "神速",
  shensu2: "神速",
  shensu4: "神速",
  jushou: "据守",
  moon_jushou: "据守",
  liegong: "烈弓",
  kuanggu: "狂骨",
  tianxiang: "天香",
  hongyan: "红颜",
  buqu: "不屈",
  buqu_bg: "创",
  leiji: "雷击",
  guidao: "鬼道",
  huangtian: "黄天",
  huangtian2: "黄天",
  guhuo: "蛊惑",
  fenji: "奋激",
  releiji: "雷击",
  jiewei: "解围",
  tiangong: "天公",
  tiangong2: "天公",
  xinliegong: "烈弓",
  xinkuanggu: "狂骨",
  gzbuqu: "不屈",
  gzbuqu_info:
    "①当你扣减1点体力时，若你的体力值小于1，则你将牌堆顶的一张牌置于你的武将牌上，称为“创”。②当你回复1点体力时，你移去一张“创”。③若你有“创”且点数均不相同，则你不结算濒死状态。",
  xinkuanggu_info:
    "当你对距离1以内的一名角色造成1点伤害后，你可以回复1点体力或摸一张牌。",
  xinliegong_info:
    "你使用【杀】可以选择你距离不大于此【杀】点数的角色为目标；当你使用【杀】指定一个目标后，你可以根据下列条件执行相应的效果：1.其手牌数小于等于你的手牌数，此【杀】不可被【闪】响应，2.其体力值大于等于你的体力值，此【杀】伤害+1。",
  jiewei_info:
    "当你的武将牌翻面后，你可以摸一张牌。然后你可以使用一张锦囊牌或装备牌，并可以在此牌结算后弃置场上一张同类型的牌",
  releiji_info:
    "当你使用或打出一张【闪】时，你可令一名其他角色进行一次判定：若结果为梅花，其受到一点雷电伤害，然后你回复一点体力；若结果为黑桃，其受到两点雷电伤害。",
  tiangong_info:
    "锁定技，你防止即将受到的雷电伤害。每当你造成雷电伤害时，你摸一张牌。",
  shensu_info:
    "你可以跳过判定阶段和摸牌阶段，或跳过出牌阶段并弃置一张装备牌。若如此做，则你可以视为对任意一名角色使用一张无距离限制的【杀】",
  jushou_info: "结束阶段，你可以摸3张牌，并将武将牌翻面。",
  moon_jushou_info: "结束阶段，你可以摸一张牌，并将武将牌翻面。",
  liegong_info:
    "当你使用【杀】时，若目标的手牌数大于等于你的体力值，或小于等于你的攻击范围，你可令此【杀】不能被闪避。",
  kuanggu_info:
    "锁定技，当你造成一点伤害后，若受伤角色与你的距离不大于1，你回复一点体力。",
  tianxiang_info:
    "当你即将受到伤害时，你可以弃置一张♥手牌，将伤害转移给一名其他角色，然后该角色摸X张牌（X为其已损失的体力值）。",
  hongyan_info: "锁定技，你区域内的黑桃牌和黑桃判定牌均视为红桃。",
  buqu_info:
    "锁定技，当你处于濒死状态时，你亮出牌堆顶的一张牌并置于你的武将牌上，称之为“创”。若此牌的点数与你武将牌上已有的“创”点数均不同，则你回复至1体力。若点数相同，则将此牌置入弃牌堆。只要你的武将牌上有“创”，你的手牌上限便与“创”的数量相等。",
  buqu_info_guozhan:
    "锁定技，当你处于濒死状态时，你亮出牌堆顶的一张牌并置于你的武将牌上，称之为“创”。若此牌的点数与你武将牌上已有的“创”点数均不同，则你回复至1体力。若点数相同，则将此牌置入弃牌堆。",
  leiji_info:
    "当你使用或打出一张【闪】时，你可令任意一名角色进行一次判定。若结果为黑桃，其受到两点雷电伤害",
  guidao_info: "一名角色的判定牌生效前，你可以打出一张黑色牌替换之。",
  huangtian_info:
    "主公技，其他群势力角色的出牌阶段限一次，其可以交给你一张【闪】或【闪电】。",
  guhuo_info:
    "每名角色的回合限一次，你可以扣置一张手牌当一张基本牌或普通锦囊牌使用或打出。其他角色依次选择是否质疑。一旦有其他角色质疑则翻开此牌：若为假则此牌作废，若为真，则质疑角色获得技能“缠怨”（锁定技，你不能质疑于吉，只要你的体力值为1，你失去你的武将技能）",
  fenji_info:
    "当一名角色的手牌被其他角色弃置或获得后，你可以失去1点体力，然后令该角色摸两张牌。",

  new_fenji: "奋激",
  new_fenji_info:
    "一名角色的结束阶段开始时，若其没有手牌，你可以令其摸两张牌，然后你失去1点体力。",
  gzduanliang: "断粮",
  gzduanliang_info:
    "你可以将一张黑色基本牌或黑色装备牌当【兵粮寸断】使用；你可以对距离为2的角色使用【兵粮寸断】",
  xinfu_guhuo: "蛊惑",
  xinfu_guhuo_info:
    "每名角色的回合限一次，你可以扣置一张手牌当做一张基本牌或普通锦囊牌使用或打出。其他角色依次选择是否质疑。一旦有其他角色质疑则翻开此牌：若为假则此牌作废，若为真，则质疑角色获得技能〖缠怨〗。",
  guhuo_guess: "蛊惑",
  guhuo_guess_info: "",
  chanyuan: "缠怨",
  chanyuan_info:
    "锁定技，你不能质疑于吉，当你的体力值为1时，你的其他技能失效。",
  guhuo_respond: "蛊惑",
  guhuo_respond_info: "",
  guhuo_wuxie: "蛊惑",
  guhuo_wuxie_info: "",
  guhuo_phase: "蛊惑",
  guhuo_phase_info: "",
  xinhongyan: "红颜",
  xinhongyan_info:
    "锁定技，你的♠牌和♠判定牌的花色视为♥。一名角色的判定结果生效前，若判定结果为♥，则你将其改为一种花色。",

  shenhua_feng: "神话再临·风",
  shenhua_huo: "神话再临·火",
  shenhua_lin: "神话再临·林",
  shenhua_shan: "神话再临·山",
  shenhua_yin: "神话再临·阴",
  shenhua_lei: "神话再临·雷",
};
export const translate_sp = {
  xinfu_lingren: "凌人",
  xinfu_lingren_info:
    "每回合限一次。当你于出牌阶段使用带有「伤害」这一标签的基本牌或普通锦囊牌指定目标后，你可以猜测其中的一个目标的手牌中是否有基本牌，锦囊牌或装备牌。若你猜中的项目数：≥1，此牌对该角色的伤害+1；≥2，你摸两张牌；≥3，你获得技能〖奸雄〗和〖行殇〗直到下回合开始。",
  lingren_adddamage: "凌人",
  lingren_adddamage_info: "",
  lingren_jianxiong: "奸雄",
  lingren_jianxiong_info:
    "当你受到伤害后，你可以获得对你造成伤害的牌并摸一张牌。",
  lingren_xingshang: "行殇",
  lingren_xingshang_info:
    "当有角色死亡后，你可以选择一项：1.回复一点体力。2.获得该角色的所有牌。",
  xinfu_fujian: "伏间",
  xinfu_fujian_info:
    "锁定技，结束阶段开始时，你观看一名随机的其他角色的随机X张手牌。(X为场上手牌最少的角色的手牌数)",
  xinfu_xionghuo: "凶镬",
  xinfu_xionghuo_info:
    "游戏开始时，你获得3个“暴戾”标记。出牌阶段，你可以交给一名其他角色一个“暴戾”标记，你对有“暴戾”标记的角色造成伤害时，此伤害+1。有“暴戾”的其他角色的出牌阶段开始时，其移去所有“暴戾”标记并随机执行一项：1.受到1点火焰伤害且本回合不能对你使用【杀】；2.失去1点体力且本回合手牌上限-1；3.你随机获得其一张手牌和一张装备区的牌。",
  xionghuo: "凶镬",
  xionghuo_info: "",
  xionghuo_disable: "凶镬",
  xionghuo_disable_info: "",
  xionghuo_low: "凶镬",
  xionghuo_low_info: "",
  xinfu_shajue: "杀绝",
  xinfu_shajue_info:
    "锁定技，其他角色进入濒死状态时，若其体力值小于0，则你获得一个“暴戾”标记，并获得使其进入濒死状态的牌。",
  xinfu_jianjie: "荐杰",
  xinfu_jianjie_info:
    "你的第一个准备阶段，你令两名其他角色分别获得龙印与凤印；出牌阶段限一次（你的第一个回合除外），或当拥有龙印、凤印的角色死亡时，你可以转移龙印、凤印。",
  xinfu_jianjie1: "荐杰",
  xinfu_jianjie1_info: "",
  smh_huoji: "火计",
  smh_huoji_info: "",
  smh_lianhuan: "连环",
  smh_lianhuan_info: "",
  xinfu_jianjie2: "荐杰",
  xinfu_jianjie2_info: "",
  smh_lianhuan1: "连铸",
  smh_lianhuan1_info: "",
  smh_yeyan: "业炎",
  smh_yeyan_info: "",
  xinfu_yinshi: "隐士",
  xinfu_yinshi_info:
    "锁定技，若你没有龙印、凤印且防具栏为空，则当你受到属性伤害或锦囊牌造成的伤害时，防止此伤害。",
  xinfu_chenghao: "称好",
  xinfu_chenghao_info:
    "当一名角色受到属性伤害后，若其存活且其武将牌横置且是伤害传导的起点，则你可以观看牌堆顶的X张牌并分配给任意角色。（X为横置的角色数量且包含该角色）",
  jianjie_faq: "关于龙凤印",
  jianjie_faq_info:
    "龙印效果：视为拥有〖火计〗。凤印效果：视为拥有〖连环〗。（均一回合限使用三次） 龙凤印齐全：视为拥有〖业炎〗，〖业炎〗发动后移除龙凤印。",
  xinfu_wuniang: "武娘",
  xinfu_wuniang_info:
    "当你使用或打出【杀】时，你可以获得一名其他角色的一张牌。若如此做，该角色和场上所有的“关索”各摸一张牌。",
  xinfu_xushen: "许身",
  xinfu_xushen_info:
    "限定技，当一名男性角色使用【桃】令你脱离濒死状态时，若场上没有“关索”，则其可以将自己的一张武将牌变更为“关索”。然后你回复一点体力，并获得技能〖镇南〗。",
  xinfu_zhennan: "镇南",
  xinfu_zhennan_info:
    "当你成为【南蛮入侵】的目标时，你可以对一名其他角色造成1-3点随机伤害。",
  xinfu_falu: "法箓",
  xinfu_falu_info:
    "锁定技，游戏开始时，你获得「紫薇」「后土」「玉清」「勾陈」标记各一个。当你的牌因弃置而进入弃牌堆后，根据这些牌的花色，你获得对应的标记：黑桃，你获得1枚「紫薇」；梅花，你获得1枚「后土」；红桃，你获得1枚「玉清」；方块，你获得1枚「勾陈」。（每种标记限拥有1个）",
  xinfu_dianhua: "点化",
  xinfu_dianhua_info:
    "准备阶段或结束阶段，你可以观看牌堆顶的X张牌（X为你的「紫薇」「后土」「玉清」「勾陈」标记数的总和）。若如此做，你将这些牌以任意顺序放回牌堆顶或牌堆底。",
  xinfu_zhenyi: "真仪",
  xinfu_zhenyi_info:
    "你可以在以下时机弃置相应的标记来发动以下效果：一名角色的判定牌生效前，你可以弃置一枚「紫薇」，然后将判定结果改为任意花色且点数为5；你的回合外，你可以弃置一枚「后土」，然后将你的一张手牌当【桃】使用；当你造成伤害时，你可以弃置一枚「玉清」，然后令此伤害+1；当你受到伤害后，你可以弃置一张「勾陈」，然后你从牌堆中随机获得三种类型的牌各一张。",
  zhenyi_spade: "真仪",
  zhenyi_spade_info: "",
  zhenyi_club: "真仪",
  zhenyi_club_info: "",
  zhenyi_heart: "真仪",
  zhenyi_heart_info: "",
  zhangren: "张任",
  zoushi: "邹氏",
  zangba: "臧霸",
  jiling: "纪灵",
  gz_sp_dongzhuo: "董卓",
  gz_zhangjiao: "张角",
  litong: "李通",
  mizhu: "糜竺",
  buzhi: "步骘",
  chenlin: "陈琳",
  yuanshu: "SP袁术",
  gongsunzan: "公孙瓒",
  sp_diaochan: "SP貂蝉",
  yangxiu: "杨修",
  sp_zhaoyun: "SP赵云",
  caohong: "曹洪",
  liuxie: "刘协",
  xiahouba: "夏侯霸",
  zhugejin: "诸葛瑾",
  zhugeke: "诸葛恪",
  guanyinping: "关银屏",
  ganfuren: "甘夫人",
  sunhao: "孙皓",
  chengyu: "程昱",
  simalang: "司马朗",
  tianfeng: "田丰",
  sp_jiaxu: "SP贾诩",
  maliang: "马良",
  sp_caoren: "SP曹仁",
  yuejin: "乐进",
  mifuren: "糜夫人",
  sp_dongzhuo: "SP董卓",
  chendong: "陈武董袭",
  jiangfei: "蒋琬费祎",
  jiangqing: "蒋钦",
  hetaihou: "何太后",
  dingfeng: "丁奉",
  zhangxingcai: "张星彩",
  caoang: "曹昂",
  kongrong: "孔融",
  fuwan: "伏完",
  sp_pangde: "SP庞德",
  sp_sunshangxiang: "SP孙尚香",
  zhugedan: "诸葛诞",
  sp_machao: "SP马超",
  sp_jiangwei: "SP姜维",
  zhangbao: "OL张宝",
  yangxiou: "杨修",
  shixie: "士燮",
  mayunlu: "马云騄",
  zhanglu: "张鲁",
  wutugu: "兀突骨",
  mateng: "马腾",
  sp_caiwenji: "SP蔡琰",
  zhugeguo: "诸葛果",
  lingcao: "凌操",
  sunru: "孙茹",
  lingju: "灵雎",
  lifeng: "李丰",
  jsp_guanyu: "SP关羽",
  zhuling: "朱灵",
  sunluyu: "OL孙鲁育",
  hanba: "旱魃",
  panfeng: "OL潘凤",
  gz_panfeng: "潘凤",
  zumao: "祖茂",
  daxiaoqiao: "大小乔",
  cuiyan: "崔琰",
  wenpin: "文聘",
  jsp_huangyueying: "SP黄月英",
  guansuo: "关索",
  tadun: "蹋顿",
  yanbaihu: "严虎",
  wanglang: "王朗",
  caochun: "曹纯",
  dongbai: "OL董白",
  zhaoxiang: "赵襄",
  heqi: "贺齐",
  kanze: "OL阚泽",
  dongyun: "董允",
  mazhong: "马忠",
  huangfusong: "皇甫嵩",
  wangyun: "王允",
  sunqian: "孙乾",
  xizhicai: "戏志才",
  liuye: "刘晔",
  beimihu: "卑弥呼",
  luzhi: "鲁芝",
  bianfuren: "卞夫人",
  ol_bianfuren: "卞夫人",
  shamoke: "沙摩柯",
  lvfan: "吕范",
  liqueguosi: "李傕郭汜",
  cuimao: "崔琰毛玠",
  kaisa: "凯撒",

  caoying: "曹婴",
  simahui: "司马徽",
  baosanniang: "OL鲍三娘",
  pangdegong: "庞德公",
  zhaotongzhaoguang: "赵统赵广",
  majun: "马钧",
  simazhao: "司马昭",
  wangyuanji: "王元姬",

  jianggan: "蒋干",
  hejin: "何进",
  hansui: "韩遂",
  niujin: "牛金",
  xujing: "许靖",
  yuantanyuanshang: "袁谭袁尚",

  xinfenyue: "奋钺",
  xinfenyue_info:
    "出牌阶段限X次（X为与你不同阵营的存活角色数），你可以与一名其他角色拼点，若你赢，根据你拼点牌的点数依次执行以下效果：不大于5，你获得其一张牌；不大于9，你获得牌堆里的一张【杀】; 不大于K，视为你对其使用一张雷【杀】。",
  neifa: "内伐",
  neifa_info:
    "出牌阶段开始时，你可以摸两张牌或获得场上的一张牌，然后弃置一张牌。若弃置的牌是基本牌，本回合你不能使用锦囊和装备牌，且【杀】的使用次数+X且目标+1；若弃置的不是基本牌，本回合你不能使用基本牌，且使用普通锦囊牌选择目标时可以增加或减少一个目标，前两次使用装备牌时摸X张牌（X为你发动〖内伐〗弃牌后手牌中因〖内伐〗而不能使用的牌的数量且最多为5）。",
  neifa_use: "内伐",
  yuxu: "誉虚",
  yuxu_info:
    "当你于出牌阶段内使用的牌结算完成时，你可以摸一张牌。若如此做，当你于出牌阶段内使用的下一张牌结算完成时，你不能发动〖誉虚〗，且需弃置一张牌。",
  yuxu2: "誉虚(弃牌)",
  xjshijian: "实荐",
  xjshijian_info:
    "一名其他角色于其回合内使用的第二张牌结算完成后，你可弃置一张牌并令其获得技能〖誉虚〗直到回合结束。",
  mouzhu: "谋诛",
  mouzhu_info:
    "出牌阶段限一次，你可以令一名有牌的其他角色交给你一张牌。然后若你的手牌数大于其，其选择视为对你使用一张【杀】或【决斗】。",
  yanhuo: "延祸",
  yanhuo_info: "当你死亡时，你可以依次弃置一名其他角色的X张牌。（X为你的牌数）",
  niluan: "逆乱",
  niluan_info:
    "其他角色的结束阶段开始时，若其本回合内使用过【杀】或其体力值大于你，则你可以将一张黑色牌当做【杀】使用。",
  cuorui: "挫锐",
  cuorui_info:
    "锁定技，游戏开始时，你摸X张牌（X为你的体力上限）。锁定技，限定技，判定阶段开始前，若你的判定区有牌，你跳过此阶段。",
  cuorui_info_single:
    "锁定技，你的起始手牌数改为X+2（X为你剩余的备选武将数）。你跳过登场后的第一个判定阶段。",
  liewei: "裂围",
  liewei_info: "当你杀死一名角色后，你可以摸三张牌。",

  weicheng: "伪诚",
  weicheng_info:
    "当其他角色获得你的手牌后，若你的手牌数小于体力值，你可以摸一张牌。",
  daoshu: "盗书",
  daoshu_info:
    "出牌阶段，你可以选择一个花色并获得一名其他角色的一张手牌。若此牌花色与你选择的相同，则你对其造成1点伤害。否则你须交给其一张与此牌花色不同的手牌（没有则展示手牌），且本阶段内不能再发动〖盗书〗",

  xinshanjia: "缮甲",
  xinshanjia_info:
    "出牌阶段开始时，你可以摸三张牌，然后弃置3-X张牌(X为你本局游戏内不因使用而失去过的装备牌的数目且至多为3)。若你没有以此法弃置基本牌或锦囊牌，则你可以视为使用了一张无距离限制且不计入出牌阶段使用次数的【杀】。",
  new_meibu: "魅步",
  new_meibu_info:
    "其他角色的出牌阶段开始时，若你在其攻击范围内，你可以弃置一张牌，令该角色于本回合内获得技能〖止息〗。若你以此法弃置的牌不是【杀】或黑色锦囊牌，则本回合其与你的距离视为1。",
  new_mumu: "穆穆",
  new_mumu_info:
    "出牌阶段开始时，你可以选择一项：1.弃置一名其他角色装备区里的一张牌；2.获得一名角色装备区里的一张防具牌，若如此做，你本回合不能使用【杀】。",
  new_zhixi: "止息",
  new_zhixi_info:
    "锁定技，出牌阶段，你至多可使用X张牌，你使用了锦囊牌后不能再使用牌（X为你的体力值）。",
  new_mumu2: "穆穆",
  new_mumu2_info: "锁定技，你不能使用【杀】。",
  new_xingwu: "星舞",
  new_xingwu_info:
    "弃牌阶段开始时，你可以将一张牌置于武将牌上，称为“舞”。然后你可以选择一项：①将三张“舞”置入弃牌堆；②弃置两张手牌并将武将牌翻面。若如此做，你选择一名角色，该角色弃置其装备区的所有牌并受到2点伤害（若为女性，则改为1点）。",
  new_luoyan: "落雁",
  new_luoyan_info:
    "锁定技。若你的武将牌上有“舞”，则你视为拥有技能〖天香〗和〖流离〗。",
  new_luoyan_tianxiang: "天香",
  new_luoyan_tianxiang_info: "",
  new_luoyan_liuli: "流离",
  new_luoyan_liuli_info: "",
  ol_shichou: "誓仇",
  ol_shichou_info:
    "当你使用【杀】时，你可以令至多X+1名角色也成为此【杀】的目标。此牌结算结束后，若你未因【杀】造成过伤害，则你获得此【杀】（X为你已损失的体力值。每回合限获得三次）",
  zhenwei_three: "镇卫",
  zhenwei_three_info: "锁定技，敌方角色至己方其他角色的距离+1。",
  huanshi_three: "缓释",
  huanshi_three_info: "一名友方角色的判定牌生效前，你可打出一张牌代替之。",
  zhengfu: "征服",
  zhengfu_info:
    "当你使用【杀】指定目标时，你可以选择一种牌的类别，然后除非目标角色交给你一种该类别的牌，否则其不能闪避此【杀】。",

  yizan: "翊赞",
  yizan_info: "你可以将两张牌（其中至少一张是基本牌）当任意基本牌牌使用",
  yizan0: "翊赞",
  yizan0_info: "你可以将两张牌（其中至少一张是基本牌）当任意基本牌牌使用",
  yizan1: "翊赞",
  yizan1_info: "你可以将两张牌（其中至少一张是基本牌）当【闪】打出",
  yizan2: "翊赞",
  yizan2_info: "你可以将一张基本牌当任意基本牌牌使用",
  yizan3: "翊赞",
  yizan3_info: "你可以将一张基本牌当【闪】打出 ",
  yizan5: "翊赞",
  yizan5_info: "你可以将两张牌（其中至少一张是基本牌）当【杀】打出",
  yizan6: "翊赞",
  yizan6_info: "你可以将一张基本牌当【杀】打出",
  longyuan: "龙渊",
  longyuan_info:
    "<span class=greentext>觉醒技</span> 当你使用或打出基本牌时，若你已经已累计发动过3次【翊赞】，你将【翊赞】改为“你可以将一张基本牌当任意基本牌牌使用或打出”。",
  wuniang: "武娘",
  wuniang_info:
    "你使用或打出【杀】时，你可以获得一名其他角色的一张牌，然后该角色摸一张牌；若“关索”在场，你可令“关索”也摸一张牌",
  zhennan: "镇南",
  zhennan_info:
    "当你成为【南蛮入侵】的目标时，你可令一名其他角色随机受到一至三点伤害",
  xushen: "许身",
  xushen_info:
    "当其他男性角色令你脱离濒死状态时，若“关索”不在场，其可以选择是否用“关索”替换其武将牌，然后你回复一点体力并获得技能【镇南】",

  wanwei: "挽危",
  wanwei_info:
    "当你因被其他角色获得或弃置而失去牌时，你可以改为自己选择失去的牌。",
  gzjili: "蒺藜",
  gzjili_info:
    "当你于一回合内使用或打出第X张牌时，你可以摸X张牌（X为你的攻击范围）。",
  xiongsuan: "凶算",
  xiongsuan_info:
    "限定技，出牌阶段，你可以弃置一张手牌并选择一名角色，对其造成1点伤害，然后你摸三张牌。若该角色有已发动的限定技，则你选择其中一个限定技。此回合结束后，视为该限定技未发动过。",
  diaodu: "调度",
  diaodu_info:
    "当你使用装备牌时，你可以摸一张牌；出牌阶段开始时，你可以获得一名其他角色装备区里的一张牌，然后你可以将此牌交给另一名角色。",
  diancai: "典财",
  diancai_info:
    "其他角色的出牌阶段结束时，若你于此阶段失去了X张或更多的牌，则你可以将手牌摸至体力上限。（X为你的体力值）",
  zhengbi: "征辟",
  zhengbi_info:
    "出牌阶段开始时，你可以选择一项：选择一名未受伤的其他角色，你对其使用的牌无距离限制且不计入使用次数直到回合结束；或将一张基本牌交给一名其他角色，然后其交给你一张非基本牌或两张基本牌。",
  fengying: "奉迎",
  fengying_info:
    "限定技，出牌阶段，你可以弃置所有手牌。若如此做，你可以令等量的角色将手牌摸至X张(X为其体力上限且至多为5)。然后，你结束出牌阶段，并在当前回合结束后进行一个新的回合。",

  qingzhong: "清忠",
  qingzhongx: "清忠",
  qingzhongx_info:
    "出牌阶段开始时，你可以摸两张牌，若如此做，此阶段结束时，你与手牌数最少的角色交换手牌。",
  weijing: "卫境",
  weijing_info:
    "每轮限一次，当你需要使用【杀】或【闪】时，你可以视为使用一张【杀】或【闪】。",
  zishu: "自书",
  zishu_info:
    "锁定技，你的回合外，你获得的牌均会在当前回合结束后置入弃牌堆；你的回合内，当你不因〖自书〗而获得牌时，你摸一张牌。",
  yingyuan: "应援",
  yingyuan_info:
    "当你于回合内使用的牌结算完成后，你可以将其交给一名其他角色（相同牌名的牌每回合限一次）。",
  xinyingyuan: "应援",
  xinyingyuan_info:
    "当你于回合内使用一张牌后，你可以令一名其他角色从牌堆获得一张与该牌类型相同的牌（每种类型的牌每回合限一次）。",
  qianya: "谦雅",
  qianya_info: "当你成为锦囊牌的目标后，你可以将任意张手牌交给一名其他角色。",
  shuimeng: "说盟",
  shuimeng_info:
    "出牌阶段结束时，你可以与一名角色拼点，若你赢，视为你使用【无中生有】；若你没赢，视为其对你使用【过河拆桥】。",
  xianfu: "先辅",
  xianfu2: "先辅",
  xianfu2_bg: "辅",
  xianfu_info:
    "锁定技，游戏开始时，你选择一名其他角色，当其受到伤害后，你受到等量的伤害，当其回复体力后，你回复等量的体力。",
  chouce: "筹策",
  chouce_info:
    "当你受到1点伤害后，你可以判定，若结果为：黑色，你弃置一名角色区域里的一张牌；红色，你选择一名角色，其摸一张牌，若其是〖先辅〗选择的角色，改为其摸两张牌。",
  fuqi: "伏骑",
  fuqi_info:
    "锁定技，当你使用牌时，你令所有与你距离为1的其他角色不能使用或打出牌响应此牌。",
  jiaozi: "骄恣",
  jiaozi_info:
    "锁定技，若你的手牌数为全场唯一最多，则当你造成或受到伤害时，此伤害+1。",
  wy_meirenji: "美人计",
  wy_meirenji_info:
    "出牌阶段，对一名有手牌的其他男性角色使用。每名女性角色各获得其一张手牌并将一张手牌交给你，然后比较你与其的手牌数，手牌少的角色对手牌多的角色造成1点伤害。",
  wy_xiaolicangdao: "笑里藏刀",
  wy_xiaolicangdao_info:
    "出牌阶段，对一名其他角色使用。该角色摸X张牌（X为其已损失的体力值且至多为5），然后你对其造成1点伤害。",
  weikui: "伪溃",
  weikui2: "伪溃",
  weikui_info:
    "出牌阶段限一次，你可以失去1点体力并选择一名有手牌的其他角色，你观看其手牌：若其手牌中有【闪】，则视为你对其使用【杀】，且本回合你计算与其的距离视为1；若其手牌中没有【闪】，你弃置其中一张牌。",
  lizhan: "励战",
  lizhan_info: "结束阶段，你可以令任意名已受伤的角色摸一张牌。",
  wylianji: "连计",
  wylianji_info:
    "出牌阶段限一次，你可以展示一张【杀】或黑色锦囊牌，并令一名其他角色将牌堆中的随机一张武器牌置入装备区（可替换原装备）。然后该角色选择一项：1.对除你以外的角色使用该牌，并将装备区里的武器牌交给该牌的一个目标角色；2.令你对其使用此牌，然后获得此牌，并将装备区内的武器牌交给你。",
  // from here
  moucheng: "谋逞",
  moucheng_info:
    "觉醒技，当其他角色使用因〖连计〗交给其的牌累计造成伤害达到3点后，你失去技能〖连计〗，然后获得技能〖矜功〗",
  jingong: "矜功",
  jingong2: "矜功",
  jingong_backup: "矜功",
  jingong_info:
    "出牌阶段限一次，你可以将一张装备牌或【杀】当做一张随机锦囊牌使用（三选一，其中一张为【美人计】或【笑里藏刀】），然后本回合的结束阶段，若你于本回合内未造成过伤害，你失去1点体力",
  fenyue: "奋钺",
  fenyue2: "奋钺",
  fenyue2_bg: "钺",
  fenyue_info:
    "出牌阶段限X次，你可以与一名角色拼点，若你赢，你选择一项：1.令其不能使用或打出手牌直到回合结束；2.视为你对其使用了【杀】（不计入次数限制）。若你没赢，你结束出牌阶段。（X为存活的忠臣数）",

  zfengshi: "锋矢",
  zfengshi_info: "当你使用【杀】指定目标后，你可以令目标弃置装备区内的一张牌。",
  chuanxin: "穿心",
  chuanxin_info:
    "当你于出牌阶段内使用【杀】或【决斗】对目标角色造成伤害时，你可以防止此伤害。若如此做，该角色选择一项：1.弃置装备区里的所有牌，若如此做，其失去1点体力；2.随机移除主武将牌上的一个技能。",
  chuanxin_info_guozhan:
    "当你于出牌阶段内使用【杀】或【决斗】对目标角色造成伤害时，若其与你势力不同且有副将，你可以防止此伤害。若如此做，该角色选择一项：1.弃置装备区里的所有牌，若如此做，其失去1点体力；2.移除副将。",
  hengjiang: "横江",
  hengjiang2: "横江",
  hengjiang_info:
    "当你受到1点伤害后，你可以令当前回合角色本回合的手牌上限-1。然后若其弃牌阶段内没有弃牌，则你摸一张牌。",
  rehengjiang: "横江",
  rehengjiang2: "横江",
  rehengjiang3: "横江",
  rehengjiang_info:
    "当你受到1点伤害后，你可以令当前回合角色本回合的手牌上限-1。然后若其弃牌阶段内没有弃牌，则你摸X张牌（X为你本回合内对其发动过〖横江〗的次数）。",
  shuangren: "双刃",
  shuangren_info:
    "出牌阶段开始时，你可以与一名角色拼点。若你赢，你视为对其或与其势力相同的另一名角色使用一张【杀】（不计入出牌阶段的次数限制）；若你没赢，你本回合内不能对其他角色使用牌。",
  xiashu: "下书",
  xiashu_info:
    "出牌阶段开始时，你可以将所有手牌交给一名其他角色，然后该角色亮出任意数量的手牌（至少一张）。你选择一项：1.获得其亮出的手牌；2.获得其未亮出的手牌。",
  kuanshi: "宽释",
  kuanshi2: "宽释",
  kuanshi_info:
    "结束阶段，你可以选择一名角色。直到你的下回合开始，该角色第一次受到大于1的伤害时，防止此伤害，然后你跳过下个回合的摸牌阶段。",
  bingzheng: "秉正",
  bingzheng_info:
    "出牌阶段结束时，你可以令手牌数不等于体力值的一名角色弃置一张手牌或摸一张牌。然后若其手牌数等于体力值，你摸一张牌，且可以交给该角色一张牌。",
  sheyan: "舍宴",
  sheyan_info:
    "当你成为普通锦囊牌的目标时（【借刀杀人】等带有指向目标的锦囊除外），你可以为此牌增加一个目标或令其对其中一个目标无效。（有效目标数至少为一）",
  fuman: "抚蛮",
  fuman2: "抚蛮",
  fuman_info:
    "出牌阶段每名角色限一次，你可以将一张手牌交给一名其他角色并标记为“抚蛮”且“抚蛮”牌的牌名视为【杀】。然后当一名角色使用“抚蛮”牌结算结束后，你摸一张牌。若此牌造成过伤害，则改为摸两张牌。",
  qizhou: "绮胄",
  qizhou_info:
    "锁定技，你根据装备区里牌的花色数获得以下技能：1种或以上：〖马术〗；2种或以上：〖英姿〗；3种或以上：〖短兵〗；4种：〖奋威〗。",
  shanxi: "闪袭",
  shanxi_info:
    "出牌阶段限一次，你可以弃置一张红色基本牌，然后弃置攻击范围内的一名其他角色的一张牌。若弃置的牌是【闪】，你观看其手牌，若弃置的不是【闪】，其观看你的手牌。",
  duanbing: "短兵",
  duanbing_info:
    "当你使用【杀】选择目标后，你可以令一名距离为1的其他角色也成为此牌的目标。",
  fanghun: "芳魂",
  fanghun_info:
    "当你使用【杀】造成伤害或受到【杀】的伤害后，你获得X个“梅影”标记（X为伤害点数）；你可以移去1个“梅影”标记来发动〖龙胆〗并摸一张牌。",
  refanghun: "芳魂",
  refanghun_info:
    "当你使用【杀】或成为【杀】的目标后，你获得1个“梅影”标记；你可以移去1个“梅影”标记来发动〖龙胆〗并摸一张牌。",
  fanghun_sha: "龙胆",
  fuhan: "扶汉",
  fuhan_info:
    "限定技，回合开始时，你可以移去所有“梅影”标记并摸等量的牌，随机观看五名未登场的蜀势力角色，将武将牌替换为其中一名角色，并将体力上限数调整为本局游戏中移去“梅影”标记的数量（至少为2，至多为8），然后回复1点体力。",
  refuhan: "扶汉",
  refuhan_info:
    '限定技，回合开始时，你可以移去所有"梅影"标记并摸等量的牌，然后从X张蜀势力武将牌中选择并获得至多两个技能（限定技、觉醒技、隐匿技、使命技、主公技除外）。若此时你是体力值最低的角色，你回复1点体力（X为场上角色数，且X∈[4,+∞)）。',
  yjixi: "觊玺",
  yjixi_info:
    "觉醒技，结束阶段，若你连续三回合没有因〖庸肆〗而失去过体力，则你增加1点体力上限并回复1点体力，然后选择一项：获得技能〖妄尊〗；摸两张牌并获得当前主公的主公技。",
  xinyongsi: "庸肆",
  xinyongsi1: "庸肆",
  xinyongsi2: "庸肆",
  xinyongsi_info:
    "锁定技，摸牌阶段，你令额定摸牌数改为X（X为势力数）；弃牌阶段开始时，你选择一项：1.弃置一张牌；2.失去1点体力。",
  xiehui: "黠慧",
  xiehui2: "黠慧",
  xiehui_info:
    "锁定技，你的黑色牌不计入手牌上限；其他角色获得你的黑色牌时，其不能使用、打出、弃置这些牌直到其体力值减少为止。",
  lianzhu: "连诛",
  lianzhu_info:
    "出牌阶段限一次，你可以展示并交给一名其他角色一张牌，若此牌为黑色，其选择一项：1.你摸两张牌；2.弃置两张牌",
  shanjia: "缮甲",
  shanjia_info:
    "出牌阶段开始时，你可以摸X张牌，然后弃置等量的牌。若你以此法弃置了装备区内的牌，则你可以视为使用一张【杀】。（X为你于本局游戏内使用过的装备牌数且最大为7）",
  tuifeng: "推锋",
  tuifeng2: "推锋",
  tuifeng_info:
    "1.当你受到1点伤害后，你可以将一张牌置于武将牌上，称为“锋”。2.准备阶段开始时，若你的武将牌上有“锋”，你移去所有“锋”，摸2X张牌，然后你于此回合的出牌阶段内使用【杀】的次数上限+X。（X为你此次移去的“锋”数）",
  ziyuan: "资援",
  ziyuan_info:
    "出牌阶段限一次，你可以将任意张点数之和为13的手牌交给一名其他角色，然后该角色回复1点体力。",
  jugu: "巨贾",
  jugu_info:
    "锁定技，1.你的手牌上限+X。2.游戏开始时，你摸X张牌（X为你的体力上限）",
  hongde: "弘德",
  hongde_info: "当你一次获得或失去至少两张牌后，你可以令一名其他角色摸一张牌。",
  dingpan: "定叛",
  dingpan_info_identity:
    "出牌阶段限X次，你可以令一名装备区里有牌的角色摸一张牌，然后其选择一项：1.令你弃置其装备区里的一张牌；2.获得其装备区里的所有牌，若如此做，你对其造成1点伤害。（X为场上存活的反贼数）",
  dingpan_info_versus:
    "出牌阶段限X次，你可以令一名装备区里有牌的角色摸一张牌，然后其选择一项：1.令你弃置其装备区里的一张牌；2.获得其装备区里的所有牌，若如此做，你对其造成1点伤害。（X为场上存活的敌方角色数）",
  dingpan_info:
    "出牌阶段限一次，你可以令一名装备区里有牌的角色摸一张牌，然后其选择一项：1.令你弃置其装备区里的一张牌；2.获得其装备区里的所有牌，若如此做，你对其造成1点伤害。",
  weidi: "伪帝",
  weidi_info: "锁定技，你视为拥有当前主公的主公技。",
  juesi: "决死",
  juesi_info:
    "出牌阶段，你可以弃置一张【杀】并选择攻击范围内的一名有牌的其他角色，该角色弃置一张牌，然后若弃置的牌不是【杀】且你的体力值不大于该角色，你视为对其使用【决斗】。",
  zhenlue: "缜略",
  zhenlue_info:
    "锁定技，你使用的普通锦囊牌不能被【无懈可击】响应；你不能成为延时锦囊牌的目标。",
  jianshu: "间书",
  jianshu_info:
    "限定技，出牌阶段，你可以将一张黑色手牌交给一名其他角色，并选择另一名其他角色，然后令这两名角色拼点。赢的角色弃置两张牌，没赢的角色失去一点体力。",
  yongdi: "拥嫡",
  yongdi_info:
    "限定技，准备阶段开始时，你可令一名其他男性角色增加一点体力上限并回复1点体力，然后若该角色的武将牌上有主公技且其不为主公，其获得此主公技。",
  regushe: "鼓舌",
  regushe_info:
    "出牌阶段，若X小于7，则你可以用一张手牌与至多三名角色同时拼点，然后依次结算拼点结果，没赢的角色选择一项：1.弃置一张牌；2.令你摸一张牌。若你没赢，你获得一个“饶舌”标记。当你获得第7个“饶舌”标记时，你死亡。（X为你的“饶舌”标记数与本回合因“鼓舌”拼点而胜利的次数之和）",
  rejici: "激词",
  rejici2: "激词",
  rejici_info:
    "锁定技，当你展示拼点牌后，若此牌的点数不大于X，则你令此牌点数+X，并获得此次拼点中原点数最大的拼点牌。当你死亡时，你令杀死你的角色弃置7-X张牌并失去1点体力。（X为你的“饶舌”标记数）",
  gushe: "鼓舌",
  gushe_bg: "舌",
  gushe_info:
    "出牌阶段限一次，你可以用一张手牌与至多三名角色同时拼点，然后依次结算拼点结果，没赢的角色选择一项：1.弃置一张牌；2.令你摸一张牌。若你没赢，你获得一个“饶舌”标记。当你获得第7个“饶舌”标记时，你死亡。",
  jici: "激词",
  jici_info:
    "当你因发动〖鼓舌〗而扣置的拼点牌亮出后，若点数小于X，你可令点数+X；若点数等于X，你可令你本回合发动〖鼓舌〗的次数上限+1。（X为你“饶舌”标记的数量）",
  shefu: "设伏",
  shefu2: "设伏",
  shefu_bg: "伏",
  shefu_info:
    "结束阶段开始时，你可以将一张牌移出游戏，称为「伏兵」。并为「伏兵」记录一个基本牌或锦囊牌的名称（须与其他「伏兵」记录的名称均不同）。你的回合外，当有其他角色使用与你记录的「伏兵」牌名相同的手牌时，你可以取消此牌的所有目标，然后移去该「伏兵」。若此时处于使用者的回合内，则你令使用者当前的所有非Charlotte技失效直至回合结束。",
  benyu: "贲育",
  benyu2: "贲育",
  benyu_info:
    "当你受到伤害后，你可选择：①将手牌摸至与伤害来源手牌数相同（至多摸至5张）；②弃置大于伤害来源手牌数的牌，然后对其造成1点伤害。",
  zhidao: "雉盗",
  zhidao_info:
    "锁定技，当你于你的回合内第一次对区域里有牌的其他角色造成伤害后，你获得其手牌、装备区和判定区里的各一张牌，然后直到回合结束，其他角色不能被选择为你使用牌的目标。",
  jili: "寄篱",
  jili_info:
    "锁定技，当一名其他角色成为红色基本牌或红色普通锦囊牌的目标时，若其与你的距离为1且你既不是此牌的使用者也不是目标，你也成为此牌的目标。",
  luanzhan: "乱战",
  luanzhan_info:
    "你使用【杀】或黑色普通锦囊牌可以额外选择X名角色为目标；当你使用【杀】或黑色普通锦囊牌指定目标后，若此牌的目标角色数小于X，则X减至0。（X为你于本局游戏内造成过伤害的次数）",
  zhengnan: "征南",
  zhengnan_info:
    "其他角色死亡后，你可以摸三张牌并获得下列技能中的任意一个：〖武圣〗、 〖当先〗和〖制蛮〗。",
  xinzhengnan: "征南",
  xinzhengnan_info:
    "当一名角色进入濒死状态时，若你未因其发动过〖征南〗，则你回复1点体力并摸一张牌并获得下列技能中的任意一个：〖武圣〗、 〖当先〗和〖制蛮〗（若技能全部拥有则改为摸三张牌。你以此法获得的〖当先〗结算时视为已发动过〖伏枥〗）。",
  xiefang: "撷芳",
  xiefang_info: "锁定技，你计算与其他角色的距离时-X。（X为女性角色数）",
  qizhi: "奇制",
  qizhi_info:
    "当你于回合内使用基本牌或锦囊牌指定目标后，你可以弃置不是此牌目标的一名角色的一张牌。若如此做，其摸一张牌。",
  jinqu: "进趋",
  jinqu_info:
    "结束阶段开始时，你可以摸两张牌，若如此做，你将手牌弃置至X张。（X为你于此回合发动过〖奇制〗的次数）",
  jiqiao: "机巧",
  jiqiao_info:
    "出牌阶段开始时，你可以弃置任意张装备牌，然后亮出牌堆顶两倍数量的牌并获得其中的非装备牌。",
  linglong: "玲珑",
  linglong_info:
    "锁定技，若你的装备区没有武器牌，则你使用【杀】的次数上限+1；若你的装备区没有防具牌，视为你装备着【八卦阵】；若你的装备区没有坐骑牌，你的手牌上限+1；若你的装备区没有宝物牌，则你视为拥有技能〖奇才〗。",
  zhenwei: "镇卫",
  zhenwei2: "镇卫",
  zhenwei_info:
    "当一名其他角色成为【杀】或黑色锦囊牌的目标时（使用者不是你），若该角色的体力值小于你且此牌的目标角色数为1，你可以弃置一张牌。若如此做，你选择一项：1、摸一张牌，然后将此【杀】或黑色锦囊牌转移给你；2、令此【杀】或黑色锦囊牌无效，然后将此【杀】或黑色锦囊牌置于使用者的武将牌旁，若如此做，当前回合结束后，使用者获得使用者武将牌旁的这些牌。",
  xingwu: "星舞",
  xingwu_info:
    "弃牌阶段开始时，你可以将一张与你本回合使用的牌颜色均不同的手牌置于武将牌上：若你有至少三张“星舞”牌，你移去“星舞”牌并选择一名男性角色，该角色受到2点伤害并弃置其装备区的所有牌",
  luoyan: "落雁",
  luoyan_info: "锁定技。若你的武将牌上有“星舞牌”，你拥有“天香”和“流离”",
  yinbing: "引兵",
  yinbing_info:
    "结束阶段开始时，你可以将至少一张非基本牌置于武将牌上。每当你受到【杀】或【决斗】的伤害后，你移去一张「引兵」牌。",
  juedi: "绝地",
  juedi_info:
    "锁定技，准备阶段，若你的武将牌上有「引兵」牌，你选择一项：1.移去「引兵」牌，将手牌补至体力上限数；2.将「引兵」牌交给一名体力值不大于你的其他角色，其回复1点体力并摸等量的牌。",
  kuangfu: "狂斧",
  kuangfu_info:
    "当你使用【杀】造成伤害时，你可以选择一项：弃置其装备区内的一张牌，或将其装备区内的一张牌移动到你的装备区内。",
  xintan: "心惔",
  xintan_info:
    "出牌阶段限一次，你可以移去两张「焚」并选择一名角色，该角色失去一点体力。",
  fentian: "焚天",
  fentian_info:
    "锁定技，结束阶段开始时，若你的手牌数少于体力值，你须选择一名攻击范围内的角色，将其一张牌置于你的武将牌上，称为「焚」。锁定技，你的攻击范围+X（X为「焚」的数量）",
  zhiri: "炙日",
  zhiri_info:
    "觉醒技，准备阶段开始时，若你的「焚」的数量不小于3，你减1点体力上限，然后获得技能〖心惔〗",
  meibu: "魅步",
  meibu_info:
    "其他角色的出牌阶段开始时，若你不在其攻击范围内，你可以令该角色的锦囊牌均视为【杀】，直到该角色以此法使用了一张【杀】或回合结束。若如此做，则直到回合结束，视为你在其攻击范围内。",
  mumu: "穆穆",
  mumu_info:
    "出牌阶段限一次，你可以弃置一张【杀】或黑色锦囊牌，然后选择一项：弃置场上的一张武器牌，然后摸一张牌；或将场上的一张防具牌移动到你的装备区里（可替换原防具）。",
  zhanyi: "战意",
  zhanyi_basic_sha: "战杀",
  zhanyi_basic_jiu: "战酒",
  zhanyi_basic_tao: "战桃",
  zhanyi_info:
    "出牌阶段限一次，你可以弃置一张牌并失去1点体力，然后根据你弃置的牌获得以下效果直到回合结束：基本牌，你可以将一张基本牌当作【杀】、【酒】或【桃】使用；锦囊牌，摸两张牌且你使用的牌无距离限制；装备牌，你使用【杀】指定目标角色后，其弃置两张牌。",
  nuzhan: "怒斩",
  nuzhan2: "怒斩",
  nuzhan_info:
    "锁定技，你使用的由一张锦囊牌转化的【杀】不计入出牌阶段的次数限制；锁定技，你使用的由一张装备牌转化的【杀】的伤害值基数+1",
  danji: "单骑",
  danji_info:
    "觉醒技，准备阶段开始时，若你的手牌数大于你的体力值且本局游戏的主公不为刘备，你减1点体力上限，然后获得〖马术〗和〖怒斩〗",
  jieyuan: "竭缘",
  jieyuan_more: "竭缘",
  jieyuan_less: "竭缘",
  jieyuan_info:
    "当你对一名其他角色造成伤害时，若其体力值大于或等于你的体力值，你可弃置一张黑色手牌，令此伤害+1；当你受到一名其他角色造成的伤害时，若其体力值大于或等于你的体力值，你可弃置一张红色手牌，令此伤害-1。",
  fenxin: "焚心",
  fenxin_old: "焚心",
  fenxin_info:
    "锁定技，一名其他角色死亡后，若其身份为：忠臣，你本局内发动〖竭缘〗减少伤害时无视体力值限制；反贼，你本局内发动〖竭缘〗增加伤害时无视体力值限制；内奸，你本局内选择发动〖竭缘〗的牌时无颜色和区域限制。",
  fenxin_old_info:
    "限定技，当你杀死一名非主公角色时，你可以与其交换未翻开的身份牌。（你的身份为主公时不能发动此技能）",
  qingyi: "轻逸",
  qingyi1: "轻逸",
  qingyi2: "轻逸",
  qingyi_info:
    "你可以跳过判定阶段和摸牌阶段。若如此做，视为对一名角色使用了一张无距离限制的【杀】。",
  xiandeng: "先登",
  xiandeng_info:
    "锁定技，出牌阶段，你使用的第一张【杀】不计入次数且无距离限制。",
  shulv: "熟虑",
  shulv_info:
    "出牌阶段限一次，若你的手牌数大于体力值，则你可以弃置一张牌并摸一张牌。",
  xisheng: "牺牲",
  xisheng_info: "每名其他角色的回合限一次，你可以将两张牌当做【桃】使用。",
  yuhua: "羽化",
  yuhua_info:
    "锁定技。①你的非基本牌不计入手牌上限。②准备阶段和结束阶段开始时，你卜算1。",
  qirang: "祈禳",
  qirang_info:
    "当有装备牌进入你的装备区时，你可获得牌堆中的一张锦囊牌。若此牌为：普通锦囊牌，则当你使用此“祈禳”牌选择唯一目标后，可为此牌增加一个目标；延时锦囊牌，则你下回合发动〖羽化〗时的卜算量+1（至多为5）。",
  biluan: "避乱",
  biluan_info:
    "摸牌阶段开始时，若有与你距离不大于1的其他角色，你可以放弃摸牌。若如此做，本局内其他角色计算与你的距离时+X。（X为势力数）",
  lixia: "礼下",
  lixia_info:
    "锁定技，其他角色的结束阶段开始时，若你不在其攻击范围内，你摸一张牌或令其摸一张牌。本局内其他角色计算与你的距离时-1。",
  rebiluan: "避乱",
  rebiluan2: "避乱",
  rebiluan_info:
    "结束阶段开始时，若有与你距离不大于1的其他角色，你可以弃置一张牌。若如此做，本局内其他角色计算与你的距离时+X。（X为场上角色数且至多为4）",
  relixia: "礼下",
  relixia_info:
    "锁定技，其他角色的结束阶段开始时，若你不在其攻击范围内，你选择一至两项：1.摸一张牌；2.其摸两张牌；3.其回复1点体力。本局内其他角色计算与你的距离时-X（X为你选择的选项数）。",
  yishe: "义舍",
  yishe_bg: "米",
  yishe_info:
    "结束阶段开始时，若你的武将牌上没有「米」，则你可以摸两张牌。若如此做，你将两张牌置于武将牌上，称为「米」；当有「米」移至其他区域后，若你的武将牌上没有「米」，则你回复1点体力。",
  bushi: "布施",
  midao: "米道",
  bushi_info:
    "当你受到1点伤害后，或其他角色受到你造成的1点伤害后，受到伤害的角色可以获得你的一张「米」",
  midao_info: "一名角色的判定牌生效前，你可以打出一张「米」代替之。",
  fengpo: "凤魄",
  fengpo_info:
    "每种牌名限一次，当你于出牌阶段内第一次使用【杀】或【决斗】指定目标后，若目标角色数为1，你可以选择一项：1.摸X张牌；2.令此牌的伤害值基数+X。（X为其手牌中♦牌的数量）",
  chenqing: "陈情",
  chenqing_info:
    "每轮限一次，当一名角色处于濒死状态时，你可以令另一名其他角色摸四张牌，然后其弃置四张牌。若其以此法弃置的四张牌花色各不相同，则视为该角色对濒死的角色使用一张【桃】。",
  mozhi: "默识",
  mozhi_info:
    "结束阶段开始时，你可以将一张手牌当作你本回合出牌阶段内使用的第一张基本或普通锦囊牌使用。然后，你可以将一张手牌当做你本回合出牌阶段内使用的第二张基本或普通锦囊牌使用。（你不能通过此技能使用【酒】）",
  ranshang: "燃殇",
  ranshang2: "燃殇",
  ranshang_info:
    "锁定技，当你受到1点火焰伤害后，你获得1枚“燃”标记；结束阶段开始时，你失去X点体力。若X大于2，则你减2点体力上限并摸两张牌。（X为“燃”标记的数量）",
  hanyong: "悍勇",
  hanyong_info:
    "当你使用【南蛮入侵】或【万箭齐发】或黑桃普通【杀】时，若你已受伤，则你可以令此牌的伤害值基数+1。然后若你的体力值不小于游戏轮数，则你获得一枚“燃”标记。",

  yicong: "义从",
  yongsi: "庸肆",
  yongsi1: "庸肆",
  yongsi2: "庸肆",
  bifa: "笔伐",
  bifa2: "笔伐",
  songci: "颂词",
  songci_draw: "颂词",
  baobian: "豹变",
  lihun: "离魂",
  chongzhen: "冲阵",
  chongzhen1: "冲阵",
  chongzhen2: "冲阵",
  yuanhu: "援护",
  tianming: "天命",
  mizhao: "密诏",
  duwu: "黩武",
  duwu3: "黩武",
  mingzhe: "明哲",
  huanshi: "缓释",
  hongyuan: "弘援",
  aocai: "傲才",
  aocai2: "傲才",
  aocai2_backup: "傲才",
  aocai3: "傲才",
  huxiao: "虎啸",
  huxiao3: "虎啸",
  xueji: "雪恨",
  wuji: "武继",
  shushen: "淑慎",
  shenzhi: "神智",
  xiongyi: "雄异",
  junbing: "郡兵",
  junbing2: "郡兵",
  quji: "去疾",
  sijian: "死谏",
  suishi: "随势",
  suishi2: "随势",
  xiaoguo: "骁果",
  duanxie: "断绁",
  fenming: "奋命",
  guixiu: "闺秀",
  cunsi: "存嗣",
  yongjue: "勇决",
  hengzheng: "横征",
  shengxi: "生息",
  shoucheng: "守成",
  shangyi: "尚义",
  zniaoxiang: "鸟翔",
  zhendu: "鸩毒",
  qiluan: "戚乱",
  qiluan2: "戚乱",
  qiluan3: "戚乱",
  shenxian: "甚贤",
  oldshenxian: "甚贤",
  qiangwu: "枪舞",
  moukui: "谋溃",
  moukui2: "谋溃",
  lirang: "礼让",
  mingshi: "名士",
  liangzhu: "良助",
  kaikang: "慷忾",
  wangzun: "妄尊",
  tongji: "同疾",
  kuiwei: "溃围",
  kuiwei2: "溃围",
  yanzheng: "严整",
  zhoufu: "咒缚",
  zhoufu2: "咒缚",
  zhoufu3: "咒缚",
  yingbin: "影兵",
  reyingbing: "影兵",
  rezhoufu: "咒缚",
  rezhoufu2: "咒缚",
  fenxun: "奋迅",
  fenxun2: "奋迅",
  spmengjin: "猛进",
  xiemu: "协穆",
  xiemu2: "协穆",
  oldxiemu: "协穆",
  naman: "纳蛮",
  taichen: "抬榇",
  jilei: "鸡肋",
  jilei2: "鸡肋",
  jilei2_bg: "肋",
  yawang: "雅望",
  xunzhi: "殉志",
  fanxiang: "返乡",
  fanxiang_info:
    "觉醒技，准备阶段开始时，若场上有已受伤且你发动过〖良助〗的选项二的角色，则你加1点体力上限并回复1点体力，失去技能〖良助〗并获得技能〖枭姬〗",
  xunzhi_info:
    "准备阶段开始时，若你的上家和下家与你的体力值均不相等，你可以失去1点体力。若如此做，你本局内手牌上限+2。",
  yawang_info:
    "锁定技，摸牌阶段开始时，你改为摸X张牌，然后你于本回合的出牌阶段内至多使用X张牌（X为与你体力值相等的角色数）",
  jilei_info:
    "当你受到有来源的伤害后，你可以声明一种牌的类别。若如此做，你令伤害来源不能使用、打出或弃置此类别的手牌直到其下个回合开始。",
  danlao: "啖酪",
  danlao_info:
    "当你成为【杀】或普通锦囊牌的目标后，若此牌的目标数大于1，则你可以摸一张牌，令此牌对你无效。",
  gongao: "功獒",
  zhuiji: "追击",
  chouhai: "仇海",
  chouhai_info: "锁定技，当你受到伤害时，若你没有手牌，此伤害+1。",
  rechouhai: "仇海",
  rechouhai_info:
    "锁定技，当你受到渠道为【杀】的伤害时，若你没有手牌，此伤害+1。",
  guiming: "归命",
  guiming_info:
    "主公技，锁定技，你将残蚀描述中的“已受伤角色”改为“已受伤角色或其他吴势力角色”",
  canshi: "残蚀",
  canshi2: "残蚀",
  canshi_info:
    "摸牌阶段开始时，你可以改为摸X张牌（X为已受伤的角色数），若如此做，当你于此回合内使用基本牌或锦囊牌时，你弃置一张牌。",
  recanshi: "残蚀",
  recanshi2: "残蚀",
  recanshi_info:
    "摸牌阶段开始时，你可以多摸X张牌（X为已受伤的角色数），若如此做，当你于此回合内使用【杀】或普通锦囊牌时，你弃置一张牌。",
  zhuiji_info: "锁定技，你与体力值不大于你的角色的距离视为1。",
  kunfen: "困奋",
  kunfen_info: "锁定技，结束阶段开始时，你失去1点体力，然后摸两张牌。",
  fengliang: "逢亮",
  fengliang_info:
    "觉醒技，当你进入濒死状态时，你减1点体力上限，将体力值回复至2点，获得技能〖挑衅〗并将〖困奋〗改为非锁定技。",
  oldcihuai: "刺槐",
  oldcihuai2: "刺槐",
  oldcihuai_info:
    "出牌阶段开始时，你可以展示手牌。若其中没有【杀】，则当你于此阶段内手牌数变化之前/有角色死亡之前需要使用【杀】时，你可以使用无对应实体牌的【杀】。",
  cihuai: "刺槐",
  cihuai_info:
    "出牌阶段开始时，若你的手牌中没有【杀】，则你可以展示你的手牌，视为对一名角色使用一张【杀】。",
  gongao_info: "锁定技，当一名角色死亡后，你增加一点体力上限，回复一点体力。",
  juyi: "举义",
  juyi_info:
    "觉醒技，准备阶段开始时，若你的体力上限大于存活角色数，你摸等同于体力上限张数的牌，然后获得技能〖崩坏〗和〖威重〗。",
  weizhong: "威重",
  weizhong_info:
    "锁定技，当你的体力上限增加或减少时，你摸一张牌。若你的手牌数为全场最少，则你改为摸两张牌。",
  taichen_info:
    "出牌阶段限一次，你可以失去1点体力，视为对一名角色使用一张【杀】。（不计入出牌阶段的使用次数限制）",
  naman_info:
    "当其他角色打出的【杀】结算结束后，你可以获得此牌对应的所有实体牌。",
  xiemu_info:
    "出牌阶段限一次，你可以弃置一张【杀】并选择一个势力。若如此做，直到你的下回合开始时，当你成为该势力的其他角色使用的黑色牌的目标后，你摸两张牌。",
  oldxiemu_info:
    "当你成为其他角色使用的黑色牌的目标后，你可以弃置一张【杀】，然后摸两张牌。",
  spmengjin_info: "当你使用【杀】指定目标后，你可以弃置目标角色的一张牌。",
  fenxun_info:
    "出牌阶段限一次，你可以弃置一张牌并选择一名其他角色，你于本回合内至其的距离视为1。",
  rezhoufu_info:
    "出牌阶段限一次，你可以用一张牌对一名其他角色施“咒”。当有“咒”的角色判定时，将“咒”作为判定牌；一名角色的回合结束时，你令本回合移除过“咒”的角色各失去1点体力",
  reyingbing_info:
    '锁定技，有“咒”的角色使用与“咒”颜色相同的牌时，你摸一张牌；若这是你第二次因该“咒”摸牌，则你获得该"咒"。',
  yingbin_info:
    "锁定技，有“咒”的角色使用与“咒”花色相同的牌时，你摸一张牌；当你因同一名角色的同一张“咒”的效果摸第二张牌时，移去该“咒”。",
  zhoufu_info:
    "出牌阶段限一次，你可以将一张手牌置于一名没有“咒”的其他角色的武将牌旁，称为“咒”。当有“咒”的角色判定时，其改为将“咒”作为判定牌；一名角色的回合结束时，若有角色于此回合因判定而移除过“咒”，则你令这些角色各失去1点体力。",
  yanzheng_info:
    "若你的手牌数大于你的体力值，则你可以将你装备区内的牌当作【无懈可击】使用。",
  kuiwei_info:
    "结束阶段开始时，你可以摸2+X张牌并记录X，然后将你的武将牌翻面（X为场上所有角色装备区内武器牌数目之和）。你的下个摸牌阶段开始时，你弃置X张牌。",
  tongji_info:
    "锁定技。若你的手牌数大于你的体力值，则攻击范围包含你的其他角色使用【杀】时不能指定你以外的角色为目标。",
  wangzun_info:
    "其他角色的准备阶段开始时，你可以摸一张牌。若如此做，该角色此回合的手牌上限-1。然后你不能再发动〖妄尊〗直到回合开始。",
  kaikang_info:
    "当一名角色成为【杀】的目标后，若你至该角色的距离为1，你可以摸一张牌。若如此做，你交给其一张牌并展示之。若为装备牌，该角色可以使用此牌。",
  liangzhu_info:
    "当一名角色于其出牌阶段内回复体力时，你可以选择一项：1、摸一张牌；2、令该角色摸两张牌。",
  mingshi_info:
    "当你受到伤害时，若伤害来源的体力值大于你，你可以弃置一张黑色手牌，令伤害值-1。",
  lirang_info:
    "当你的牌因弃置而置入弃牌堆后，你可以将其中的任意张牌交给其他角色。",
  moukui_info:
    "当你使用【杀】指定目标后，你可以选择一项：摸一张牌，或弃置其一张牌。若如此做，当此【杀】被【闪】抵消时，目标角色弃置你的一张牌。 ",
  qiangwu_info:
    "出牌阶段，你可以进行判定。若如此做，直到回合结束，你使用点数小于判定结果的【杀】时不受距离限制，且你使用点数大于判定结果的【杀】时无使用次数限制。",
  shenxian_info:
    "每名角色的回合限一次，你的回合外，当有其他角色因弃置而失去基本牌时，你可以摸一张牌。",
  oldshenxian_info:
    "你的回合外，每当有其他角色因弃置而失去基本牌时，你可以摸一张牌。",
  qiluan_info:
    "一名角色的回合结束时，你可以摸3X+Y张牌。（X为你本回合内杀死过的角色数，Y为本回合内其他角色杀死过的角色数）",
  //qiluan_info_guozhan:'一名角色的回合结束时，若你于回合内杀死过角色，则你可以摸三张牌。',
  zhendu_info:
    "一名角色的出牌阶段开始时，你可以弃置一张手牌，视为该角色使用了一张【酒】。若该角色不是你，你对其造成一点伤害。",
  //zhendu_info_guozhan:'其他角色的出牌阶段开始时，你可以弃置一张手牌，视为该角色使用了一张【酒】。若如此做，你对其造成一点伤害。',
  shangyi_info:
    "出牌阶段限一次，你可以观看一名其他角色的手牌，然后弃置其中的一张黑色牌。",
  zniaoxiang_info:
    "锁定技，当你使用【杀】指定目标后，你令目标角色响应此【杀】所需要使用的【闪】的数目+1。",
  shoucheng_info:
    "当一名其他角色于其回合外失去手牌时，若其没有手牌，则你可令该角色摸一张牌。",
  shengxi_info: "弃牌阶段开始时，若你本回合内未造成过伤害，则你可以摸两张牌。",
  hengzheng_info:
    "摸牌阶段开始时，若你的体力值为1或你没有手牌，则你可以放弃摸牌，改为获得每名其他角色区域内的一张牌。",
  cunsi_info:
    "限定技，出牌阶段，你可以将所有手牌交给一名男性角色。该角色获得技能【勇决】，然后你将武将牌翻面。",
  yongjue_info:
    "每回合限一次。当其他角色于回合内使用的【杀】结算完成后，若你不是此【杀】的目标角色，则你可以获得之。",
  guixiu_info:
    "当你成为【杀】的目标后，若你的手牌数小于体力值，则你可以摸一张牌。",
  fenming_info:
    "结束阶段开始时，若你处于横置状态，你可以弃置所有处于横置状态的角色的各一张牌。",
  duanxie_info:
    "出牌阶段限一次，你可以令至多X名其他角色横置（X为你已损失的体力值且至少为1），然后你横置。",
  xiaoguo_info:
    "其他角色的结束阶段开始时，你可以弃置一张基本牌，令该角色选择一项：1.弃置一张装备牌，然后你摸一张牌；2.受到你对其造成的1点伤害。",
  sijian_info: "当你失去最后的手牌时，你可以弃置一名其他角色的一张牌。",
  suishi_info:
    "当其他角色进入濒死状态时，伤害来源可以令你摸一张牌；当其他角色死亡时，伤害来源可以令你失去1点体力",
  quji_info:
    "出牌阶段限一次，你可以弃置X张牌（X为你已损失的体力值），然后令至多X名已受伤的角色各回复1点体力。若你以此法弃置的牌中有黑色牌，你失去一点体力。",
  junbing_info:
    "一名角色的结束阶段开始时，若其手牌数不大于1，该角色可以摸一张牌。若如此做，该角色将所有手牌交给你，然后你交给其等量的牌。",
  xiongyi_info:
    "限定技，出牌阶段，你可以选择至多三名角色，这些角色各摸三张牌；若你选择的角色数不超过2，你回复1点体力",
  xiongyi_info_guozhan:
    "限定技，出牌阶段，你可以令与你势力相同的所有角色各摸三张牌，然后若你的势力是角色最少的势力（或之一），则你回复1点体力。",
  shenzhi_info:
    "准备阶段开始时，你可以弃置所有手牌。若你以此法弃置的牌数不小于X，你回复1点体力（X为你的体力值）。",
  shushen_info:
    "当你回复1点体力时，你可以令一名其他角色选择回复1点体力或摸两张牌。",
  wuji_info:
    "觉醒技，结束阶段开始时，若你于此回合内造成过3点或更多伤害，你加1点体力上限并回复1点体力，失去〖虎啸〗，然后从场上、牌堆或弃牌堆中获得【青龙偃月刀】",
  xueji_info:
    "出牌阶段限一次，你可以弃置一张红色牌，然后选择至多X名角色，横置这些角色并对其中一名角色造成1点火焰伤害。（X为你已损失的体力值且至少为1）",
  huxiao_info:
    "锁定技，当你造成火属性伤害时，该角色摸一张牌。然后，你于此回合内对其使用牌没有次数限制。",
  aocai_info:
    "当你于回合外需要使用或打出一张基本牌时，你可以观看牌堆顶的两张牌（若你没有手牌则改为四张）。若你观看的牌中有此牌，你可以使用打出之。",
  aocai_info_guozhan:
    "当你于回合外需要使用或打出一张基本牌时，你可以观看牌堆顶的两张牌。若你观看的牌中有此牌，你可以使用打出之。",
  hongyuan_info:
    "摸牌阶段，你可以少摸一张牌并指定至多两名其他角色。若如此做，这些角色各摸一张牌。",
  hongyuan_info_combat:
    "摸牌阶段，你可以少摸一张牌。若如此做，其他友方角色各摸一张牌。",
  huanshi_info:
    "一名角色的判定牌生效前，你可令其观看你的手牌。若如此做，该角色选择你的一张牌，你打出此牌代替之。",
  mingzhe_info:
    "当你于回合外使用或打出红色牌，或因弃置失去一张红色牌后，你可以摸一张牌。",
  duwu_info:
    "出牌阶段，你可以弃置X张牌对你攻击范围内的一名其他角色造成1点伤害（X为该角色的体力值）。若该角色因此法进入濒死状态且存活，则你于濒死状态结算后失去1点体力，且本回合不能再发动〖黩武〗。",
  tianming_info:
    "当你成为【杀】的目标时，你可以弃置两张牌（不足则全弃，无牌则不弃），然后摸两张牌；若此时全场体力值最多的角色仅有一名且不是你，该角色也可以如此做。",
  mizhao_info:
    "出牌阶段限一次，你可以将所有手牌交给一名其他角色。若如此做，你令该角色与你指定的另一名有手牌的角色拼点，视为拼点赢的角色对没赢的角色使用一张【杀】。",
  yuanhu_info:
    "结束阶段开始时，你可以将一张装备牌置于一名角色的装备区里，然后根据此装备牌的类型执行以下对应效果。武器牌：弃置该角色距离1以内的一名角色区域中的一张牌；防具牌：该角色摸一张牌；坐骑牌：该角色回复1点体力。",
  lihun_info:
    "出牌阶段限一次，你可以弃置一张牌并选择一名其他男性角色。若如此做，你将武将牌翻面并获得其所有手牌。出牌阶段结束时，你交给其X张牌。（X为该角色的体力值）",
  chongzhen_info:
    "当你因发动〖龙胆〗而使用或打出【杀】或【闪】时，你可以获得对方的一张手牌。",
  bifa_info:
    "结束阶段开始时，你可以将一张手牌移出游戏并指定一名其他角色。该角色的准备阶段开始时，其观看你移出游戏的牌并选择一项：交给你一张与此牌类型相同的手牌并获得此牌；或将此牌置入弃牌堆，然后失去1点体力。",
  songci_info:
    "①出牌阶段，你可以选择一名未以此法选择过的角色。若其手牌数：大于其体力值，其弃置两张牌；不大于其体力值，其摸两张牌。②弃牌阶段结束时，若你已对场上所有存活角色发动过〖颂词①〗，则你摸一张牌。",
  yongsi_info:
    "锁定技，摸牌阶段，你多摸X张牌。弃牌阶段开始时，你弃置X张牌。（X为场上势力数）",
  yicong_info:
    "锁定技，当你的体力值大于2时，你计算与其他角色的距离时-1；当你的体力值不大于2时，其他角色计算与你的距离时+1。",
  baobian_info:
    "锁定技，若你的体力值为3或更少，你视为拥有技能〖挑衅〗；若你的体力值为2或更少；你视为拥有技能〖咆哮〗；若你的体力值为1，你视为拥有技能〖神速〗。",
  rebaobian: "豹变",
  rebaobian_info:
    "锁定技。当你受到伤害后，你获得以下技能中第一个未拥有的技能：〖挑衅〗/〖咆哮〗/〖神速〗。",
  bingzhao: "秉诏",
  bingzhao_info:
    "主公技，游戏开始时，你选择一个其他势力。当你对该势力的角色发动〖骨疽〗时，其可令你额外摸一张牌。",
  sunshao: "孙邵",
  bizheng: "弼政",
  bizheng_info:
    "摸牌阶段结束时，你可以令一名其他角色摸两张牌。然后，若你的手牌数大于体力上限，你弃置两张牌。若其的手牌数大于体力上限，其弃置两张牌。",
  yidian: "佚典",
  yidian_info:
    "当你使用牌选择目标时，若弃牌堆中没有与此牌名称相同的牌，则你可以为此牌增加一个目标（无距离限制）。",
  xinlianji: "连计",
  xinlianji_info:
    "出牌阶段限一次，你可以弃置一张手牌，令一名角色使用牌堆中的一张随机武器牌。然后其选择一项：对你指定的一名角色使用一张【杀】，或令你将其装备区里的武器牌交给任意角色。",
  xinmoucheng: "谋逞",
  xinmoucheng_info:
    "觉醒技，准备阶段，若有角色因你发动〖连计〗使用【杀】而造成过伤害，则你失去〖连计〗并获得〖矜功〗。",
  xinjingong: "矜功",
  xinjingong_backup: "矜功",
  xinjingong_info:
    "出牌阶段限一次，你可以将一张【杀】或装备牌当做三张随机锦囊牌中的一张使用。",
  caiyang: "蔡阳",
  yinka: "印卡",
  zhangling: "张陵",
  zlhuji: "虎骑",
  zlhuji_info:
    "锁定技，你与其他角色的距离-1，当你于回合外受到伤害后，你可进行判定，若结果为红色，视为你对伤害来源使用一张【杀】（无距离限制）。",
  zlshoufu: "授符",
  zlshoufu2: "授符",
  zlshoufu_info:
    "出牌阶段限一次，你可摸一张牌，然后将一张手牌置于一名没有【箓】的角色的武将牌上，称为【箓】；其不能使用和打出与【箓】同类型的牌。该角色受到伤害后，或于弃牌阶段弃置至少两张与【箓】同类型的牌后，将【箓】置入弃牌堆。",
  ol_zhangchangpu: "OL张昌蒲",
  olxingshen: "省身",
  olxingshen_info:
    "当你受到伤害后，你可以随机摸至多两张牌。若如此做，你获得X个“省”，且下一次发动〖严教〗展示牌时移去所有“省”并多展示等量的牌。（X为你已损失的体力值，且你至多拥有6个“省”）",
  caoshuang: "曹爽",
  tuogu: "托孤",
  tuogu_info:
    "限定技，一名角色死亡时，你可以令其选择其武将牌上的一个技能（主公技，限定技，觉醒技，隐匿技、使命技等特殊技能除外），然后你获得其选择的技能。",
  retuogu: "托孤",
  retuogu_info:
    "一名角色死亡时，你可以令其选择其武将牌上的一个技能（主公技，限定技，觉醒技，隐匿技、使命技等特殊技能除外），然后你获得其选择的技能并失去上次因〖托孤〗获得的技能。",
  shanzhuan: "擅专",
  shanzhuan_info:
    "当你对其他角色造成伤害后，若其判定区没有牌，则你你可以将其的一张牌置于其的判定区。若此牌不为延时锦囊牌且此牌为：红色，此牌视为【乐不思蜀】；黑色，此牌视为【兵粮寸断】。回合结束时，若你本回合内未造成伤害，你可摸一张牌。",
  spniluan: "逆乱",
  spniluan_info:
    "出牌阶段，你可以将一张黑色牌当做【杀】使用。此【杀】使用结算完成后，若你未因此【杀】造成过伤害，则你令此【杀】不计入使用次数。",
  spweiwu: "违忤",
  spweiwu_info:
    "出牌阶段限一次，你可以将一张红色牌当做【顺手牵羊】对手牌数不小于你的角色使用。",
  spmouzhu: "谋诛",
  spmouzhu_backup: "谋诛",
  spmouzhu_info:
    "出牌阶段限一次，你可以选择任意名“距离为1”或“体力值等于你”的其他角色，这些角色依次进行以下结算：交给你一张手牌，然后若其手牌数小于你，则其视为对你使用一张【杀】或【决斗】。",
  spyanhuo: "延祸",
  spyanhuo_info:
    "当你死亡时，你可增加如下全局技能：当有角色使用【杀】时，此【杀】的伤害值基数+1。",
  xiaoxi: "骁袭",
  xiaoxi_info: "当你登场时，你可以视为使用一张【杀】。",
  quyi: "OL麴义",
  wolongfengchu: "卧龙凤雏",
  youlong: "游龙",
  youlong_info:
    "转换技，阴，每轮限一次，你可以废除你的一个装备栏，视为使用一张未以此法使用过的普通锦囊牌；阳，每轮限一次，你可以废除你的一个装备栏，视为使用一张未以此法使用过的基本牌。",
  luanfeng: "鸾凤",
  //luanfeng_info_fullinfo:'限定技，一名角色进入濒死状态时，若其体力上限不小于你，你可令其回复至3点体力，恢复其被废除的装备栏，令其手牌补至6-X张（X为以此法恢复的装备栏数量），重置其因“改写”使用过的牌名。若该角色是你，重置你因“游龙”使用过的牌名。',
  luanfeng_info:
    "限定技，一名角色进入濒死状态时，若其体力上限不小于你，你可令其回复至3点体力，恢复其被废除的装备栏，令其手牌补至6-X张（X为以此法恢复的装备栏数量）。若该角色是你，重置你因“游龙”使用过的牌名。",
  ol_xinxianying: "辛宪英",
  reluanzhan: "乱战",
  reluanzhan_add: "乱战",
  reluanzhan_remove: "乱战",
  reluanzhan_info:
    "当你受到或造成伤害后，你获得一个“乱”。当你使用【杀】或黑色普通锦囊牌选择目标后，你可为此牌增加至多X个目标。当你使用这些牌指定第一个目标后，若此牌目标数小于X，则你移去X/2（向上取整）个“乱”。（X为“乱”数）",
  zhuixi: "追袭",
  zhuixi_info: "锁定技，你使用【杀】的次数上限+1。",
  reduanbing: "短兵",
  reduanbing_info:
    "你使用【杀】选择目标后，可以为此【杀】增加一名距离为1的额外目标。你对距离为1的角色使用的【杀】需两张【闪】才能抵消。",
  refenxun: "奋迅",
  refenxun2: "奋迅",
  refenxun_info:
    "出牌阶段限一次，你可以选择一名其他角色，然后本回合你计算与其的距离视为1；结束阶段开始时，若你未对其造成过伤害，你弃一张牌。",
  zongyu: "宗预",
  zyqiao: "气傲",
  zyqiao_info:
    "每回合限两次。当你成为其他角色使用牌的目标后，你可以弃置其一张牌，然后你弃置一张牌。",
  zyqiao_info_guozhan:
    "每回合限两次。当你成为其他势力的角色使用牌的目标后，你可以弃置其一张牌，然后你弃置一张牌。",
  chengshang: "承赏",
  chengshang_info:
    "当你于出牌阶段内使用的牌结算完成后，若此牌未造成过伤害且此牌的目标包含其他角色且你本阶段内未因〖承赏〗获得过牌，则你可以从牌堆中获得一张与此牌花色点数相同的牌。",
  chengshang_info_guozhan:
    "当你于出牌阶段内使用的牌结算完成后，若此牌未造成过伤害且此牌的目标包含其他角色且你本阶段内未因〖承赏〗获得过牌，则你可以从牌堆中获得一张与此牌花色点数相同的牌。",
  sp_fuwan: "SP伏完",
  spfengyin: "奉印",
  spfengyin_info:
    "其他角色的回合开始时，若其体力值不少于你，你可以交给其一张【杀】，令其跳过出牌阶段和弃牌阶段。",
  spchizhong: "持重",
  spchizhong_info:
    "锁定技，你的手牌上限等于体力上限；其他角色死亡时，你加1点体力上限。",
  sp_fuhuanghou: "SP伏寿",
  spcangni: "藏匿",
  spcangni_info:
    "弃牌阶段开始时，你可以回复1点体力或摸两张牌，然后将你的武将牌翻面；其他角色的回合内，当你获得（每回合限一次）/失去一次牌时，若你的武将牌背面朝上，你可以令该角色摸/弃置一张牌。",
  spmixin: "密信",
  spmixin_info:
    "出牌阶段限一次，你可以将一张手牌交给一名其他角色，该角色须对你选择的另一名角色使用一张无距离限制的【杀】，否则你选择的角色观看其手牌并获得其中一张。",
  sp_jiben: "SP吉本",
  spduanzhi: "断指",
  spduanzhi_info:
    "当你成为其他角色使用的牌的目标后，你可以弃置其至多两张牌，然后失去1点体力。",
  spduyi: "毒医",
  spduyi2: "毒医",
  spduyi_info:
    "出牌阶段限一次，你可以亮出牌堆顶的一张牌并交给一名角色，若此牌为黑色，该角色不能使用或打出手牌，直到回到结束。",
  panshu: "潘淑",
  weiyi: "威仪",
  weiyi_info:
    "每名角色限一次。当有角色受到伤害后，你可选择：①若其体力值不小于你，则其失去1点体力。②若其体力值不大于你且其已受伤，则其回复1点体力。",
  jinzhi: "锦织",
  jinzhi2: "锦织",
  jinzhi_info:
    "当你需要使用或打出一张基本牌时，你可弃置X张牌并摸一张牌。若你以此法弃置的牌均为同一颜色，则视为你使用或打出了此牌。（X为你于本轮内发动此技能的次数）",
  yanxiao_card: "言笑",
  yanxiao_global: "言笑",
  yanxiao_card_info: "判定阶段开始时，你获得判定区内的所有牌。",
  huangzu: "OL黄祖",
  wangong: "挽弓",
  wangong2: "挽弓",
  wangong_info:
    "锁定技，当你使用基本牌时，你获得如下效果：当你使用下一张牌时，若此牌为【杀】，则此牌无次数和距离限制且伤害+1。",
  huangchengyan: "黄承彦",
  guanxu: "观虚",
  guanxu_info:
    "出牌阶段限一次，你可以观看一名其他角色的手牌，然后你可将其中一张手牌与牌堆顶5张牌中的一张交换。若如此做，你弃置其手牌中3张花色相同的牌。",
  yashi: "雅士",
  yashi_info:
    "当你受到一次伤害后，你可选择一项：1. 令伤害来源的非锁定技无效直到其下个回合开始；2. 对一名其他角色发动〖观虚〗。",
  olwuniang: "武娘",
  olwuniang_info:
    "每回合限一次，当你于回合内使用的【杀】结算完成后，若此【杀】对应的目标数为1，则你可以令目标角色选择是否对你使用使用【杀】。你于其选择结算完成后摸一张牌，且本回合内使用【杀】的次数上限+1。",
  olxushen: "许身",
  olxushen_info:
    "限定技，当你进入濒死状态时，你可将体力回复至1点并获得技能〖镇南〗。然后若场上没有存活的“关索”，则你可以令一名其他男性角色选择是否将一张武将牌替换为“关索”。",
  olzhennan: "镇南",
  olzhennan2: "镇南",
  olzhennan_info:
    "【南蛮入侵】对你无效。出牌阶段限一次，你可以将任意张手牌当做【南蛮入侵】对等量的角色使用。",
  gaogan: "高干",
  juguan: "拒关",
  juguan_backup: "拒关",
  juguan_info:
    "出牌阶段限一次，你可将一张手牌当【杀】或【决斗】使用。若受到此牌伤害的角色未在你的下回合开始前对你造成过伤害，你的下个摸牌阶段摸牌数+2。",
  duxi: "杜袭",
  quxi: "驱徙",
  quxi_info:
    "限定技。出牌阶段结束时，你可跳过下个弃牌阶段并选择两名手牌数不同的其他角色。你将武将牌翻至背面，令这两名角色中手牌数较少的角色获得另一名角色的一张牌并获得一枚“丰”，另一名角色获得一枚“歉”。拥有“丰”/“歉”的角色的摸牌阶段额定摸牌数+1/-1。拥有“丰”/“歉”的角色死亡时，或一轮游戏开始时，你可转移“丰”/“歉”。",
  bixiong: "避凶",
  bixiong2: "避凶",
  bixiong_info:
    "锁定技，当你于弃牌阶段弃置手牌后，你不能成为与这些牌花色相同的牌的目标直到你下回合开始。",
  fuwei: "扶危",
  fuwei_info:
    "每回合限一次。当你的牌被其他角色弃置或获得后，你可从牌堆中获得一张与此牌名称相同的牌（若没有则改为摸一张牌）。",
  yuejian: "约俭",
  yuejian_info:
    "每回合限两次。当其他角色对你使用的牌A结算结束后，你可展示所有手牌。若牌A有花色且你的手牌中没有同花色的牌，则你获得牌A对应的所有实体牌。",
  ol_dengzhi: "OL邓芝",
  olxiuhao: "修好",
  olxiuhao_info:
    "每回合限一次。当你受到其他角色造成的伤害时，或对其他角色造成伤害时，你可防止此伤害，然后令伤害来源摸两张牌。",
  olsujian: "素俭",
  olsujian_given: "已分配",
  olsujian_info:
    "锁定技。弃牌阶段开始前，你跳过此阶段。然后你选择一项：①将所有不为本回合获得的手牌分配给其他角色。②弃置这些手牌，然后弃置一名其他角色等量的牌。",
  ol_wangrong: "OL王荣",
  olfengzi: "丰姿",
  olfengzi_info:
    "出牌阶段限一次。当你使用有目标的基本牌或普通锦囊牌时，你可弃置一张与此牌类型相同的牌，然后令此牌结算两次。",
  oljizhan: "吉占",
  oljizhan_info:
    "摸牌阶段开始时，你可以放弃摸牌。你展示牌堆顶的一张牌，并猜测牌堆顶的下一张牌点数大于或小于此牌。若你猜对，你可继续重复此流程。然后你获得以此法展示的所有牌。",
  olfusong: "赋颂",
  olfusong_info:
    "当你死亡时，你可以选择一名体力上限大于你的其他角色。其选择获得〖吉占〗或〖丰姿〗。",
  zuofen: "左棻",
  zhaosong: "诏颂",
  zhaosong_info:
    "一名其他角色的摸牌阶段结束时，若其没有因〖诏颂〗而获得的标记，则你可令其正面向上交给你一张手牌。根据此牌的类型，该角色获得对应的标记和效果：<br>锦囊牌：“诔”标记。当拥有者进入濒死状态时，其可弃置所有“诔”，将体力回复至1点并摸1张牌。<br>装备牌：“赋”标记。拥有者的出牌阶段开始时，其可弃置所有“赋”，弃置一名角色区域内的至多两张牌。<br>基本牌：“颂”标记。当使用者使用仅指定一个目标的【杀】时，其可弃置“颂”，为此【杀】增加至多两个目标。",
  lisi: "离思",
  lisi_info:
    "当你于回合外使用的牌结算结束后，你可将其交给一名手牌数不大于你的其他角色。",
  ol_yangyi: "杨仪",
  oljuanxia: "狷狭",
  oljuanxia_info:
    "锁定技。结束阶段，你选择一名其他角色。你依次视为对其使用至多三种单目标普通锦囊牌。然后其下回合结束时，可视为对你使用等量的【杀】。",
  oldingcuo: "定措",
  oldingcuo_info:
    "每回合限一次。当你受到或造成伤害后，你可摸两张牌。若这两张牌颜色不同，则你弃置一张手牌。",
  fengfangnv: "OL冯妤",
  zhuangshu: "妆梳",
  zhuangshu_info:
    "①游戏开始时，你可将{【琼梳】，【犀梳】，【金梳】}中的一张牌置于装备区。②一名角色的回合开始时，若其宝物区为空，则你可以弃置一张牌，并根据此牌的类型，按如下关系将一张宝物牌置入该角色的装备区：{<基本牌,【琼梳】>，<锦囊牌，【犀梳】>，<装备牌，【金梳】>}。",
  chuiti: "垂涕",
  chuiti_info:
    "每回合限一次。当你或拥有〖妆梳〗牌角色的牌因弃置而进入弃牌堆后，你可使用其中的一张牌。",
  zhuangshu_basic: "琼梳",
  zhuangshu_basic_bg: "琼",
  zhuangshu_basic_info:
    "当你受到伤害时，你可以弃置X张牌并防止此伤害（X为伤害值）。当此牌不因交换装备或移动至其他装备区而离开你的装备区后，销毁之。",
  zhuangshu_trick: "犀梳",
  zhuangshu_trick_bg: "犀",
  zhuangshu_trick_info:
    "判定阶段开始前，你可选择：①跳过此阶段。②跳过本回合的弃牌阶段。当此牌不因交换装备或移动至其他装备区而离开你的装备区后，销毁之。",
  zhuangshu_equip: "金梳",
  zhuangshu_equip_bg: "金",
  zhuangshu_equip_info:
    "锁定技。出牌阶段结束时，你将手牌摸至手牌上限（至多摸五张）。当此牌不因交换装备或移动至其他装备区而离开你的装备区后，销毁之。",
  ol_dongzhao: "董昭",
  olxianlve: "先略",
  olxianlve_info:
    "①主公的回合开始时，你可声明并记录一个锦囊牌的名称并移除先前的记录。②每回合限一次，其他角色使用〖先略〗记录过的锦囊牌后，你可摸两张牌并可以分配给任意其他角色，然后你可声明并记录一个锦囊牌的名称并移除先前的记录。",
  olzaowang: "造王",
  olzaowang2: "造王",
  olzaowang_info:
    "限定技。出牌阶段，你可以令一名角色加1点体力上限，回复1点体力并摸三张牌，且获得如下效果：主公死亡时，若其身份为忠臣，则其和主公交换身份牌；其死亡时，若其身份为反贼且伤害来源的身份为主公或忠臣，则以主忠胜利结束本局游戏。",
  sp_ol_zhanghe: "SP张郃",
  spolzhouxuan: "周旋",
  spolzhouxuan_info:
    "①弃牌阶段开始时，你可将至多五张置于武将牌上，称为“旋”。②当你使用牌时，你摸一张牌并将一张“旋”置入弃牌堆（若你的手牌数不为全场唯一最多则改为摸X张牌，X为“旋”数）。③出牌阶段结束时，你将所有“旋”置入弃牌堆。",
  wuyan: "吾彦",
  lanjiang: "澜疆",
  lanjiang_info:
    "结束阶段，你可以选择所有手牌数不小于你的角色。这些角色依次选择是否令你摸一张牌。然后你可以对其中一名手牌数等于你的角色造成1点伤害，随后可以对其中一名手牌数小于你的角色摸一张牌。",
  ol_zhuling: "OL朱灵",
  jixian: "急陷",
  jixian_info:
    "摸牌阶段结束时，你可以选择一名满足以下至少一项条件的角色：⒈装备区内有防具牌；⒉拥有的普通技能数大于你；⒊体力值等于体力上限。你视为对其使用一张【杀】，然后摸X张牌（X为其于此【杀】结算前满足的条件数）；若此【杀】未造成伤害，则你失去1点体力。",
  ol_chendeng: "OL陈登",
  olfengji: "丰积",
  olfengji_info:
    "摸牌阶段开始时，你选择：⒈本回合摸牌阶段的额定摸牌数-1，且令一名其他角色下回合摸牌阶段的额定摸牌数+2；⒉本回合摸牌阶段的额定摸牌数+1。然后你选择：⒈本回合使用【杀】的次数上限-1，且令一名其他角色下回合使用【杀】的次数上限+2；⒉本回合使用【杀】的次数上限+1。",
  tianyu: "田豫",
  saodi: "扫狄",
  saodi_info:
    "当你使用【杀】或普通锦囊牌指定唯一其他角色为目标时，你可从逆时针方向和顺时针方向中选择一个你与其之间角色最少的方向。你令该方向下你与其之间的所有能成为此牌额外目标的角色均成为此牌的目标。",
  zhuitao: "追讨",
  zhuitao_info:
    "①准备阶段，你可选择一名未被〖追讨〗记录过的其他角色。②你至所有〖追讨〗记录过的角色的距离-1。③当你对一名被〖追讨〗记录过的角色造成伤害时，你从〖追讨〗记录里移除该角色。",
  fanjiangzhangda_ab: "范疆张达",
  fanjiangzhangda: "范强张达",
  yuanchou: "怨仇",
  yuanchou_info:
    "锁定技。当你使用黑色【杀】指定目标角色后或成为黑色【杀】的目标角色后，你令目标角色的防具技能无效直到此【杀】被抵消或造成伤害。",
  juesheng: "决生",
  juesheng_info:
    "限定技。出牌阶段，你可视为使用一张【决斗】。当你因此【决斗】造成伤害时，你将伤害值改为X（X为目标角色本局游戏内使用过【杀】的数量）且令目标角色获得此技能直到其下回合结束。",
  qinghegongzhu: "清河公主",
  zengou: "谮构",
  zengou_info:
    "当有角色使用【闪】时，若其在你的攻击范围内，则你可以弃置一张非基本牌或失去1点体力，然后取消此【闪】的目标并获得其对应的实体牌。",
  qhzhangji: "长姬",
  qhzhangji_info:
    "一名角色的回合结束时，若你本回合内：造成过伤害，则你可以令其摸两张牌；受到过伤害，则你可以令其弃置两张牌。",
  sp_menghuo: "SP孟获",
  spmanwang: "蛮王",
  spmanwang_info:
    "出牌阶段，你可以弃置任意张牌。然后你依次执行以下选项中的前X项：⒈获得〖叛侵〗。⒉摸一张牌。⒊回复1点体力。⒋摸两张牌并失去〖叛侵〗。",
  sppanqin: "叛侵",
  sppanqin_info:
    "出牌阶段或弃牌阶段结束时，你可将你于本阶段内弃置且位于弃牌堆的所有牌当做【南蛮入侵】使用。然后若此牌对应的实体牌数不大于此牌的目标数，则你执行并移除〖蛮王〗中的最后一个选项。",
  tengfanglan: "滕芳兰",
  luochong: "落宠",
  luochong_info:
    "准备阶段开始时/当你于一回合内首次受到伤害后，你可选择本轮内未选择过的一项（每名角色每轮限选一次）：⒈令一名角色回复1点体力。⒉令一名角色失去1点体力。⒊令一名角色弃置两张牌。⒋令一名角色摸两张牌。",
  aichen: "哀尘",
  aichen_info:
    "锁定技。当你进入濒死状态时，若〖落宠〗中的剩余选项数大于1，则你选择移去〖落宠〗中的一个选项。",
  weizi: "卫兹",
  yuanzi: "援资",
  yuanzi_info:
    "每轮限一次。其他角色的准备阶段开始时，你可将所有手牌交给该角色。若如此做，当该角色于本回合内造成伤害后，若其手牌数不小于你，则你摸两张牌。",
  liejie: "烈节",
  liejie_info:
    "当你受到伤害后，你可以弃置至多三张牌，摸等量的牌，然后可弃置伤害来源的至多X张牌（X为你以此法弃置的红色牌的数量）。",
  ruiji: "芮姬",
  qiaoli: "巧力",
  qiaoli_info:
    "①你可以将一张装备牌当做【决斗】使用。若此【决斗】对应的实体牌：为武器牌，当你以此法声明使用【决斗】时，你摸X张牌（X为此牌的攻击范围），且可以将其中任意张牌分配给其他角色；不为武器牌，此牌不可被响应。②结束阶段开始时，若你于本回合内发动过〖巧力①〗，则你从牌堆中获得一张装备牌。",
  qiaoli_given: "已分配",
  qingliang: "清靓",
  qingliang_info:
    "每回合限一次。当你成为其他角色使用牌的目标时，你可展示所有手牌，然后选择一项：⒈你与其各摸一张牌，⒉取消此目标，然后弃置你手牌中一种花色的所有牌。",
  chixueqingfeng: "赤血青锋",
  chixueqingfeng2: "赤血青锋",
  chixueqingfeng_info:
    "锁定技，当你使用【杀】指定目标后，你令目标角色不能使用或打出手牌且防具技能无效直到此【杀】结算结束。",
  wushuangfangtianji: "无双方天戟",
  wushuangfangtianji_skill: "无双方天戟",
  wushuangfangtianji_info:
    "当你因执行【杀】的效果而造成伤害后，你可选择一项：⒈摸一张牌；⒉弃置目标角色的一张牌。",
  guilongzhanyuedao: "鬼龙斩月刀",
  guilongzhanyuedao_info: "锁定技，你使用的红色【杀】不可被响应。",
  bintieshuangji: "镔铁双戟",
  bintieshuangji_skill: "镔铁双戟",
  bintieshuangji_info:
    "当你使用的【杀】被抵消后，你可失去1点体力。获得此【杀】对应的所有实体牌，摸一张牌，且本回合使用【杀】的次数上限+1。",
  linglongshimandai: "玲珑狮蛮带",
  linglongshimandai_info:
    "当你成为其他角色使用的牌的唯一目标后，你可以进行判定。若判定结果为♥，则此牌对你无效。",
  linglongshimandai_skill: "玲珑狮蛮带",
  hongmianbaihuapao_skill: "红棉百花袍",
  hongmianbaihuapao: "红棉百花袍",
  hongmianbaihuapao_info: "锁定技，当你受到属性伤害时，防止此伤害。",
  qimenbagua: "奇门八卦",
  qimenbagua_info: "锁定技，【杀】对你无效。",
  guofengyupao: "国风玉袍",
  guofengyupao_info: "锁定技，你不是其他角色使用普通锦囊牌的合法目标。",
  shufazijinguan: "束发紫金冠",
  shufazijinguan_skill: "束发紫金冠",
  shufazijinguan_info: "准备阶段，你可以对一名其他角色造成1点伤害。",
  sanlve: "三略",
  sanlve_skill: "三略",
  sanlve_info:
    "锁定技。你的攻击范围+1。你的手牌上限+1。你使用【杀】的次数上限+1。",
  zhaogujing: "照骨镜",
  zhaogujing_skill: "照骨镜",
  zhaogujing_info:
    "出牌阶段结束时，你可展示手牌中的一张基本牌或普通锦囊牌，然后你视为使用一张牌名和属性与此牌相同的牌。",
  xuwangzhimian: "虚妄之冕",
  xuwangzhimian_info: "锁定技，摸牌阶段，你令额定摸牌数+2；你的手牌上限-1。",
  ol_puyuan: "OL蒲元",
  olshengong: "神工",
  olshengong_info:
    "出牌阶段每项限一次。你可以弃置一张武器牌/防具牌/其他装备牌，并发起一次“锻造”。然后你从锻造结果中选择一张牌，置于一名角色的装备区内（可替换原装备）。当有因你发动〖神工〗而加入游戏的牌进入弃牌堆后，你将此牌移出游戏，然后你于当前回合结束后摸一张牌。",
  olqisi: "奇思",
  olqisi_info:
    "①游戏开始时，你获得两张副类别不同的牌，并将这些牌置入你的装备区。②摸牌阶段开始时，你可以少摸一张牌并声明一种装备牌的副类别，然后从牌堆或弃牌堆中获得一张该副类别的牌。",
  olzhuiji: "追击",
  olzhuiji_info:
    "锁定技。①你至体力值不大于你的角色的距离为1。②当你使用【杀】指定距离为1的角色为目标后，你令其选择一项：⒈弃置一张牌。⒉重铸装备区内的所有牌。",
  zhaoyǎn: "赵俨",
  tongxie: "同协",
  tongxie_info:
    "出牌阶段开始时，你可以选择至多两名其他角色（你与这些角色均称为“同协角色”）。这些角色中手牌数唯一最少的角色摸一张牌，且你获得如下效果直到你下回合开始：①当有“同协角色”对唯一目标角色使用的【杀】结算结束后，其他“同协角色”可以依次对目标角色使用一张【杀】（无距离和次数限制，且不能再触发此效果）。②当有“同协角色”受到伤害时，其他“同协角色”（本回合内失去过体力的角色除外）可以防止此伤害，失去1点体力。",
  jin_zhouchu: "周处",
  shanduan: "善断",
  shanduan_info:
    "①回合开始时，你生成数组R=[1,2,3,4]。②摸牌阶段开始时，你从数组R中选择并移除一个数字A。你本阶段的额定摸牌数改为A。③出牌阶段开始时，你从数组R中选择并移除两个数字B和C。你将你本阶段内的攻击范围基数最小值和使用【杀】的次数上限基础值改为B和C。④弃牌阶段开始时，你从数组R中选择并移除一个数字D。你令你本回合的手牌上限基数改为D。⑤当你于回合外受到伤害后，你令下回合生成的R中最小的一个数字+1。",
  yilie: "义烈",
  yilie_info:
    "每轮每种牌名限一次。你可以将两张颜色相同的手牌当做任意一种基本牌使用。",
  caoxiancaohua: "曹宪曹华",
  huamu: "化木",
  huamu_info:
    "当你使用手牌后，若此牌和本回合内上一张被使用的牌颜色不同，则你可以将此牌对应的所有{位于处理区或装备区}的实体牌置于你的武将牌上。这些牌中的黑色牌称为“灵杉”，红色牌称为“玉树”。",
  qianmeng: "前盟",
  qianmeng_info:
    "锁定技。当有牌移动事件结算结束后，若有角色的“灵杉”和“玉树”数量发生了变化，且二者数量相等或有一项为0，则你摸一张牌",
  liangyuan: "良缘",
  liangyuan_info:
    "每轮每项各限一次。你可以将场上所有的“灵杉”/“玉树”置于处理区，然后将这些牌当做【酒】/【桃】使用。",
  jisi: "羁肆",
  jisi_info:
    "限定技。准备阶段，你可以令一名其他角色获得你武将牌上的一个已发动过的其他技能。然后你弃置所有手牌，并视为对其使用一张【杀】（无距离关系的限制）。",
  huojun: "霍峻",
  qiongshou: "穷守",
  qiongshou_info:
    "锁定技。①游戏开始时，你废除所有装备栏并摸四张牌。②你的手牌上限+4。",
  fenrui: "奋锐",
  fenrui_info:
    "结束阶段，你可以弃置一张牌并恢复一个装备栏。系统检索一张对应的装备牌，你使用之。然后你可以选择一名装备区内牌数小于你的其他角色，对其造成X点伤害（X为你与其装备区内的牌数之差，且每局限一次）。",

  sp_tianji: "天极·皇室宗亲",
  sp_sibi: "四弼·辅国文曲",
  sp_tianzhu: "天柱·势冠一方",
  sp_nvshi: "女史·留史巾帼",
  sp_shaowei: "少微·能人异士",
  sp_huben: "虎贲·勇冠三军",
  sp_liesi: "列肆·豪商巨贾",
  sp_default: "天同·同名异势",
  sp_qifu: "灯愿·祈福武将",
  sp_wanglang: "八萬·饶舌凤鹛",
  sp_tongque: "铜雀台",
  sp_zhongdan: "忠胆英杰",
  sp_guozhan: "国战",
  sp_guozhan2: "国战移植",
  sp_others: "其他",
  sp_single: "新1v1",
};
export const translate_sp2 = {
  lijue: "李傕",
  zhangji: "张济",
  fanchou: "樊稠",
  guosi: "郭汜",
  lvkai: "吕凯",
  zhanggong: "张恭",
  weiwenzhugezhi: "卫温诸葛直",
  xurong: "徐荣",
  zhangqiying: "张琪瑛",
  sp_liuqi: "刘琦",
  xf_tangzi: "唐咨",
  xf_huangquan: "黄权",
  xf_sufei: "苏飞",
  xinfu_langxi: "狼袭",
  xinfu_langxi_info:
    "准备阶段，你可以对一名体力小于或等于你的其他角色造成0～2点随机伤害。",
  xinfu_yisuan: "亦算",
  xinfu_yisuan_info:
    "每回合限一次。当你于出牌阶段使用的锦囊牌结算结束后，你可以减1点体力上限并获得此牌对应的所有实体牌。",
  xinfu_xingluan: "兴乱",
  xinfu_xingluan_info:
    "每回合限一次。当你于出牌阶段使用的仅指定一个目标的牌结算完成后，你可以从牌堆中随机获得一张点数为6的牌。",
  xinfu_lveming: "掠命",
  xinfu_lveming_info:
    "出牌阶段限一次，你可以选择一名装备区装备比你少的角色，令其选择一个点数，然后你进行判定：<br>若点数相同，你对其造成2点伤害；<br>若点数不同，则你随机获得其区域内的一张牌。",
  xinfu_tunjun: "屯军",
  xinfu_tunjun_info:
    "限定技，出牌阶段，你可以选择一名角色，令其随机使用牌堆中的X张装备牌。(X为你发动过“掠命”的次数)",
  xinfu_tanbei: "贪狈",
  xinfu_tanbei_info:
    "出牌阶段限一次，你可以令一名其他角色选择一项：1.令你随机获得其区域内的一张牌，本回合内你不能对其使用牌。2.令你此回合内对其使用牌没有次数与距离限制。",
  xinfu_sidao: "伺盗",
  xinfu_sidaox: "伺盗",
  xinfu_sidao_info:
    "出牌阶段限一次，当你对一名其他角色连续使用两张牌后，你可以将一张手牌当做【顺手牵羊】对其使用。",
  tanbei_effect1: "贪狈",
  tanbei_effect1_info: "",
  tanbei_effect2: "贪狈",
  tanbei_effect2_info: "",

  xinfu_tunan: "图南",
  xinfu_tunan_info:
    "出牌阶段限一次，你可以展示牌堆顶的一张牌并选择一名其他角色，然后该角色选择一项：使用此牌（无距离限制）；或将此牌当普通【杀】使用。",
  xinfu_bijing: "闭境",
  xinfu_bijing_info:
    "结束阶段，你可以选择一张手牌并标记为“闭境”。若你于回合外失去“闭境”牌，则当前回合角色的弃牌阶段开始时，其需弃置两张牌。你的准备阶段，弃置手牌中的“闭境”牌。",
  xinfu_zhenxing: "镇行",
  xinfu_zhenxing_info:
    "结束阶段开始时或当你受到伤害后，你可以观看牌堆顶的至多三张牌，然后你获得其中与其余牌花色均不相同的一张牌。",
  xinfu_qianxin: "遣信",
  xinfu_qianxin_info:
    "出牌阶段限一次，若牌堆中没有“信”，你可以选择一名角色并将任意张手牌放置于牌堆中X倍数的位置（X为存活人数），称为“信”。该角色的弃牌阶段开始时，若其手牌区内有于本回合内获得过的“信”，其选择一项：令你将手牌摸至四张；本回合手牌上限-2。",
  qianxin_effect: "遣信",
  qianxin_effect_info: "",
  xinfu_qianxin2: "遣信",
  xinfu_qianxin2_info: "",

  xinfu_fuhai: "浮海",
  xinfu_fuhai_info:
    "出牌阶段每个方向限一次，你可以展示一张手牌并选择上家或下家。该角色展示一张手牌，若你展示的牌点数大于等于其展示的牌点数，你弃置你展示的牌，然后继续对其上家或下家重复此流程；若你展示的牌点数小于该展示角色牌的点数，则该角色弃置其展示的牌，然后你与其各摸X张牌（X为你此回合内发动此技能选择的角色数），且你此阶段内不能再发动〖浮海〗。",
  fuhai_clear: "浮海",
  fuhai_clear_info: "",

  xz_xunxun: "恂恂",
  xz_xunxun_info:
    "摸牌阶段，你可以观看牌堆顶的四张牌，然后将其中的两张牌置于牌堆顶，并将其余的牌以任意顺序置于牌堆底。",
  xinfu_xingzhao: "兴棹",
  xinfu_xingzhao_info:
    "锁定技，若X≥1，你视为拥有技能〖恂恂〗。若X≥2，当你使用装备牌时，你摸一张牌。若X≥3，弃牌阶段开始时，你跳过此阶段。（X为场上已受伤的角色数）",
  xinfu_xingzhao2: "兴棹",
  xinfu_xingzhao2_info: "",
  xinfu_dianhu: "点虎",
  xinfu_dianhu_info:
    "锁定技，游戏开始时，你选择一名其他角色。当其受到来自你的伤害后或回复体力后，你摸一张牌。",
  xinfu_dianhu2: "点虎",
  xinfu_dianhu2_info: "",
  xinfu_jianji: "谏计",
  xinfu_jianji_info:
    "出牌阶段限一次，你可以令一名其他角色摸一张牌。然后该角色可以使用此牌。",
  xinfu_lianpian: "联翩",
  xinfu_lianpian_info:
    "出牌阶段限三次。当你对一名角色连续使用牌时，你可以摸一张牌，然后可以将一张牌交给该角色。",
  spwenji: "问计",
  spwenji_info:
    "出牌阶段开始时，你可以令一名其他角色交给你一张牌。你于本回合内使用与该牌名称相同的牌时不能被其他角色响应。",
  rewenji: "问计",
  rewenji_info:
    "出牌阶段开始时，你可以令一名其他角色交给你一张牌。你于本回合内使用与该牌类型相同的牌时不能被其他角色响应。",
  sptunjiang: "屯江",
  sptunjiang_info:
    "结束阶段，若你未于本回合的出牌阶段内使用牌指定过其他角色为目标，则你可以摸X张牌（X为全场势力数）。",
  zongkui: "纵傀",
  zongkui_mark: "纵傀",
  zongkui_mark_bg: "傀",
  zongkui_info:
    "回合开始时，你可以指定一名未拥有“傀”标记的其他角色，令其获得一枚“傀”标记。每轮游戏开始时，你指定一名体力值最少且没有“傀”标记的其他角色，令其获得一枚“傀”标记。",
  guju: "骨疽",
  guju_info: "锁定技，拥有“傀”标记的角色受到伤害后，你摸一张牌。",
  baijia: "拜假",
  baijia_info:
    "觉醒技，准备阶段，若你因〖骨疽〗获得的牌不少于7张，则你增加1点体力上限，回复1点体力，然后令所有未拥有“傀”标记的其他角色获得“傀”标记，最后失去技能〖骨疽〗，并获得技能〖蚕食〗。",
  bmcanshi: "蚕食",
  bmcanshi_info:
    "一名角色使用基本牌或普通锦囊牌指定你为唯一目标时，若其有“傀”标记，你可以取消之，然后其失去“傀”标记；你使用牌仅指定一名角色为目标时，你可以额外指定任意名带有“傀”标记的角色为目标（无距离限制），然后这些角色失去“傀”标记。",

  xinpi: "辛毗",
  lisu: "李肃",
  zhangwen: "张温",
  puyuan: "蒲元",
  xushao: "许劭",
  mangyachang: "忙牙长",
  xugong: "许贡",
  zhangchangpu: "张昌蒲",
  guanlu: "管辂",
  gexuan: "葛玄",

  tuiyan: "推演",
  tuiyan_info: "出牌阶段开始时，你可以观看牌堆顶的三张牌。",
  busuan: "卜算",
  busuan_info:
    "出牌阶段限一次，你可以选择一名其他角色，然后选择至多两张不同的卡牌名称（限基本牌或锦囊牌）。该角色下次摸牌阶段摸牌时，改为从牌堆或弃牌堆中获得你选择的牌。",
  busuan_angelbeats: "卜算",
  mingjie: "命戒",
  mingjie_info:
    "结束阶段，你可以摸一张牌，若此牌为红色，你可以重复此流程直到摸到黑色牌或摸到第三张牌。当你以此法摸到黑色牌时，若你的体力值大于1，则你失去1点体力。",
  gxlianhua: "炼化",
  gxlianhua_info:
    "你的回合外，每当有其他角色受到伤害后，你获得一个“丹血”标记（该角色与你阵营一致时为红色，不一致为黑色，此颜色对所有玩家均不可见）直到你的准备阶段开始。准备阶段，根据你获得的“丹血”标记的数量和颜色，你从牌堆/弃牌堆中获得相应的牌以及相应技能直到回合结束。3枚或以下：〖英姿〗和【桃】；超过3枚且红色“丹血”较多：〖观星〗和【无中生有】；超过3枚且黑色“丹血”较多：〖直言〗和【顺手牵羊】；超过3枚且红色和黑色一样多：【杀】、【决斗】和〖攻心〗。",
  zhafu: "札符",
  zhafu_info:
    "	限定技，出牌阶段，你可以选择一名其他角色，令其获得一枚「札」。有「札」的角色弃牌阶段开始时，若其手牌数大于1，其移去「札」并选择保留一张手牌，然后将其余的手牌交给你。",
  pingjian: "评荐",
  pingjian_info:
    "结束阶段开始时/当你受到伤害后/出牌阶段限一次，你可以令系统随机从剩余武将牌堆中检索出三张拥有发动时机为结束阶段开始时/当你受到伤害后/出牌阶段的技能的武将牌。然后你可以选择尝试发动其中一个技能。每个技能每局只能选择一次。",
  pingjian_use: "评荐",
  pytianjiang: "天匠",
  pytianjiang_info:
    "游戏开始时，你随机获得两张不同副类别的装备牌，并置入你的装备区。出牌阶段，你可以将装备区的牌移动至其他角色的装备区（可替换原装备）。若你以此法移动了〖铸刃〗的衍生装备，你摸两张牌。",
  pytianjiang_move: "天匠",
  pyzhuren: "铸刃",
  pyzhuren_info:
    "出牌阶段限一次，你可以弃置一张手牌。根据此牌的花色点数，你有一定概率打造成功并获得一张武器牌（若打造失败或武器已有则改为摸一张【杀】，花色决定武器名称，点数决定成功率）。此武器牌进入弃牌堆时，将其移出游戏。",
  pyzhuren_destroy: "铸刃",
  pyzhuren_heart: "红缎枪",
  pyzhuren_heart_info:
    "每回合限一次，当你使用【杀】造成伤害后，你可以进行判定，若结果为：红色，你回复1点体力；黑色：你摸两张牌。",
  pyzhuren_diamond: "烈淬刀",
  pyzhuren_diamond_info:
    "每回合限两次，当你使用【杀】对目标角色造成伤害时，你可以弃置一张牌，令此伤害+1。你使用【杀】的次数上限+1。",
  pyzhuren_club: "水波剑",
  pyzhuren_club_info:
    "每回合限两次，当你使用普通锦囊牌或【杀】时，你可以为此牌增加一个目标。当你失去装备区里的【水波剑】后，你回复1点体力。",
  pyzhuren_spade: "混毒弯匕",
  pyzhuren_spade_info:
    "当你使用【杀】指定目标后，你可令其失去X点体力（X为此技能本回合内发动过的次数且至多为5）。",
  pyzhuren_shandian: "天雷刃",
  pyzhuren_shandian_info:
    "当你使用【杀】指定目标后，可令其进行判定，若结果为：黑桃，其受到3点雷属性伤害；梅花，其受到1点雷属性伤害，你回复1点体力并摸一张牌。",

  songshu: "颂蜀",
  songshu_info:
    "出牌阶段，你可以和其他角色拼点。若你没赢，你与其各摸两张牌，且你本阶段内不能再发动〖颂蜀〗。",
  sibian: "思辩",
  sibian_info:
    "摸牌阶段，你可以放弃摸牌，改为亮出牌堆顶的四张牌，然后获得其中所有点数最大与点数最小的牌，且可以将剩余的牌交给手牌数最少的角色。",
  lslixun: "利熏",
  lslixun_fate: "利熏",
  lslixun_info:
    "锁定技，当你受到伤害时，你防止此伤害，然后获得等同于伤害值的“珠”标记。出牌阶段开始时，你进行判定，若结果点数小于“珠”的数量，你弃置等同于“珠”数量的手牌（若弃牌的牌数不够，则失去剩余数量的体力值）。",
  lskuizhu: "馈珠",
  lskuizhu_info:
    "出牌阶段结束时，你可以选择体力值为全场最多的一名其他角色，将手牌摸至与该角色相同（最多摸至五张），然后该角色观看你的手牌，弃置任意张手牌并从观看的牌中获得等量的牌。若其获得的牌大于一张，则你选择一项：移去一个“珠”；或令其对其攻击范围内的一名角色造成1点伤害。",
  xpchijie: "持节",
  xpchijie_info:
    "每回合限一次。①当你受到其他角色使用的牌造成的伤害时，你可以令此牌对所有目标无效。②其他角色使用的牌结算完成时，若你是此牌的目标之一且此牌未造成过伤害，则你可以获得此牌对应的所有实体牌。",
  xpchijie2: "持节",
  yinju: "引裾",
  yinju_info:
    "限定技，出牌阶段，你可以选择一名其他角色。若如此做，当你于此阶段内使用牌指定其为目标后，你与其各摸一张牌；当你即将对其造成伤害时，防止此伤害，然后其回复等量的体力。",
  yinju2: "引裾",

  spjiedao: "截刀",
  spjiedao_info:
    "当你每回合第一次造成伤害时，你可令此伤害至多+X（X为你损失的体力值）。然后若受到此伤害的角色没有死亡，你弃置等同于此伤害加值的牌。",
  biaozhao: "表召",
  biaozhao_info:
    "结束阶段，你可以将一张牌置于武将牌上，称为“表”。当有一张与“表”花色点数均相同的牌进入弃牌堆后，你将“表”置入弃牌堆并失去1点体力，若此牌是其他角色因弃置而进入弃牌堆的，则改为该角色获得“表”。准备阶段，若你的武将牌上有“表”，则你将“表”置入弃牌堆。然后你选择一名角色，该角色回复1点体力且将手牌摸至与全场手牌数最多的人相同（最多摸五张）。",
  biaozhao2: "表召",
  biaozhao2_info: "",
  biaozhao3: "表召",
  biaozhao3_info: "",
  yechou: "业仇",
  yechou_info:
    "当你死亡时，你可以选择一名已损失体力值大于1的角色。直到其下个回合开始前，每个回合结束时，该角色失去1点体力。",
  yechou2: "业仇",
  yechou2_info: "",
  yanjiao: "严教",
  yanjiao_info:
    "出牌阶段限一次，你可以选择一名其他角色并从牌堆顶亮出四张牌。该角色将这些牌分成点数之和相等的两组，你与其各获得其中一组，然后将剩余未分组的牌置入弃牌堆。若未分组的牌超过一张，则你本回合手牌上限-1。",
  yanjiao2: "严教",
  yanjiao2_info: "",
  xingshen: "省身",
  xingshen_info:
    "当你受到伤害后，你可以摸一张牌且下一次发动〖严教〗亮出的牌数+1。若你的手牌数为全场最少，则改为摸两张牌；若你的体力值为全场最少，则〖严教〗亮出的牌数改为+2（加值总数不能超过4）。",

  sp_zhanghe: "SP张郃",
  yuanlve: "远略",
  yuanlve_info:
    "出牌阶段限一次，你可以将一张非装备牌交给一名角色，然后该角色可以使用该牌并令你摸一张牌。",
  xunchen: "OL荀谌",
  fenglve: "锋略",
  fenglve2: "锋略",
  fenglve_info:
    "出牌阶段开始时，你可以与一名角色拼点，若你赢，该角色将其区域内的各一张牌交给你；若你没赢，你交给其一张牌。当你的单人拼点结算后，你可以令对方获得你拼点的牌。",
  mouzhi: "谋识",
  mouzhi2: "谋识",
  mouzhi_info:
    "出牌阶段限一次，你可以将一张手牌交给一名角色，若如此做，当其于其下回合的出牌阶段内对一名角色造成伤害后，若是此阶段其第一次对该角色造成伤害，你摸一张牌。",
  sp_shenpei: "SP审配",
  gangzhi: "刚直",
  gangzhi_info:
    "锁定技，当你即将受到或造成伤害时，你防止此伤害，改为受到伤害的角色失去等量的体力。",
  beizhan: "备战",
  beizhan2: "备战",
  beizhan_info:
    "结束阶段，你可以令一名角色将手牌摸至体力上限（至多为5）。其下个回合开始时，若其手牌数为全场最多，则其此回合内使用的牌不能指定其他角色为目标。",
  gaolan: "OL高览",
  xiying: "袭营",
  xiying2: "袭营",
  xiying_info:
    "出牌阶段开始时，你可以弃置一张非基本手牌，然后令所有其他角色依次选择一项：弃置一张牌，或本回合内不能使用或打出牌；且你本回合内获得如下效果：结束阶段，若你于本回合的出牌阶段内造成过伤害，则你从牌堆中获得一张伤害性基本牌或普通锦囊牌。",
  lvkuanglvxiang: "吕旷吕翔",
  liehou: "列侯",
  liehou_info:
    "出牌阶段限一次，你可以令一名攻击范围内的角色交给你一张手牌，然后你将一张手牌交给攻击范围内的另一名角色。",
  qigong: "齐攻",
  qigong_info:
    "当你使用的【杀】被【闪】抵消之后，你可以令一名角色再对目标角色使用一张【杀】（不可被响应）。",
  chunyuqiong: "淳于琼",
  sushou: "宿守",
  sushou_info:
    "弃牌阶段开始时，你可以摸X+1张牌（X为“粮”数），然后可以交给任意名友方角色各一张牌。",
  cangchu: "仓储",
  cangchu_info:
    "锁定技，游戏开始时，你获得3枚“粮”标记，当你受到1点火焰伤害后，你失去一枚“粮”标记。",
  liangying: "粮营",
  liangying_info:
    "锁定技，若你有“粮”标记，则友方角色摸牌阶段摸牌数+1；当你失去所有“粮”标记后，你减1点体力上限，然后令敌方角色各摸两张牌。",
  sp_xuyou: "SP许攸",
  spshicai: "恃才",
  spshicai2: "恃才",
  spshicai_info:
    "出牌阶段，牌堆顶的一张牌对你可见。你可以弃置一张牌，然后获得牌堆顶的一张牌，且不能再发动〖恃才〗直到此牌离开你的手牌区。",
  spfushi: "附势",
  spfushi_info:
    "锁定技，若己方存活角色数：大于敌方，你视为拥有〖择主〗；小于敌方，你视为拥有〖逞功〗。",
  zezhu: "择主",
  zezhu_info:
    "出牌阶段限一次，你可以获得双方主帅的各一张牌（若无牌则改为你摸一张牌），然后交给双方主帅各一张牌。",
  chenggong: "逞功",
  chenggong_info:
    "当有角色使用牌指定目标后，若此牌对目标数大于1，则你可令使用者摸一张牌。",
  leitong: "雷铜",
  kuiji: "溃击",
  kuiji_info:
    "出牌阶段限一次，你可以将一张黑色基本牌当作【兵粮寸断】置于你的判定区，然后摸一张牌。若如此做，你可以对体力值最多的一名对手造成2点伤害。对手因此进入濒死状态时，你或队友体力值最少的一方回复1点体力。",
  wulan: "吴兰",
  wlcuorui: "挫锐",
  wlcuorui_info:
    "出牌阶段开始时，你可以弃置你或队友区域里的一张牌。若如此做，你选择一项：1.弃置对手装备区里至多两张与此牌颜色相同的牌；2.展示对手的共计两张手牌，然后获得其中与此牌颜色相同的牌。",
  re_panfeng: "潘凤",
  xinkuangfu: "狂斧",
  xinkuangfu_info:
    "出牌阶段限一次，你可选择：1，弃置装备区里的一张牌，你使用无对应实体牌的普【杀】。若此【杀】造成伤害，你摸两张牌。2，弃置一名其他角色装备区里的一张牌，你使用无对应实体牌的普【杀】。若此【杀】未造成伤害，你弃置两张手牌。",
  xingdaorong: "邢道荣",
  xuxie: "虚猲",
  xuxie_info:
    "出牌阶段开始时，你可以减1点体力上限并选择所有与你距离为1的角色，弃置这些角色的各一张牌或令这些角色各摸一张牌。出牌阶段结束时，若你的体力上限不为全场最多，则你加1点体力上限，然后回复1点体力或摸两张牌。",
  huaman: "花鬘",
  hmmanyi: "蛮裔",
  hmmanyi_info: "锁定技，【南蛮入侵】对你无效。",
  mansi_viewas: "蛮嗣",
  mansi: "蛮嗣",
  mansi_info:
    "出牌阶段限一次，你可以将所有手牌当做【南蛮入侵】使用；当有角色受到【南蛮入侵】的伤害后，你摸一张牌。",
  souying: "薮影",
  souying_info:
    "每回合限一次，当你对其他角色（或其他角色对你）使用【杀】或普通锦囊牌指定唯一目标后，若此牌不是本回合你对其（或其对你）使用的第一张【杀】或普通锦囊牌，你可以弃置一张牌，获得此牌对应的所有实体牌（或令此牌对你无效）。",
  zhanyuan: "战缘",
  zhanyuan_info:
    "觉醒技，准备阶段，若你已因蛮嗣累计获得超过7张牌，你加一点体力上限并回复1点体力，并可以选择一名男性角色，你与其获得技能〖系力〗，然后你失去技能〖蛮嗣〗",
  hmxili: "系力",
  hmxili_info:
    "每回合限一次，你的回合外，当其他拥有【系力】技能的角色在其回合内对没有【系力】技能的角色造成伤害时，你可以弃置一张牌，令此伤害+1，然后你与其各摸两张牌。",
  wangshuang: "王双",
  spzhuilie: "追猎",
  spzhuilie2: "追猎",
  spzhuilie_info:
    "锁定技，你使用【杀】无距离限制；当你使用【杀】指定目标后，若其不在你的攻击范围内，此【杀】不计入使用次数限制且你判定。若判定结果为武器牌或坐骑牌，此【杀】的伤害基数改为X（X为其体力值）。否则你失去1点体力。",
  wenyang: "文鸯",
  xinlvli: "膂力",
  xinlvli_info:
    "每回合限一次，当你造成伤害后，你可选择：1，若你的体力值大于你的手牌数，你摸Ｘ张牌；2，若你的手牌数大于你的体力值且你已受伤，你回复Ｘ点体力（Ｘ为你的手牌数与体力值之差）。",
  lvli: "膂力",
  lvli4: "膂力",
  lvli5: "膂力",
  lvli_info:
    "每名角色的回合限一次，你可以声明一个基本牌或普通锦囊牌的牌名，有随机概率视为使用之（装备区里的牌数越多，成功概率越大）",
  choujue: "仇决",
  choujue_info:
    "觉醒技，一名角色的回合结束时，若你的手牌数和体力值相差3或更多，你减1点体力上限并获得技能〖背水〗，然后将〖膂力〗改为“在自己的回合时每回合限两次”。",
  beishui: "背水",
  beishui_info:
    "觉醒技，准备阶段，若你的手牌数或体力值小于2，你减1点体力上限并获得技能〖清剿〗，然后将〖膂力〗改为受到伤害后也可以发动。",
  qingjiao: "清剿",
  qingjiao_info:
    "出牌阶段开始时，你可以弃置所有手牌，然后从牌堆或弃牌堆中随机获得八张牌名各不相同且副类别不同的牌。若如此做，结束阶段，你弃置所有牌。",
  re_liuzan: "留赞",
  refenyin: "奋音",
  refenyin_info:
    "锁定技，你的回合内，当一张牌进入弃牌堆后，若本回合内没有过与此牌花色相同的卡牌进入过弃牌堆，则你摸一张牌。",
  liji: "力激",
  liji_info:
    "出牌阶段限X次，你可以弃置一张牌并对一名其他角色造成1点伤害。（X为本回合内进入过弃牌堆的卡牌数除以8，若场上人数小于5则改为除以4，向下取整）",
  re_sunluyu: "孙鲁育",
  remeibu: "魅步",
  remeibu_info:
    "其他角色的出牌阶段开始时，若你在其攻击范围内，你可以弃置一张牌A，该角色于本阶段内拥有〖止息〗，且当其因〖止息〗弃置与牌A花色相同的牌时，你获得之。",
  rezhixi: "止息",
  rezhixi_info: "锁定技，当你使用【杀】或普通锦囊牌时，你弃置一张手牌。",
  remumu: "穆穆",
  remumu_info:
    "出牌阶段开始时，你可以选择一项：1.弃置一名其他角色装备区里的一张牌，然后你本回合可使用【杀】的次数+1；2.获得一名角色装备区里的一张牌，然后你本回合可使用【杀】的次数-1。",
  sp_zhangliao: "SP张辽",
  //这仨技能给SP仲村由理毫无违和感好吗！！！
  mubing: "募兵",
  mubing_info:
    "出牌阶段开始时，你可以展示牌堆顶的三张牌。你可弃置任意张手牌，并可获得任意张点数之和不大于你弃置的牌点数之和的牌。",
  ziqu: "资取",
  ziqu_info:
    "每名角色限一次，当你对有牌的其他角色造成伤害后，你可以防止此伤害。然后其将其点数最大的牌交给你。",
  diaoling: "调令",
  diaoling_info:
    "觉醒技，准备阶段，若你已因〖募兵〗获得了6张或更多的【杀】或武器牌或伤害锦囊牌，则你回复1点体力或摸两张牌，然后修改〖募兵〗。",
  mubing_rewrite: "募兵·改",
  mubing_rewrite_info:
    "出牌阶段开始时，你可以展示牌堆顶的四张牌。你可弃置任意张手牌，并可获得任意张点数之和不大于你弃置的牌点数之和的牌。然后你可将以此法获得的牌以任意方式交给其他角色。",
  caobuxing: "曹不兴",
  moying: "墨影",
  moying_info:
    "每回合限一次，当你于回合外不因使用而失去单一一张锦囊牌或装备牌后，你可以选择一个花色和与此牌点数差绝对值不超过2的点数，然后获得牌堆中所有与此牌花色点数相同的牌。",
  juanhui: "绢绘",
  juanhui2: "绢绘",
  juanhui2_backup: "绢绘",
  juanhui_info:
    '结束阶段，你可以选择一名其他角色。记录该角色下回合的出牌阶段里使用的基本牌和普通锦囊牌（每种牌名限记一次），你的下回合出牌阶段，可将一张手牌当这些牌里的任意一张牌使用（每张限使用一次，且【杀】不计次数）。当"绢绘"的牌全部用完时，你回复1点体力并将手牌摸至三张。',
  re_maliang: "马良",
  rexiemu: "协穆",
  rexiemu_info:
    "结束阶段，若全场没有“协穆”标记，你可以选择一名角色获得“协穆”标记直到你的下回合开始。你或该角色在各自的回合外使用或打出手牌时，你与其各摸一张牌（每回合限一次）。",
  heli: "贺励",
  heli_info:
    "出牌阶段限一次，你可以选择手牌数比你少的一名其他角色。该角色展示所有手牌，然后每缺少一种类型的牌，便从牌堆中随机获得一张此类型的牌。",
  caoxing: "曹性",
  cxliushi: "流矢",
  cxliushi2: "流矢",
  cxliushi_info:
    "出牌阶段，你可以将一张红桃牌置于牌堆顶，视为对一名角色使用一张【杀】（无距离限制且不计入使用次数）。当此【杀】造成伤害后，受到伤害的角色获得一个“流”。有“流”的角色手牌上限-X（X为其“流”数）。",
  zhanwan: "斩腕",
  zhanwan_info:
    "锁定技，有“流”的角色于弃牌阶段弃牌后，你摸等量的牌，然后其移去所有的“流”。",
  zhujun: "朱儁",
  gongjian: "攻坚",
  gongjian_info:
    "每回合限一次，当有角色使用【杀】指定第一个目标后，若此【杀】的目标和本局游戏内被使用的上一张【杀】的目标的交集A不为空，则你可以依次弃置A中所有角色的至多两张牌，然后获得以此法弃置的所有【杀】。",
  kuimang: "溃蟒",
  kuimang_info: "锁定技，一名角色死亡后，若你对其造成过伤害，你摸两张牌。",
  liuhong: "刘宏",
  yujue: "鬻爵",
  yujue_backup: "鬻爵",
  yujue_info:
    "出牌阶段限一次，你可以废除一个装备栏，然后令一名有手牌的其他角色交给你一张手牌。其获得〖执笏〗直到你的下回合开始。",
  zhihu: "执笏",
  zhihu_mark: "执笏",
  zhihu_info: "锁定技，每回合限两次，当你对其他角色造成伤害后，你摸两张牌。",
  tuxing: "图兴",
  tuxing2: "图兴",
  tuxing_info:
    "锁定技，当你废除一个装备栏时，你加1点体力上限并回复1点体力。然后若你所有的装备栏均已被废除，则你减4点体力上限，且本局游戏内造成的伤害+1。",
  re_hejin: "何进",
  xin_baosanniang: "鲍三娘",
  decadexushen: "许身",
  decadexushen2: "许身",
  decadexushen_info:
    "限定技，当你进入濒死状态后，你可以回复1点体力并获得技能“镇南”，然后如果你脱离濒死状态且“关索”不在场，你可令一名其他角色选择是否用“关索”代替其武将并令其摸三张牌。",
  decadezhennan: "镇南",
  decadezhennan_info:
    "当有角色使用普通锦囊牌指定目标后，若此牌目标数大于1，你可以对一名其他角色造成1点伤害。",
  liubian: "刘辩",
  shiyuan: "诗怨",
  shiyuan_info:
    "每回合每项限一次，当你成为其他角色使用牌的目标后：①若其体力值大于你，你摸三张牌。②若其体力值等于你，你摸两张牌。③若其体力值小于你，你摸一张牌。",
  dushi: "毒逝",
  dushi_info:
    "锁定技，你处于濒死状态时，其他角色不能对你使用【桃】。你死亡时，你选择一名其他角色获得〖毒逝〗。",
  yuwei: "余威",
  yuwei_info:
    "主公技，锁定技，其他群雄角色的回合内，你将〖诗怨〗改为“每回合每项限两次”。",
  ol_dingyuan: "丁原",
  cixiao: "慈孝",
  cixiao_info:
    "准备阶段，若场上没有“义子”标记，你可令一名其他角色获得一个“义子”标记；若场上有“义子”标记，你可以弃置一张牌移动“义子”标记。拥有“义子”标记的角色获得技能“叛弑”。",
  panshi: "叛弑",
  panshi_info:
    "锁定技，准备阶段，你交给有“慈孝”技能的角色一张手牌；当你于出牌阶段因使用【杀】对其他角色造成伤害时，若其拥有技能“慈孝”，则此伤害+1，且你结束出牌阶段。",
  xianshuai: "先率",
  xianshuai_info:
    "锁定技，有角色造成伤害后，若此伤害是本轮第一次造成伤害：你摸一张牌；若伤害来源是你，则你对受伤角色再造成1点伤害。",
  wangrong: "王荣",
  minsi: "敏思",
  minsi2: "敏思",
  minsi_info:
    "出牌阶段限一次，你可以弃置任意张点数之和为13的牌，然后摸两倍数量的牌。以此法获得的牌中，黑色牌本回合无距离限制，红色牌本回合不计入手牌上限。",
  jijing: "吉境",
  jijing_info:
    "当你受到伤害后，你可以进行一次判定，然后若你弃置任意张点数之和与判定结果点数相同的牌，你回复1点体力。",
  zhuide: "追德",
  zhuide_info:
    "当你死亡时，你可令一名其他角色从牌堆中获得四张名称各不相同的基本牌。",
  re_xinxianying: "辛宪英",
  rezhongjian: "忠鉴",
  rezhongjian2: "忠鉴",
  rezhongjian_info:
    "出牌阶段限一次，你可以选择一名本回合内未选择过的角色。你令其获得一项效果直至你的下回合开始：①其下次造成伤害后弃置两张牌，然后你摸一张牌。②其下次受到伤害后摸两张牌，然后你摸一张牌。",
  recaishi: "才识",
  recaishi3: "才识",
  recaishi_info:
    "摸牌阶段结束时，若你于本阶段内因摸牌而获得的所有的牌：花色均相同，你将〖忠鉴〗于本回合内改为“出牌阶段限两次”。不均相同，你可回复1点体力。若如此做，你本回合内不能对自己使用牌。",
  decadewuniang: "武娘",
  decadewuniang_info:
    "当你使用或打出【杀】时，你可以获得一名其他角色的一张牌。若如此做，其摸一张牌。（若你已发动许身，则关索也摸一张牌）",
  dongxie: "董翓",
  juntun: "军屯",
  juntun_info:
    "锁定技，准备阶段，若X大于1，则你减1点体力上限并摸X张牌（X为你的体力上限）。",
  jiaojie: "狡黠",
  jiaojie_info:
    "锁定技，你的红色牌不计入手牌上限。你使用黑色牌无距离和次数限制。",
  buchen: "不臣",
  buchen_info: "隐匿技，你于其他角色的回合登场时，可获得当前回合角色的一张牌。",
  smyyingshi: "鹰视",
  smyyingshi_info:
    "锁定技，出牌阶段，你可观看牌堆顶的X张牌（X为你的体力上限）。",
  xiongzhi: "雄志",
  xiongzhi_info:
    "限定技，出牌阶段，你可展示牌堆顶的一张牌并使用之。若如此做，你重复此流程，直到你以此法展示的牌无法使用。",
  quanbian: "权变",
  quanbian2: "权变",
  quanbian_info:
    "当你于出牌阶段内使用/打出手牌时，若此牌有花色且你本回合内未使用/打出过该花色的其他手牌，则你可以选择一项：①摸一张牌。②将牌堆顶X张牌中的一张置于牌堆底（X为你的体力上限）。若你发动此技能，则你本回合内不能再使用与此牌花色相同的手牌。",
  re_hansui: "韩遂",
  re_quyi: "麴义",
  refuqi: "伏骑",
  refuqi_info:
    "锁定技，当你使用牌时，你令所有距离为1的其他角色不能使用或打出牌响应此牌。",
  hanfu: "韩馥",
  hfjieying: "节应",
  hfjieying2: "节应",
  hfjieying3: "节应",
  hfjieying_info:
    "结束阶段，你可以选择一名其他角色，该角色下回合使用【杀】或普通锦囊牌无距离限制且可多指定一个目标，且当其造成伤害后，其无法再使用牌直到回合结束。 ",
  weipo: "危迫",
  weipo_info:
    "锁定技，其他角色使用【杀】或普通锦囊牌指定你为目标后，若你的手牌数小于X，则你将手牌摸至X张，并记录摸牌事件结算后的手牌数Y。此牌结算结束后，若你的手牌数小于Y，则你将一张手牌交给此牌的使用者，且此技能失效直到你的下回合开始。（X为你的体力上限且至多为5） ",
  guozhao: "郭照",
  pianchong: "偏宠",
  pianchong2: "偏宠",
  pianchong_info:
    "摸牌阶段开始时，你可放弃摸牌。若如此做，你从牌堆中获得一张红色牌和一张黑色牌。然后你选择一种颜色。你的下回合开始前，当你失去该颜色的一张牌后，你从牌堆中获得另一种颜色的一张牌。",
  zunwei: "尊位",
  zunwei_backup: "尊位",
  zunwei_info:
    "出牌阶段限一次，你可选择本局游戏内未选择过的一项：①若你已受伤，则你可以选择一名体力值大于你的其他角色，你将体力值回复至X（X为你的体力上限与其体力值中的较小值）②选择一名手牌数大于你的其他角色，你将手牌数摸至与其相同（至多摸五张）③选择一名装备区内牌数大于你的其他角色。你令X=1。若你装备区内的('equip'+X)栏为空，则你使用牌堆中的一张副类别为('equip'+X)，且能对自己使用的装备牌。你令X+1。若X不大于5，且你装备区内的牌数仍小于目标角色，则你重复此流程。",
  re_chunyuqiong: "淳于琼",
  recangchu: "仓储",
  recangchu2: "仓储",
  recangchu3: "仓储",
  recangchu_info:
    "锁定技，游戏开始时，你获得3个“粮”。你的手牌上限+X（X为“粮”数）。当你于回合外获得牌时，你获得一个“粮”。（你的“粮”数不能超过存活角色数）",
  reliangying: "粮营",
  reliangying_info:
    "弃牌阶段开始时，你可以摸至多X张牌，然后交给等量的角色各一张牌。（X为你的“粮”数）",
  reshishou: "失守",
  reshishou2: "失守",
  reshishou_info:
    "锁定技，当你使用【酒】时或受到1点火焰伤害后，你移去一个“粮”。准备阶段，若你没有“粮”，你失去1点体力。",
  ol_lisu: "OL李肃",
  qiaoyan: "巧言",
  qiaoyan_info:
    "锁定技，当你于回合外受到其他角色造成的伤害时，若你：有“珠”，则你令伤害来源获得“珠”；没有“珠”，则你防止此伤害，然后摸一张牌，并将一张牌正面朝上置于武将牌上，称为“珠”。",
  xianzhu: "献珠",
  xianzhu_info:
    "锁定技，出牌阶段开始时，你令一名角色A获得“珠”。若A不为你自己，则你选择A攻击范围内的一名角色B，视为A对B使用一张【杀】。",
  fanyufeng: "樊玉凤",
  bazhan: "把盏",
  bazhan_info:
    "转换技，出牌阶段限一次，阴：你可以将至多两张手牌交给一名其他角色。阳：你可以获得一名其他角色的至多两张手牌。若以此法移动的牌包含【酒】或♥牌，则你可令得到牌的角色执行一项：①回复1点体力。②复原武将牌。",
  jiaoying: "醮影",
  jiaoying2: "醮影",
  jiaoying3: "醮影",
  jiaoying3_draw: "醮影",
  jiaoying_info:
    "锁定技，其他角色获得你的手牌后，该角色本回合不能使用或打出与此牌颜色相同的牌。然后此回合结束时，若其本回合没有再使用牌，你令一名角色将手牌摸至五张。",
  zhaozhong: "赵忠",
  yangzhong: "殃众",
  yangzhong_info:
    "当你造成或受到伤害后，若受伤角色和伤害来源均存活，则伤害来源可弃置两张牌，然后令受伤角色失去1点体力。",
  huangkong: "惶恐",
  huangkong_info:
    "锁定技，当你于回合外成为【杀】或普通锦囊牌的目标后，若你没有手牌，则你摸两张牌。",
  re_taoqian: "陶谦",
  reyixiang: "义襄",
  reyixiang_info:
    "锁定技，其他角色于其出牌阶段内使用的第一张牌对你的伤害-1；其使用的第二张牌若为黑色，则对你无效。",
  caosong: "曹嵩",
  cslilu: "礼赂",
  cslilu_info:
    "摸牌阶段，你可以放弃摸牌，改为将手牌摸至X张（X为你的体力上限和5中的最小值），然后将至少一张手牌交给一名其他角色。若你以此法给出的牌数大于你上次以此法给出的牌数，则你加1点体力上限并回复1点体力。",
  csyizheng: "翊正",
  csyizheng2: "翊正",
  csyizheng_info:
    "结束阶段开始时，你可以选择一名其他角色。你的下回合开始前，当该角色造成伤害或回复体力时，若其体力上限小于你，则你减1点体力上限，且令此伤害值/回复值+1。",
  reyirang: "揖让",
  reyirang_info:
    "出牌阶段开始时，你可以将所有非基本牌交给一名其他角色。若其体力上限大于你，则你将体力上限调整至与其相同。然后你回复X点体力（X为你以此法交给其的牌数）。",
  xiahoujie: "夏侯杰",
  liedan: "裂胆",
  liedan_info:
    "锁定技，其他角色的准备阶段开始时，若X大于0，则你摸X张牌。若X等于3，则你加1点体力上限（至多加到8）。若X为0，则你失去1点体力并获得一枚“裂”（X为你的手牌数，体力值，装备区牌数中大于其的数量）。准备阶段，若“裂”数大于4，则你死亡。",
  zhuangdan: "壮胆",
  zhuangdan_mark: "壮胆",
  zhuangdan_info:
    "锁定技，其他角色的回合结束时，若你的手牌数为全场唯一最多，则你令〖裂胆〗失效直到你下回合结束。",
  ruanyu: "阮瑀",
  xingzuo: "兴作",
  xingzuo2: "兴作",
  xingzuo_info:
    "出牌阶段开始时，你可观看牌堆底的三张牌并用任意张手牌替换其中等量的牌。若如此做，结束阶段，你可令一名有手牌的角色用所有手牌替换牌堆底的三张牌。若其因此法失去的牌多于三张，则你失去1点体力。",
  miaoxian: "妙弦",
  miaoxian_info:
    "若你的手牌中仅有一张黑色牌，你可将此牌当作任意一张普通锦囊牌使用（每种牌名每回合限一次）；若你的手牌中仅有一张红色牌，你使用此牌时摸一张牌。",
  liangxing: "梁兴",
  lulve: "掳掠",
  lulve_info:
    "出牌阶段开始时，你可选择一名有手牌且手牌数少于你的角色。其选择一项：①将所有手牌交给你，然后你将武将牌翻面。②将武将牌翻面，然后其视为对你使用一张【杀】。",
  lxzhuixi: "追袭",
  lxzhuixi_info:
    "锁定技，当你造成伤害或受到伤害时，若受伤角色的翻面状态和伤害来源的翻面状态不同，则此伤害+1。",
  zhangmiao: "张邈",
  mouni: "谋逆",
  mouni_info:
    "准备阶段，你可对一名其他角色依次使用你手牌中所有的【杀】（若其进入了濒死状态，则终止此流程）。然后若这些【杀】中有未造成伤害的【杀】，则你跳过本回合的出牌阶段和弃牌阶段。",
  zongfan: "纵反",
  zongfan_info:
    "觉醒技。结束阶段，若你本回合内因〖谋逆〗使用过【杀】且未跳过本回合的出牌阶段，则你将任意张牌交给一名其他角色，然后加X点体力上限并回复X点体力（X为你以此法给出的牌数且至多为5）。最后失去〖谋逆〗并获得〖战孤〗。",
  zhangu: "战孤",
  zhangu_info:
    "锁定技，准备阶段，若你的体力上限大于1且没有手牌/装备区内没有牌，则你减1点体力上限，然后从牌堆中获得三张类型不同的牌。",
  re_niujin: "牛金",
  recuorui: "摧锐",
  recuorui_info:
    "限定技，出牌阶段，你可以依次获得至多X名角色的各一张手牌（X为你的体力值）。",
  reliewei: "裂围",
  reliewei_info: "当有角色于你的回合内进入濒死状态时，你可以摸一张牌。",
  duanwei: "段煨",
  langmie: "狼灭",
  langmie_damage: "狼灭",
  langmie_info:
    "其他角色的出牌阶段结束时，若其本阶段内使用过的牌中有类型相同的牌，则你可以弃置一张牌并摸两张牌；其他角色的结束阶段开始时，若其本回合内造成的伤害大于1，则你可以弃置一张牌并对其造成1点伤害。",
  zhangheng: "张横",
  dangzai: "挡灾",
  dangzai_info:
    "出牌阶段开始时，你可将一名其他角色判定区内的一张牌移动至你的判定区内。",
  liangjue: "粮绝",
  liangjue_info:
    "锁定技，当有黑色牌进入或者离开你的判定区或装备区后，若你的体力值大于1，你失去1点体力，然后摸两张牌。",
  tangji: "唐姬",
  jielie: "抗歌",
  jielie_info:
    "你的第一个回合开始时，选择一名其他角色，该角色每次于其回合外获得牌后，你摸等量的牌（每回合至多摸三张）；其进入濒死状态时，你可令其回复体力至1点（每轮限一次）。该角色死亡时，你弃置所有牌并失去1点体力。",
  kangge: "节烈",
  kangge_info:
    "当你受到除自己和“抗歌”角色以外的角色造成的伤害时，你可以防止此伤害并选择一种花色，然后你失去X点体力，令“抗歌”角色从弃牌堆中随机获得X张此花色的牌（X为伤害值）。",
  yangwan: "杨婉",
  youyan: "诱言",
  youyan_info:
    "出牌阶段/弃牌阶段各限一次，当你的牌因弃置进入弃牌堆后，你可以从牌堆中获得本次弃牌中没有的花色的牌各一张。",
  zhuihuan: "追还",
  zhuihuan2: "追还",
  zhuihuan2_new: "追还",
  zhuihuan_info:
    "结束阶段开始时，你可以选择一名角色（对其他角色不可见）。记录所有对该角色造成过伤害的角色。该角色的下个准备阶段开始时停止记录，且所有记录过的角色：若体力值大于该角色，则受到其造成的2点伤害；若体力值小于等于该角色，则随机弃置两张手牌。",
  re_dongcheng: "董承",
  xuezhao: "血诏",
  xuezhao_info:
    "出牌阶段限一次，你可弃置一张手牌并选择至多X名其他角色(X为你的体力上限）。这些角色依次选择是否交给你一张牌，若选择是，该角色摸一张牌且你本回合可多使用一张【杀】；若选择否，该角色本回合无法响应你使用的牌。",
  re_hucheer: "胡车儿",
  redaoji: "盗戟",
  redaoji2: "盗戟",
  redaoji_info:
    "其他角色第一次使用武器牌时，你可选择一项：①获得此牌。②令其本回合内不能使用或打出【杀】。",
  fuzhong: "负重",
  fuzhong_info:
    "锁定技，当你于回合外获得牌后，你获得一枚“重”标记。若X：大于0，你于摸牌阶段开始时令额定摸牌数+1；大于1，你至其他角色的距离-2；大于2，你的手牌上限+3；大于3，结束阶段开始时，你对一名其他角色造成1点伤害，然后移去4枚“重”（X为“重”数）。",
  heyan: "何晏",
  yachai: "崖柴",
  yachai_info:
    "当你受到伤害后，你可令伤害来源选择一项：①其本回合不能再使用手牌，然后你摸两张牌；②其展示所有手牌，然后将其手牌中一种花色的所有牌交给你；③弃置一半数量的手牌（向上取整）。",
  qingtan: "清谈",
  qingtan_info:
    "出牌阶段限一次，你可令所有有手牌的角色同时选择一张手牌并同时展示。你可以获得其中一种花色的牌，然后展示此花色牌的角色各摸一张牌。若如此做，弃置其他的牌。",
  qiuliju: "丘力居",
  koulve: "寇略",
  koulve_info:
    "当你于出牌阶段内对其他角色造成伤害后，你可以展示其X张手牌（X为其已损失的体力值）。若这些牌中：有带有伤害标签的基本牌或锦囊牌，则你获得之；有红色牌，则你失去1点体力（若已受伤则改为减1点体力上限），然后摸两张牌。",
  qljsuiren: "随认",
  qljsuiren_info:
    "当你死亡时，你可以将手牌中所有的带有伤害标签的基本牌或锦囊牌交给一名其他角色。",
  re_dongbai: "董白",
  relianzhu: "连诛",
  relianzhu_info:
    "出牌阶段限一次，你可将一张牌正面朝上交给一名其他角色。若此牌为：红色，你摸一张牌；黑色，对方弃置两张牌或令你摸两张牌。’",
  rexiahui: "黠慧",
  rexiahui_info:
    "锁定技，①你的黑色牌不计入手牌上限。②当有其他角色获得你的黑色牌后，其于下次扣减体力前不能使用，打出，弃置这些牌。③一名其他角色的回合结束时，若其本回合失去过其所有“黠慧”牌，则其失去1点体力。",
  huaxin: "华歆",
  wanggui: "望归",
  wanggui_info:
    "每回合限触发一次，当你造成或受到伤害后，若你：仅明置了此武将牌，则你可对与你势力不同的一名角色造成1点伤害；武将牌均明置，则你可令与你势力相同的角色各摸一张牌。",
  spwanggui: "望归",
  spwanggui_info:
    "①当你受到伤害后，你可以摸一张牌，或和一名势力相同的其他角色各摸一张牌；②每回合限一次，当你造成伤害后，你可以对一名与你势力不同的角色造成1点伤害。",
  xibing: "息兵",
  xibing_info:
    "当一名其他角色在其出牌阶段内使用黑色【杀】或黑色普通锦囊牌指定唯一角色为目标后，你可令该角色将手牌摸至当前体力值(至多摸五张)且本回合不能再使用手牌。",
  xibing_info_guozhan:
    "当一名其他角色在其出牌阶段内使用第一张黑色【杀】或黑色普通锦囊牌指定唯一角色为目标后，你可令该角色将手牌摸至当前体力(至多摸五张)值且本回合不能再使用手牌。若你与其均明置了所有武将牌，则你可以暗置你与其各一张武将牌且本回合不能再明置此武将牌。",
  luyusheng: "陆郁生",
  zhente: "贞特",
  zhente2: "贞特",
  zhente_info:
    "每回合限一次，当你成为其他角色使用基本牌或普通锦囊牌的目标后，你可令使用者选择一项：1.本回合不能再使用与此牌颜色相同的牌；2.此牌对你无效。 ",
  zhente_info_guozhan:
    "每回合限一次，当你成为其他角色使用黑色基本牌或黑色普通锦囊牌的目标后，你可令使用者选择一项：1.本回合不能再使用黑色牌；2.此牌对你无效。 ",
  zhiwei: "至微",
  zhiwei2: "至微",
  zhiwei_info:
    "游戏开始时/你的回合开始时，若场上没有因此法被选择过的角色存活，则你选择一名其他角色。该角色造成伤害后，你摸一张牌，该角色受到伤害后，你随机弃置一张手牌。你弃牌阶段弃置的牌均被该角色获得。",
  zhiwei_info_guozhan:
    "你明置此武将牌时，选择一名其他角色。该角色造成伤害后，你摸一张牌，该角色受到伤害后，你随机弃置一张手牌。你弃牌阶段弃置的牌均被该角色获得。该角色死亡时，若你的两个武将牌均明置，你暗置此武将牌。 ",
  re_zoushi: "邹氏",
  rehuoshui: "祸水",
  rehuoshui_info:
    "准备阶段，你可以选择至多X名角色（X为你已损失的体力值且至少为1）。你令这些角色中第一名角色的非锁定技失效直到回合结束；第二名角色交给你一张手牌；第三名及之后角色弃置装备区内的所有牌。",
  reqingcheng: "倾城",
  reqingcheng_info:
    "出牌阶段限一次，你可以与一名手牌数小于你的男性角色交换手牌。",
  re_panshu: "潘淑",
  zhiren: "织纴",
  zhiren_info:
    "当你于你的回合内使用第一张非转化牌时，你可依次执行以下选项中的前X项：①卜算X。②可弃置场上的一张装备牌和延时锦囊牌。③回复1点体力。④摸三张牌。（X为此牌的名称的字数）",
  yaner: "燕尔",
  yaner_info:
    "每回合限一次。当有其他角色于其出牌阶段内失去手牌后，若其没有手牌，则你可以与其各摸两张牌。若其以此法摸得的两张牌类型相同，则其回复1点体力。若你以此法摸得的两张牌类型相同，则你将〖织纴〗中的“你的回合内”改为“一回合内”直至你下回合开始。",
  caoanmin: "曹安民",
  xianwei: "险卫",
  xianwei_info:
    "锁定技，准备阶段，你废除一个装备栏并摸X张牌（X为你未废除的装备栏数），然后你可以令一名其他角色对其自己使用一张牌堆中的一张与此装备栏副类别相同的装备牌（没有可使用的牌则改为摸一张牌）。当你废除所有装备栏后，你加2点体力上限，然后你与所有其他角色视为在彼此的攻击范围内。",
  zhanghu: "张虎",
  cuijian: "摧坚",
  cuijian_info:
    "出牌阶段限一次，你可以选择一名有手牌的其他角色。若其手牌中有【闪】，则其将所有【闪】和防具牌交给你，然后你交给其等量的牌。",
  zhtongyuan: "同援",
  zhtongyuan_info:
    "锁定技。①当你使用红色锦囊牌后，你于〖摧坚〗后增加“若其手牌中没有【闪】，则你摸两张牌”；②当你使用或打出红色基本牌后，你删除〖摧坚〗中的“，然后你交给其等量的牌”。③当你使用红色的普通锦囊牌/基本牌时，若你已发动过〖摧坚①〗和〖摧坚②〗，则此牌不可被响应/可额外增加一个目标。",
  dufuren: "杜夫人",
  yise: "异色",
  yise_info:
    "其他角色获得你的牌后，若这些牌中：有红色牌，你可令其回复1点体力；有黑色牌，其下次受到【杀】造成的伤害时，此伤害+1。",
  shunshi: "顺世",
  shunshi_info:
    "准备阶段开始时，或当你受到伤害后，你可将一张牌交给一名不为伤害来源的其他角色并获得如下效果直到你的回合结束：摸牌阶段的额定摸牌数+1，使用【杀】的次数上限+1，手牌上限+1。",
  lvlingqi: "吕玲绮",
  guowu: "帼舞",
  guowu_info:
    "出牌阶段开始时，你可以展示全部手牌，根据你展示的类型数，你获得对应效果：至少一类，从弃牌堆获得一张【杀】；至少两类，此阶段使用牌无距离限制；至少三类，此阶段使用【杀】或普通锦囊牌可以多指定两个目标。",
  guowu_info_guozhan:
    "出牌阶段开始时，你可以展示全部手牌，根据你展示的类型数，你获得对应效果：至少一类，从弃牌堆获得一张【杀】；至少两类，此阶段使用牌无距离限制；至少三类，此阶段使用【杀】或普通锦囊牌可以多指定两个目标（限一次）。",
  zhuangrong: "妆戎",
  zhuangrong_info:
    "觉醒技，一名角色的回合结束时，若你的体力值或手牌数为1，你减1点体力上限并回复体力至上限，将手牌摸至体力上限，然后获得〖神威〗和〖无双〗。",
  llqshenwei: "神威",
  llqshenwei_info: "锁定技，摸牌阶段开始时，你令额定摸牌数+2；你的手牌上限+2。",
  rexingluan: "兴乱",
  rexingluan_info:
    "出牌阶段限一次，当你使用的仅指定一个目标的牌结算完成后，你可以获得场上一张与此牌点数相同的牌，或获得牌堆中随机一张点数与此牌相同的牌。",
  xinxingluan: "兴乱",
  xinxingluan_info:
    "每回合限一次。当你于出牌阶段使用牌结算结束后，你可选择一项：①观看牌堆中的两张点数为6的牌并获得其中一张（没有则改为摸六张牌）；②令一名其他角色弃置一张点数为6的牌或交给你一张牌；③获得场上的一张点数为6的牌。",
  zhouyi: "周夷",
  zhukou: "逐寇",
  zhukou_info:
    "①当你于一名角色的出牌阶段第一次造成伤害后，你可以摸X张牌（X为本回合你已使用的牌数）。②你的结束阶段，若你本回合没有造成伤害，你可以对两名其他角色各造成1点伤害。",
  mengqing: "氓情",
  mengqing_info:
    "觉醒技。准备阶段，若场上已受伤的角色数大于你的体力值，你加3点体力上限并回复3点体力，失去〖逐寇〗，获得〖玉殒〗。",
  yuyun: "玉殒",
  yuyun_info:
    "锁定技，出牌阶段开始时，你失去1点体力或体力上限（不能减至1以下），然后选择X+1项（X为你已损失的体力值）：①摸两张牌；②对一名其他角色造成1点伤害，然后本回合对其使用【杀】无距离和次数限制；③本回合的手牌上限视为无限；④获得一名其他角色区域内的一张牌；⑤令一名其他角色将手牌摸至体力上限（最多摸至5）。",
  re_nanhualaoxian: "南华老仙",
  gongxiu: "共修",
  gongxiu_info:
    "结束阶段，若你本回合内发动过〖经合〗，则你选择一项：①令所有本回合内成为过〖经合〗目标的角色各摸一张牌；②令所有本回合内未成为过〖经合〗目标的角色各弃置一张手牌。",
  jinghe: "经合",
  jinghe_info:
    "出牌阶段限一次，你可以展示四张牌名各不相同的牌并选择等量的角色。系统从“写满技能的天书”中随机选择等量的技能，然后这些角色依次选择获得其中的一个。",
  nhyinbing: "阴兵",
  nhyinbing_info:
    "锁定技，你使用的【杀】造成伤害改为失去体力。其他角色失去体力后，你摸一张牌。",
  nhhuoqi: "活气",
  nhhuoqi_info:
    "出牌阶段限一次，你可以弃置一张牌，然后令体力值最少的一名角色回复1点体力并摸一张牌。",
  nhguizhu: "鬼助",
  nhguizhu_info: "一名角色进入濒死状态时，你可以摸两张牌（每回合限一次）。",
  nhxianshou: "仙授",
  nhxianshou_info:
    "出牌阶段限一次，你可以选择一名角色令其摸一张牌。若其未受伤，则多摸一张。",
  nhlundao: "论道",
  nhlundao_info:
    "当你受到伤害后，若伤害来源比你手牌多，你可以弃置其一张牌；若伤害来源比你手牌少，你摸一张牌。",
  nhguanyue: "观月",
  nhguanyue_info:
    "结束阶段，你可以观看牌堆顶两张牌，然后获得其中—张，另一张放回牌堆顶。",
  nhyanzheng: "言政",
  nhyanzheng_info:
    "准备阶段，若你的手牌数大于1，你可以保留一张手牌并弃置其余的牌，然后选择至多等于弃牌数量的角色，对这些角色各造成1点伤害。",
  re_kanze: "阚泽",
  rekuanshi: "宽释",
  rekuanshi_info:
    "结束阶段，你可以选择一名角色。你获得如下一次性效果直到你下回合开始：当其于一回合内受到第2点伤害后，其回复1点体力。",
  sp_mifangfushiren: "糜芳傅士仁",
  mffengshi: "锋势",
  mffengshi_info:
    "当你使用牌指定唯一目标后，或成为其他角色使用牌的唯一目标后，若此牌使用者的手牌数大于此牌目标的手牌数，则此牌的使用者可令你弃置自己和对方的各一张牌，并令此牌的伤害值+1。",
  tongyuan: "童渊",
  chaofeng: "朝凤",
  chaofeng_info:
    "出牌阶段限一次。当你造成伤害时，你可以弃置一张牌，然后摸一张牌。若此伤害的渠道为牌且你弃置的牌：与此牌颜色相同，则你改为摸两张牌；与此牌类型相同，则此伤害+1。",
  chuanshu: "传术",
  chuanshu_info:
    "限定技。准备阶段，若你已受伤；或当你死亡时，你可令一名其他角色获得〖朝凤〗。然后你获得〖龙胆〗、〖从谏〗和〖穿云〗。",
  chuanyun: "穿云",
  chuanyun_info:
    "当你使用【杀】指定目标后，你可令目标角色随机弃置其装备区内的一张牌。",
  liuyong: "刘永",
  zhuning: "诛佞",
  zhuning_info:
    "出牌阶段限一次。你可将任意张牌交给一名其他角色（称为“隙”），然后可视为使用一张具有伤害标签的基本牌/锦囊牌（不计入次数限制）。若你以此法使用的牌未造成伤害，则你将〖诛佞〗于本回合内改为“限两次”。",
  fengxiang: "封乡",
  fengxiang_info:
    "锁定技。①当你受到伤害后，若场上：存在“隙”唯一最多的角色，则其回复1点体力；不存在，则你摸一张牌。②当有角色的手牌移动后，若场上“隙”最多的角色因此发生变化，则你摸一张牌。",
  fengxiang_tag: "隙",
  zhangning: "张宁",
  tianze: "天则",
  tianze_info:
    "①每回合限触发一次。其他角色于其出牌阶段内使用的黑色手牌结算结束后，你可以弃置一张黑色牌，并对其造成1点伤害。②其他角色的判定生效后，若结果为黑色，则你摸一张牌。",
  difa: "地法",
  difa_info:
    "每回合限一次。当你于回合内因摸牌而获得红色牌时，你可以弃置之。然后你选择一个锦囊牌的牌名，并从牌堆中获得一张此牌名的牌。",
  re_xunchen: "荀谌",
  refenglve: "锋略",
  refenglve_info:
    "出牌阶段限一次，你可以和一名其他角色进行拼点。若你赢，其将区域内的两张牌交给你；若平局，则你令此技能于本阶段内的发动次数上限+1；若你输，其获得你的拼点牌。",
  anyong: "暗涌",
  anyong_info:
    "当一名角色于其回合内第一次对其他角色造成伤害后，若伤害值为1，则你可弃置一张牌，并对受伤角色造成1点伤害。",
  wanniangongzhu: "万年公主",
  zhenge: "枕戈",
  zhenge_info:
    "准备阶段，你可以选择一名角色。该角色本局游戏的攻击范围+1（至多+5）。然后若所有其他角色都在该角色的攻击范围内，则你可以令其视为对另一名角色使用一张【杀】。",
  xinghan: "兴汉",
  xinghan_info:
    "锁定技，每回合的第一张【杀】造成伤害后，若此【杀】的使用者成为过〖枕戈〗的目标，则你摸一张牌。若你的手牌数不是全场唯一最多的，则改为摸X张牌（X为该角色的攻击范围且最多为5）。",
  xinping: "辛评",
  fuyuan: "辅袁",
  fuyuan_info:
    "当你于回合外使用或打出牌时，若当前回合角色的手牌数：不小于你，你可摸一张牌；小于你，你可令其摸一张牌。",
  zhongjie: "忠节",
  zhongjie_info:
    "当你死亡时，你可令一名其他角色加1点体力上限并回复1点体力，然后摸一张牌。",
  hanmeng: "韩猛",
  jieliang: "截粮",
  jieliang_info:
    "其他角色的摸牌阶段开始时，你可弃置一张牌，令其本阶段的摸牌数和本回合的手牌上限-1。然后当其于本回合的弃牌阶段内因弃置而失去牌后，你可获得其中的一张。",
  quanjiu: "劝酒",
  quanjiu_info:
    "锁定技。①你手牌区中的【酒】的牌名视为【杀】。②你使用对应的实体牌为一张【酒】的非转化【杀】不计入次数限制。",
  caojinyu: "曹金玉",
  yuqi: "隅泣",
  yuqi_info:
    "每回合限两次。当有角色受到伤害后，若你至其的距离不大于<span class=thundertext>0</span>，则你可以观看牌堆顶的<span class=firetext>3</span>张牌。你将其中至多<span class=greentext>1</span>张牌交给受伤角色，然后可以获得剩余牌中的至多<span class=yellowtext>1</span>张牌，并将其余牌以原顺序放回牌堆顶。（所有具有颜色的数字至多为5）",
  shanshen: "善身",
  shanshen_info:
    "当有角色死亡时，你可令你的〖隅泣〗中的一个具有颜色的数字+2。然后若你未对该角色造成过伤害，则你回复1点体力。",
  xianjing: "娴静",
  xianjing_info:
    "准备阶段，你可令你的〖隅泣〗中的一个具有颜色的数字+1。若你的体力值等于体力上限，则你可以重复一次此流程。",
  re_chendeng: "陈登",
  refuyuan: "扶援",
  refuyuan_info:
    "一名角色成为【杀】的目标后，若其本回合内没有成为过其他红色牌的目标，则你可以令其摸一张牌。",
  reyingshui: "营说",
  reyingshui_info:
    "出牌阶段限一次，你可将一张牌交给攻击范围内的一名其他角色，然后其选择一项：①交给你至少两张装备牌。②受到1点伤害。",
  rewangzu: "望族",
  rewangzu_info:
    "每回合限一次。当你受到其他角色造成的伤害时，你可随机弃置一张手牌，令此伤害-1。若你所在阵营的存活角色数是全场最多的，则你可以自行选择弃置的牌。",
  wangtao: "王桃",
  wangyue: "王悦",
  huguan: "护关",
  huguan_info:
    "一名角色于出牌阶段内使用第一张牌时，若此牌为红色，则你可以声明一种花色。该花色的牌不计入其本回合的手牌上限。",
  yaopei: "摇佩",
  yaopei_info:
    "其他角色的弃牌阶段结束时，若其于本阶段内弃置过的牌的集合A不为空集，则你可以弃置一张与A中的牌花色均不相同的牌。然后你选择一项：①其摸两张牌，你回复1点体力。②其回复1点体力，你摸两张牌。",
  mingluan: "鸣鸾",
  mingluan_info:
    "其他角色的结束阶段开始时，若有角色于本回合内回复过体力，则你可以弃置一张牌，然后摸X张牌（X为当前角色的手牌数，且至多摸至5张）。",
  re_pangdegong: "庞德公",
  heqia: "和洽",
  heqia_info:
    "出牌阶段开始时，你可选择一项：①将任意张牌交给一名其他角色。②令一名有手牌的其他角色交给你任意张牌。然后以此法获得牌的角色可以视为使用一张基本牌，且当其声明使用此牌时，可以为此牌增加至至多X个目标（X为以此法移动的牌数）。",
  yinyi: "隐逸",
  yinyi_info:
    "锁定技。每回合限一次，当你受到非属性伤害时，若你的手牌数和体力值与伤害来源均不相同，则你防止此伤害。",
  re_sunyi: "孙翊",
  syjiqiao: "激峭",
  syjiqiao_info:
    "出牌阶段开始时，你可将牌堆顶的X张牌置于你的武将牌上（X为你的体力上限）。当你于此出牌阶段内使用的牌结算结束后，你可以获得其中的一张牌，然后若剩余牌中红色牌和黑色牌的数量：不相等，你失去1点体力；相等，你回复1点体力。出牌阶段结束时，你将这些牌置入弃牌堆。",
  syxiongyi: "凶疑",
  syxiongyi_info:
    "限定技。当你处于濒死状态时，若剩余武将牌堆中：有“徐氏”，则你将体力值回复至3点，并将此武将牌替换为“徐氏”；没有“徐氏”，则你将体力值回复至1点并获得〖魂姿〗。",
  zhaoyan: "赵嫣",
  jinhui: "锦绘",
  jinhui_info:
    "出牌阶段限一次，你可以随机展示牌堆中的三张不具有“伤害”标签且使用目标范围为“自己”或“一名角色”的牌，然后选择一名其他角色。该角色选择并按如下“锦绘”规则使用其中一张，然后你可以按如下“锦绘”规则使用剩余的任意张牌：若此牌的使用目标为“自己”，则对自己使用该牌，否则对对方使用该牌（无距离限制且不计入次数限制）。",
  qingman: "轻幔",
  qingman_info:
    "锁定技。一名角色的回合结束时，你将手牌摸至X张（X为其装备区中空栏的数量）。",
  re_zhangbao: "张宝",
  xinzhoufu: "咒缚",
  xinzhoufu2: "咒缚",
  xinzhoufu_info:
    "①出牌阶段限一次，你可以将一张手牌置于一名其他角色的武将牌上并称为“咒”。②一名有“咒”的角色判定时，你令其以“咒”作为判定牌。",
  xinyingbing: "影兵",
  xinyingbing_info:
    "锁定技。每回合每名角色限一次，当你使用牌指定有“咒”的角色为目标后，你摸两张牌。",
  re_miheng: "祢衡",
  rekuangcai: "狂才",
  rekuangcai_info:
    "锁定技。①你于回合内使用牌无距离和次数限制。②弃牌阶段开始时，若你本回合内：未使用过牌，则你本局游戏的手牌上限+1；使用过牌但未造成过伤害，则你本局游戏的手牌上限-1。③结束阶段开始时，你摸X张牌（X为你本回合内造成的伤害且至多为5）。",
  reshejian: "舌箭",
  reshejian_info:
    "当你成为其他角色使用牌的唯一目标后，你可以弃置至少两张手牌。若如此做，你选择一项：⒈弃置其等量的牌。⒉对其造成1点伤害。",
  fengxi: "冯熙",
  yusui: "玉碎",
  yusui_info:
    "当你成为其他角色使用黑色牌的目标后，你可以失去1点体力，然后选择一项：⒈令其将手牌数弃置至与你相同；⒉令其失去Y点体力（Y为其的体力值减去你的体力值，不为正时不可选择）",
  boyan: "驳言",
  boyan_info:
    "出牌阶段限一次，你可选择一名其他角色。其将手牌摸至体力上限（至多摸至五张），然后其本回合不能使用或打出手牌。",
  re_dengzhi: "邓芝",
  jianliang: "简亮",
  jianliang_info:
    "摸牌阶段开始时，若你的手牌数不为全场最多，则你可以令至多两名角色各摸一张牌。",
  weimeng: "危盟",
  weimeng_info:
    "出牌阶段限一次，你可以获得一名其他角色的至多X张手牌，然后交给其等量的牌（X为你的体力值）。若你给出的牌点数之和：大于获得的牌，则你摸一张牌；小于获得的牌，弃置该角色区域内的一张牌。",
  haomeng: "郝萌",
  xiongmang: "雄莽",
  xiongmang_info:
    "你可将任意张花色各不相同的手牌当做目标数上限为X的【杀】使用（X为此【杀】对应的实体牌数）。此【杀】使用结算结束后，若你未造成过渠道为此牌的伤害，则你减1点体力上限。",
  yanfuren: "严夫人",
  channi: "谗逆",
  channi_info:
    "出牌阶段限一次。你可将任意张手牌交给一名其他角色，然后其可以将等量的手牌当做【决斗】使用。若其因此【决斗】造成了伤害，则其摸X张牌（X为此【决斗】对应的实体牌数）。若其因此【决斗】受到过伤害，则你弃置所有手牌。",
  nifu: "匿伏",
  nifu_info: "锁定技。一名角色的回合结束时，你将手牌摸至三张。",
  wufan: "吴范",
  tianyun: "天运",
  tianyun_info:
    "①游戏的第一个回合开始前，你从牌堆中获得手牌区内没有的花色的各一张牌。②一名角色的回合开始时，若其座位号等于游戏轮数，则你可观看牌堆顶的X张牌并以任意顺序置于牌堆顶。若你将所有的牌均置于了牌堆底，则你可以令一名角色摸X张牌，然后失去1点体力。（X为你手牌中包含的花色数）",
  wfyuyan: "预言",
  wfyuyan_info:
    "一轮游戏开始时，你选择一名角色（对其他角色不可见）：当第一次有角色于本轮内进入濒死状态时，若其是你选择的角色，则你获得〖奋音〗直到你的回合结束；当第一次有角色于本轮内造成伤害后，若其是你选择的角色，则你摸两张牌。",
  re_fengfangnv: "冯妤",
  tiqi: "涕泣",
  tiqi_info:
    "其他角色的摸牌阶段结束时/被跳过时，若其于本阶段内因摸牌而获得的牌数X不等于2，则你可以摸|X-2|张牌，并可令其本回合的手牌上限±|X-2|。",
  baoshu: "宝梳",
  baoshu_info:
    "①准备阶段，你可选择Y名角色，这些角色重置武将牌并获得(X-Y+1)个“梳”（X为你的体力上限，Y∈[1, X]）。②一名角色的摸牌阶段开始时，若其有“梳”，则其本阶段的额定摸牌数+Z且移去Z个“梳”（Z为其“梳”的数量）。",
  mamidi: "马日磾",
  bingjie: "秉节",
  bingjie_info:
    "出牌阶段开始时，你可减1点体力上限，然后当你于本阶段内使用【杀】或普通锦囊牌指定其他角色为目标后，其弃置一张牌。",
  zhengding: "正订",
  zhengding_info:
    "锁定技。当你于回合外使用或打出牌响应其他角色使用的牌时，若这两张牌花色相同，则你加1点体力上限。",
  licaiwei: "李采薇",
  yijiao: "异教",
  yijiao_info:
    "出牌阶段限一次，你可以选择一名没有“异”标记的其他角色并声明一个整数X（X∈[1,4]），该角色获得10X个“异”标记。有“异”标记的角色的结束阶段，其移去“异”标记，且若其本回合使用牌的点数之和：1.小于“异”标记数，其随机弃置一张手牌；2.等于“异”标记数，该角色本回合结束后进行一个额外的回合；3.大于“异”标记数，你摸两张牌。",
  qibie: "泣别",
  qibie_info:
    "一名角色死亡后，若你有手牌且这些手牌均可被弃置，则你可以弃置所有手牌，然后回复1点体力并摸X+1张牌（X为你弃置的牌数）。",
  dc_jiben: "吉本",
  xunli: "寻疠",
  xunli_info:
    "锁定技。①当有黑色牌因弃置而进入弃牌堆后，若X大于0，则你将其中的X张牌置于武将牌上作为“疠”（X=min(这些牌的数量，9-Y)，Y=你的“疠”数）。②出牌阶段开始时，你可以用任意张黑色手牌交换等量的“疠”。",
  zhishi: "指誓",
  zhishi_info:
    "结束阶段，你可选择一名角色。当该角色于你的下回合开始前{成为【杀】的目标后或进入濒死状态时}，你可移去任意张“疠”，然后其摸等量的牌。",
  lieyi: "烈医",
  lieyi_info:
    "出牌阶段限一次。你可以展示所有“疠”并选择一名其他角色，对其使用其中的一张可对其使用的牌（无距离和次数限制）并重复此流程，并将其余的牌置于弃牌堆。然后若其存活且未于此流程中因受到伤害而进入过濒死状态，则你失去1点体力。",
  dc_luotong: "骆统",
  renzheng: "仁政",
  renzheng_info:
    "锁定技。当有伤害被防止时，或伤害值发生过减少的伤害事件结算结束后，你摸两张牌。",
  jinjian: "进谏",
  jinjian_info:
    "①当你造成伤害时，你可令此伤害+1，然后你本回合内下一次造成的伤害-1且不触发〖进谏①〗。②当你受到伤害时，你可令此伤害-1。然后你于本回合内下一次受到的伤害+1且不触发〖进谏②〗。",
  dc_zhuling: "朱灵",
  dczhanyi: "战意",
  dczhanyi_info:
    "出牌阶段开始时，你可以弃置所有基本牌/锦囊牌/装备牌，然后获得另外两种类型的牌对应的效果直到回合结束：基本牌、你使用基本牌无距离限制，且伤害值和回复值基数+1；锦囊牌、你使用锦囊牌时摸一张牌，且锦囊牌不计入手牌上限；装备牌，当你使用装备牌时，你可弃置一名其他角色的一张牌。",
  tengyin: "滕胤",
  chenjian: "陈见",
  chenjian_info:
    "准备阶段，你可展示牌堆顶的3+X张牌（X为你“陈见”标记的数量且至多为2）。然后你可依次执行以下两项中的任意项：⒈弃置一张牌，然后令一名角色获得与你弃置牌花色相同的牌。⒉使用其中剩余的一张牌。若你执行了所有选项，则你获得一枚“陈见”，然后重铸所有手牌。",
  xixiu: "皙秀",
  xixiu_info:
    "锁定技。①当你成为其他角色使用牌的目标时，若你的装备区内有和此牌花色相同的牌，则你摸一张牌。②若你装备区内的牌数为1，则其他角色不能弃置你装备区内的牌。",
  guanning: "管宁",
  dunshi: "遁世",
  dunshi_info:
    "每回合限一次。你可以视为使用或打出一张【杀】/【闪】/【桃】/【酒】，然后当前回合角色于本回合内下一次造成伤害时，你选择两项：⒈防止此伤害。系统从技能名中包含“仁/义/礼/智/信”字样的技能中随机选择三个其未拥有的技能，然后你令当前回合角色获得其中一个技能。⒉从〖遁世〗中删除你本次使用或打出的牌并获得一个“席”。⒊减1点体力上限并摸X张牌（X为你的“席”数）。",
  dc_gaolan: "高览",
  xizhen: "袭阵",
  xizhen_info:
    "出牌阶段开始时，你可选择一名其他角色，视为对其使用【杀】或【决斗】。然后当有角色于本阶段内使用或打出牌响应你时，该角色回复1点体力，你摸一张牌（若其满体力，改为两张）。",
  caomao: "曹髦",
  qianlong: "潜龙",
  qianlong_info:
    "当你受到伤害后，你可以展示牌堆顶的三张牌并获得其中的至多X张牌（X为你已损失的体力值），然后将剩余的牌置于牌堆底。",
  fensi: "忿肆",
  fensi_info:
    "锁定技。准备阶段，你须选择一名体力值不小于你的角色并对其造成1点伤害，然后若你选择的角色不为你自己，则其视为对你使用一张【杀】。",
  juetao: "决讨",
  juetao_info:
    "限定技。出牌阶段开始时，若你的体力值为1，则你可以选择一名其他角色。你展示牌堆底的一张牌，若此牌能被你使用，则你使用此牌并重复此流程直到出现不可使用的牌或其死亡（你与其以外的角色不是此牌的合法目标）。",
  zhushi: "助势",
  zhushi_info:
    "主公技。每回合限一次，其他魏势力角色于回合内回复体力时，其可令你摸一张牌。",
  laiyinger: "来莺儿",
  xiaowu: "绡舞",
  xiaowu_info:
    "出牌阶段限一次，你可以选择任意名座位连续且包含你的上家/下家的角色。这些角色依次选择一项：⒈令你摸一张牌；⒉其摸一张牌。然后若选择选项一的角色数大于选项二的角色数，则你获得一枚“沙”；若选择选项二的角色数大于选项一的角色数，则你对这次角色依次造成1点伤害。",
  huaping: "化萍",
  huaping_info:
    "限定技。①一名其他角色死亡时，你可获得其当前拥有的所有不带有「Charlotte」标签的技能，然后你失去〖绡舞〗，移去所有“沙”并摸等量的牌。②当你死亡时，你可令一名其他角色获得〖沙舞〗和你的所有“沙”。",
  shawu: "沙舞",
  shawu_info:
    "当你使用【杀】指定目标后，你可选择一项：⒈弃置两张手牌；⒉移去一枚“沙”并摸两张牌。然后你对目标角色造成1点伤害。",
  dc_huangchengyan: "黄承彦",
  dcjiezhen: "解阵",
  dcjiezhen_info:
    "出牌阶段限一次，你可选择一名其他角色。该角色获得〖八阵〗，且其所有不为{锁定技、限定技、觉醒技、主公技、带有Charlotte标签}的技能失效。你的下回合开始时，或其因〖八卦阵〗发起的判定结算结束后，你令其恢复其以此法失效的所有技能并失去以此法获得的〖八阵〗，然后获得其区域内的一张牌。",
  dczecai: "择才",
  dczecai_info:
    "限定技。一轮游戏开始时，若游戏轮数大于1，则你可令一名其他角色获得〖集智〗直到下一轮游戏开始；若其是上一轮内使用过锦囊牌数量唯一最多的角色，则其获得一个额外的回合。",
  dcyinshi: "隐士",
  dcyinshi_info:
    "锁定技。①每回合限一次，当你受到伤害时，若此伤害的渠道不为有颜色的牌，则你防止此伤害。②当有因〖八卦阵〗发起的判定的判定牌生效时，你获得此判定牌。",
  tenggongzhu: "滕公主",
  xingchong: "幸宠",
  xingchong_info:
    "一轮游戏开始时，你可声明两个自然数X和Y，且(X+Y)≤min(5, 你的体力上限)。你摸X张牌并展示Y张手牌。若如此做，当你于本轮内失去一张以此法展示的牌后，你摸两张牌。",
  liunian: "流年",
  liunian_info:
    "锁定技。牌堆第一次洗牌后，你于回合结束时加1点体力上限；牌堆第二次洗牌后，你于本回合结束时回复1点体力，且本局游戏内的手牌上限+10。",
  zhangyao: "张媱",
  yuanyu: "怨语",
  yuanyu_info:
    "出牌阶段限一次。你可以摸一张牌，然后选择一张手牌和一名其他角色。该角色获得如下效果直到你发动〖夕颜〗：{当该角色造成1点伤害后，其须将一张手牌作为“怨”置于你的武将牌上}。然后你将你选择的手牌作为“怨”置于你的武将牌上。",
  xiyan: "夕颜",
  xiyan_info:
    "锁定技。当有牌作为“怨”移动到你的武将牌上后，若“怨”中的花色数达到4种，则你获得所有“怨”。然后若当前回合角色：是你，你本回合手牌上限+4且使用牌无次数限制；不是你，当前回合角色本回合手牌上限-4且不能使用基本牌。",
  yanrou: "阎柔",
  choutao: "仇讨",
  choutao_info:
    "当你使用【杀】时，或成为【杀】的目标后，你可以弃置此【杀】使用者的一张牌，令此【杀】不可被响应。若你是此【杀】的使用者，则你令此【杀】不计入次数限制。",
  xiangshu: "襄戍",
  xiangshu_info:
    "限定技。结束阶段开始时，若你本回合内造成过伤害，则你可以选择一名已受伤的角色。该角色回复X点体力并摸X张牌（X为你本回合内造成的伤害值总和且至多为5）。",
  caimaozhangyun: "蔡瑁张允",
  lianzhou: "连舟",
  lianzhou_info:
    "锁定技。准备阶段，你横置你的武将牌。然后你可横置任意名体力值等于你的角色。",
  jinglan: "惊澜",
  jinglan_info:
    "锁定技。当你造成伤害后，若你的手牌数：大于体力值，你弃置三张手牌；等于体力值，你弃置一张手牌并回复1点体力；小于体力值，你受到1点无来源火焰伤害并摸四张牌。",
  dc_huangzu: "黄祖",
  dcjinggong: "精弓",
  dcjinggong_info:
    "你可以将一张装备牌当做无距离限制的【杀】使用。当你声明使用此【杀】时，你将此杀的伤害值基数改为X（X为你至此【杀】第一个目标角色的距离且至多为3）。",
  dcxiaojuan: "骁隽",
  dcxiaojuan_info:
    "当你使用牌指定其他角色为唯一目标后，你可以弃置其一半的手牌（向下取整）。若这些牌中有与你使用牌花色相同的牌，则你弃置一半的手牌（向下取整）。",
  dc_yanghu: "羊祜",
  dcdeshao: "德劭",
  dcdeshao_info:
    "每回合限两次。当你成为其他角色使用的黑色牌的目标后，你可以摸一张牌，然后若其手牌数不小于你，则你弃置其一张牌。",
  dcmingfa: "明伐",
  dcmingfa_info:
    "①出牌阶段限一次。当你使用【杀】或普通锦囊牌结算结束后，若你的武将牌上没有“明伐”牌，则你可以将此牌作为“明伐”牌置于武将牌上并选择一名其他角色，记录该角色和此牌的名称。②一名角色的回合结束时，若其是你〖明伐①〗记录的角色，则你视为对其依次使用X张〖明伐①〗记录的牌，然后移去“明伐”牌（X为其手牌数且至少为1，至多为5）。③一名角色死亡时，若其是你〖明伐①〗记录的角色，则你移去“明伐”牌。",
  zhangxuan: "张嫙",
  tongli: "同礼",
  tongli_info:
    "当你于出牌阶段不因〖同礼〗而使用基本牌或普通锦囊牌指定第一个目标后，若你手牌中的花色数和你于本阶段内不因〖同礼〗而使用过的牌数相等，则你可以于此牌结算结束后依次视为对此牌的所有目标使用X张名称和属性相同的牌（X为你手牌中的花色数）。",
  shezang: "奢葬",
  shezang_info:
    "每轮限一次。当你或你回合内的其他角色进入濒死状态时，你可以从牌堆中获得每种花色的牌各一张。",
  qinyilu: "秦宜禄",
  piaoping: "漂萍",
  piaoping_info:
    "转换技，锁定技。当你使用一张牌时，阴：你摸X张牌。阳：你弃置X张牌。（X为你本阶段内发动过〖漂萍〗的次数且至多等于你的体力值）",
  tuoxian: "托献",
  tuoxian_info:
    "当你因执行〖漂萍〗的效果而弃置牌后，你可以弃置一枚“栗”并令一名其他角色获得这些牌，然后令该角色选择一项：⒈弃置区域内等量的牌。⒉令你的〖漂萍〗失效直到回合结束。",
  chuaili: "惴栗",
  chuaili_info:
    "锁定技。当你成为其他角色使用黑色牌的目标后，若你的〖漂萍〗：处于阳状态，则你将〖漂萍〗转换至阴状态；处于阴状态，则你获得一枚“栗”，且令〖惴栗〗于本回合内失效。",
  dc_liuyu: "刘虞",
  dcsuifu: "绥抚",
  dcsuifu_info:
    "其他角色的结束阶段开始时，若你和一号位本回合内累计受到过的伤害值大于1，则你可以将该角色的所有手牌置于牌堆顶，然后视为使用一张【五谷丰登】。",
  dcpijing: "辟境",
  dcpijing_info:
    "结束阶段开始时，你可以选择任意名角色。你令所有未选择的角色失去〖自牧〗，然后你和这些角色获得〖自牧〗。",
  dczimu: "自牧",
  dczimu_info:
    "锁定技。当你受到伤害后，你令所有拥有〖自牧〗的其他角色各摸一张牌，然后你失去〖自牧〗。",
  caohua: "曹华",
  caiyi: "彩翼",
  caiyi_info:
    "转换技。结束阶段，你可令一名角色选择并执行一项，然后移除此选项。阴：⒈回复X点体力。⒉摸X张牌，⒊复原武将牌。⒋随机执行一个已经移除过的阴选项；阳：⒈受到X点伤害。⒉弃置X张牌。⒊翻面并横置。⒋随机执行一个已经移除过的阳选项。（X为该阴阳态剩余选项的数量）。",
  guili: "归离",
  guili_info:
    "你的第一个回合开始时，你须选择一名其他角色。该角色每轮的第一个回合结束后，若其本回合内未造成过伤害，则你执行一个额外的回合。",
  dc_jiling: "纪灵",
  dcshuangren: "双刃",
  dcshuangren_info:
    "出牌阶段开始时，你可以和一名其他角色A进行拼点。若你赢，你选择一名角色B，或选择包含A在内的两名角色A和B（B的势力需与A相同），然后视为对被选择的角色使用一张【杀】（不计入次数限制）；若你没赢，则你本阶段内不能使用【杀】。",
  dc_sunru: "孙茹",
  xiecui: "撷翠",
  xiecui_info:
    "当有角色于回合内第一次因执行牌的效果而造成伤害时，你可以令此伤害+1。若其势力为吴，则该角色获得此伤害牌对应的实体牌，且其本回合的手牌上限+1。",
  youxu: "忧恤",
  youxu_info:
    "一名角色A的回合结束时，若其手牌数大于体力值，则你可以展示A的一张牌，然后将此牌交给另一名角色B。若B的体力值为全场最少，则B回复1点体力。",
  zhaoang: "赵昂",
  dczhongjie: "忠节",
  dczhongjie_info:
    "每轮限一次。当有角色因失去体力而进入濒死状态时，你可令其回复1点体力并摸一张牌。",
  dcsushou: "夙守",
  dcsushou_tag: "对方手牌",
  dcsushou_info:
    "一名角色的出牌阶段开始时，若其手牌数为全场唯一最多，则你可以失去1点体力并摸X张牌。然后若该角色不是你，则你可以观看其一半的手牌（向下取整），且用至多X张手牌替换其中等量的牌。（X为你已损失的体力值）",
  dc_wangchang: "王昶",
  dckaiji: "开济",
  dckaiji_info:
    "转换技。出牌阶段限一次，你可以：阴：摸X张牌；阳：弃置至多X张牌（X为你的体力上限且至多为5）。",
  dcpingxi: "平袭",
  dcpingxi_info:
    "结束阶段，若X大于0，则你可以选择至多X名其他角色（X为本回合内因弃置而进入弃牌堆的牌数）。你依次弃置这些角色的各一张牌，然后视为对这些角色使用一张【杀】。",
  fengfang: "冯方",
  dcditing: "谛听",
  dcditing_info:
    "其他角色的出牌阶段开始时，若你在该角色的攻击范围内，则你可以观看其的X张手牌（X为你的体力值）并选择其中一张，且获得如下效果：①当其使用对应实体牌包含此牌的牌指定你为目标后，你令此牌对你无效。②当其使用对应实体牌包含此牌的牌结算结束后，若你不是此牌的目标，则你摸两张牌。③其出牌阶段结束时，若此牌位于其的手牌区，则你获得此牌。",
  dcbihuo: "避祸",
  dcbihuo_info:
    "①当你受到其他角色造成的伤害后，你可令一名角色下回合摸牌阶段的额定摸牌数+1。②当你对其他角色造成伤害后，你可令一名角色下回合摸牌阶段的额定摸牌数-1。",
  zhangxun: "张勋",
  suizheng: "随征",
  suizheng_info:
    "结束阶段，你可以选择一名角色Ａ，获得如下效果直到其下回合结束：①Ａ于下回合出牌阶段内使用【杀】的次数上限+1且无距离限制；②Ａ下回合的出牌阶段结束时，你可以选择一名此阶段内受到过Ａ造成的伤害的角色Ｂ，视为对Ｂ使用一张【杀】。",
  dc_liuba: "刘巴",
  dczhubi: "铸币",
  dczhubi_info:
    "当有♦牌因弃置而进入弃牌堆后，你可以令系统从牌堆/弃牌堆中检索一张【无中生有】，并将此牌置于牌堆顶。",
  dcliuzhuan: "流转",
  dcliuzhuan_tag: "转",
  dcliuzhuan_info:
    "锁定技。①其他角色于其回合内不于摸牌阶段而获得的牌称为“转”。②你不能成为实体牌中包含“转”的牌的目标。③当有“转”直接进入弃牌堆或经由处理区进入弃牌堆后，你获得之。",
  xiahoulingnv: "夏侯令女",
  fuping: "浮萍",
  fuping_info:
    "①其他角色对你使用的结算结束后，若你未因此技能记录过此牌的名称且你有未废除的装备栏，则你可以废除一个装备栏，记录此牌的名称。②每回合每种牌名限一次。你可以将一张非基本牌当做〖浮萍①〗记录过的基本牌或锦囊牌使用或打出。③若你的所有装备栏均已被废除，则你使用牌无距离限制。",
  weilie: "炜烈",
  weilie_info:
    "每局游戏限X次。出牌阶段，你可以弃置一张牌并选择一名已受伤的角色，令该角色回复1点体力。然后若其体力值小于体力上限，则其摸一张牌（X为你〖浮萍①〗中的记录数+1）。",
  bianxi: "卞喜",
  dunxi: "钝袭",
  dunxi_info:
    "①当你使用具有伤害标签的牌结算结束后，你可以令一名不为你的目标角色获得一枚“钝”。②有“钝”的角色使用基本牌或锦囊牌指定唯一目标时，你令其移去一枚“钝”。系统随机选择一名角色，并将此牌的目标改为该角色。若该角色和原目标相同，则其移去所有“钝”，失去1点体力。若其正处于出牌阶段内，则结束此阶段。",
  niufu: "牛辅",
  dcxiaoxi: "宵袭",
  dcxiaoxi_info:
    "锁定技。出牌阶段开始时，你声明X并减X点体力上限（X∈[1,2]）。然后你选择一名攻击范围内的其他角色并选择一项：⒈获得该角色的X张牌。⒉视为对其使用X张【杀】。",
  xiongrao: "熊扰",
  xiongrao_info:
    "限定技。准备阶段开始时，你可以选择所有其他角色。这些角色本回合内所有不为锁定技、限定技、觉醒技的普通技能失效。然后你将体力上限增加至7点并摸X张牌（X为你以此法增加的体力上限数）。",
  huzhao: "胡昭",
  midu: "弥笃",
  midu_info:
    "出牌阶段限一次。你可以选择一项：⒈废除任意个装备栏，并令一名角色摸等量的牌。⒉恢复一个已经被废除的装备栏，然后你获得〖活墨〗直到下回合开始。",
  xianwang: "贤望",
  xianwang_info:
    "锁定技。若你有被废除的装备栏，则其他角色至你的距离+1；若废除的装备栏数大于2，则改为距离+2。",
  guanhai: "管亥",
  suoliang: "索粮",
  suoliang_info:
    "每回合限一次。当你对其他角色造成伤害后，你可以选择其的至多X张牌（X为其体力上限且至多为5）。若这些牌中有♥或♣牌，则你获得这些牌；否则你弃置这些牌。",
  qinbao: "侵暴",
  qinbao_info:
    "锁定技。当你使用【杀】或普通锦囊牌时，你令所有手牌数不小于你的角色不能响应此牌。",

  sp_whlw: "文和乱武",
  sp_zlzy: "逐鹿中原",
  sp_longzhou: "同舟共济",
  sp_zizouqi: "自走棋",
  sp_sbfm: "上兵伐谋",
  sp_shengun: "三国奇人传",
  sp_baigei: "荟萃·无双上将",
  sp_guandu: "官渡之战",
  sp_huangjin: "列传·黄巾之乱",
  sp_fadong: "列传·诸侯伐董",
  sp_xuzhou: "列传·徐州风云",
  sp_caizijiaren: "荟萃·才子佳人",
  sp_qihuan: "戚宦之争",
  sp_zhongyuan: "列传·中原狼烟",
  sp_binglin: "兵临城下",
  sp_xiaohu: "列传·虓虎悲歌",
  sp_yinyu: "隐玉包",
  sp_zhilan: "荟萃·芝兰玉树",
  sp_zongheng: "荟萃·纵横捭阖",
  sp_fenghuo: "烽火连天",
  sp_guixin: "荟萃·天下归心",
  sp_danqi: "千里单骑",
  sp2_huben: "限定·百战虎贲",
  sp2_shengun: "限定·奇人异士",
  sp2_huangjia: "限定·皇家贵胄",
  sp2_zhangtai: "限定·章台春望",
  sp2_jinse: "限定·锦瑟良缘",
  sp_decade: "其他新服武将",
};
export const translate_standard = {
  caocao: "曹操",
  hujia: "护驾",
  hujia_info:
    "主公技，当你需要使用或打出一张【闪】时，你可以令其他魏势力角色选择是否打出一张【闪】。若有角色响应，则你视为使用或打出了一张【闪】。",
  jianxiong: "奸雄",
  jianxiong_info: "当你受到伤害后，你可以获得对你造成伤害的牌。",

  simayi: "司马懿",
  fankui: "反馈",
  fankui_info: "当你受到伤害后，你可以获得伤害来源的一张牌。",
  guicai: "鬼才",
  guicai_info: "一名角色的判定牌生效前，你可以打出一张手牌代替之。",
  guicai_info_guozhan: "一名角色的判定牌生效前，你可以打出一张牌代替之。",

  xiahoudun: "夏侯惇",
  zhangliao: "张辽",
  xuzhu: "许褚",
  guojia: "郭嘉",
  zhenji: "甄宓",
  liubei: "刘备",
  guanyu: "关羽",
  zhangfei: "张飞",
  zhugeliang: "诸葛亮",
  zhaoyun: "赵云",
  machao: "马超",
  huangyueying: "黄月英",
  sunquan: "孙权",
  ganning: "甘宁",
  lvmeng: "吕蒙",
  huanggai: "黄盖",
  zhouyu: "周瑜",
  daqiao: "大乔",
  luxun: "陆逊",
  sunshangxiang: "孙尚香",
  huatuo: "华佗",
  lvbu: "吕布",
  diaochan: "貂蝉",
  huaxiong: "华雄",
  xf_yiji: "伊籍",
  re_yuanshu: "袁术",
  caozhang: "曹彰",

  ganglie: "刚烈",
  tuxi: "突袭",
  luoyi: "裸衣",
  luoyi2: "裸衣",
  tiandu: "天妒",
  yiji: "遗计",
  luoshen: "洛神",
  xinluoshen: "洛神",
  qingguo: "倾国",
  rende: "仁德",
  jijiang: "激将",
  jijiang1: "激将",
  jijiang2: "激将",
  wusheng: "武圣",
  paoxiao: "咆哮",
  guanxing: "观星",
  kongcheng: "空城",
  kongcheng1: "空城",
  longdan: "龙胆",
  longdan1: "龙胆",
  longdan2: "龙胆",
  mashu: "马术",
  mashu2: "马术",
  feiying: "飞影",
  tieji: "铁骑",
  jizhi: "集智",
  qicai: "奇才",
  zhiheng: "制衡",
  jiuyuan: "救援",
  qixi: "奇袭",
  keji: "克己",
  kurou: "苦肉",
  yingzi: "英姿",
  fanjian: "反间",
  guose: "国色",
  liuli: "流离",
  qianxun: "谦逊",
  lianying: "连营",
  xiaoji: "枭姬",
  jieyin: "结姻",
  xinjieyin: "结姻",
  qingnang: "青囊",
  jijiu: "急救",
  wushuang: "无双",
  wushuang1: "无双",
  wushuang2: "无双",
  lijian: "离间",
  biyue: "闭月",
  xinbiyue: "闭月",
  pileTop: "牌堆顶",
  pileBottom: "牌堆底",
  ganglie_info:
    "当你受到伤害后，你可以判定。若结果不为红桃，则伤害来源须弃置两张手牌，否则受到来自你的一点伤害。",
  tuxi_info: "摸牌阶段，你可以改为获得至多两名其他角色的各一张手牌。",
  luoyi_info:
    "摸牌阶段，你可以少摸一张牌。若如此做，当你本回合内使用【杀】或【决斗】造成伤害时，此伤害+1。",
  tiandu_info: "当你的判定牌生效后，你可以获得之。",
  yiji_info:
    "当你受到一点伤害后，你可以观看牌堆顶的两张牌，然后将其分配给任意角色。",
  luoshen_info:
    "准备阶段，你可以判定。若结果为黑色，你获得判定牌。你可重复此流程，直到出现红色的判定结果。",
  luoshen_info_guozhan:
    "准备阶段，你可以判定。若结果为黑色，则可以继续判定，直到出现红色的判定牌。然后你获得所有黑色的判定牌。（判定结果为黑色的牌在此过程中不会进入弃牌堆）",
  xinluoshen_info:
    "准备阶段，你可以判定，若为黑色则可以继续判定，直到出现红色。然后你获得所有黑色的判定牌",
  xinluoshen_info_alter:
    "准备阶段，你可以判定，若为黑色则可以继续判定，直到出现红色。然后你获得所有黑色的判定牌。你通过洛神获得的牌，不计入当前回合的手牌上限",
  qingguo_info: "你可以将一张黑色手牌当做【闪】使用或打出。",
  rende_info:
    "出牌阶段，你可以将任意张手牌交给其他角色。当你以此法于一回合内给出第二张牌时，你回复1点体力。",
  jijiang_info:
    "主公技，当你需要使用或打出【杀】时，你可以令其他蜀势力角色依次选择是否打出一张【杀】。若有角色响应，则你视为使用或打出了此【杀】。",
  wusheng_info: "你可以将一张红色牌当做【杀】使用或打出。",
  paoxiao_info: "锁定技，出牌阶段，你使用【杀】没有数量限制。",
  guanxing_info:
    "准备阶段，你可以观看牌堆顶的X张牌，并将其以任意顺序置于牌堆项或牌堆底。（X为存活角色数且至多为5）",
  kongcheng_info: "锁定技，当你没有手牌时，你不能成为【杀】或【决斗】的目标。",
  longdan_info: "你可以将【杀】当做【闪】，或将【闪】当做【杀】使用或打出。",
  mashu_info: "锁定技，你计算与其他角色的距离时-1。",
  mashu2_info: "锁定技，你计算与其他角色的距离时-1。",
  feiying_info: "锁定技，其他角色计算与你的距离时+1。",
  tieji_info:
    "当你使用【杀】指定目标后，你可以进行判定。若结果为红色，则此【杀】不可被闪避。",
  jizhi_info: "当你使用非转化的普通锦囊牌时，你可以摸一张牌。",
  xinjizhi: "集智",
  xinjizhi_info: "当你使用非转化的普通锦囊牌时，你可以摸一张牌。",
  xinjizhi_info_alter:
    "每当你使用一张非转化的锦囊牌，可以摸一张牌，如果摸到的是基本牌，你可以弃置这张牌，然后本回合手牌上限+1",
  xinqicai: "奇才",
  xinqicai_info: "锁定技，你使用锦囊牌无距离限制。",
  xinqicai_info_alter:
    "锁定技，你使用的锦囊牌无距离限制，你装备区内的牌不能被弃置",
  qicai_info: "锁定技，你使用锦囊牌无距离限制。",
  zhiheng_info: "出牌阶段一次，你可以弃置任意张牌，然后摸等量的牌。",
  xinzhiheng: "制衡",
  xinzhiheng_info: "出牌阶段限1次，你可以弃置任意张牌并摸等量的牌",
  xinzhiheng_info_alter:
    "出牌阶段限1次，你可以弃置任意张牌并摸等量的牌，如果在发动制衡时弃置了所有手牌，你额外摸一张牌",
  jiuyuan_info: "主公技，锁定技，其他吴势力角色对你使用的【桃】的回复值+1。",
  xinjiuyuan: "救援",
  xinjiuyuan_info:
    "主公技，锁定技，濒死阶段，吴势力角色对你使用的[桃]额外回复一点体力",
  xinjiuyuan_info_alter:
    "主公技，其他吴国角色对自己使用【桃】时，如果他的体力值大于你，他可以选择让你回复1点体力，然后他摸1张牌",
  qixi_info: "你可以将一张黑色牌当做【过河拆桥】使用。",
  keji_info:
    "弃牌阶段开始时，若你于本回合的出牌阶段内没有过使用或打出过【杀】，则你可以跳过此阶段。",
  kurou_info: "出牌阶段，你可以失去一点体力，然后摸两张牌。",
  yingzi_info: "摸牌阶段，你可以多摸一张牌。",
  fanjian_info:
    "出牌阶段限一次，你可以令一名角色选择一种花色并展示你的一张手牌，若选择的花色与展示的不同，该角色受到来自你的一点伤害。然后该角色获得展示的牌。",
  guose_info: "你可以将一张方片手牌当做【乐不思蜀】使用。",
  liuli_info:
    "当你成为【杀】的目标时，你可以弃置一张牌并将此【杀】转移给攻击范围内的一名其他角色（不能是此【杀】的使用者）。",
  qianxun_info: "锁定技，你不能成为【顺手牵羊】和【乐不思蜀】的目标。",
  lianying_info: "当你失去最后的手牌时，你可以摸一张牌。",
  xiaoji_info: "当你失去一张装备区内的牌后，你可以摸两张牌。",
  jieyin_info:
    "出牌阶段限一次，你可以弃置两张手牌并选择一名已经受伤的男性角色。你与其各回复一点体力。",
  xinjieyin_info:
    "出牌阶段，你可以弃置两张牌并选择1名已经受伤的男性角色，你与其各回复一点体力，每阶段限一次",
  xinjieyin_old_info:
    "出牌阶段，你可以弃置两张牌并选择1名已经受伤的男性角色，你与其各回复一点体力。每阶段限一次。",
  xinjieyin_new_info:
    "出牌阶段限1次，你可以选择一名男性角色，弃置一张手牌或将一张装备牌置于其装备区，你与其体力较高的角色摸一张牌，体力值较低的角色回复1点体力",
  xinjieyin_info_alter:
    "出牌阶段限1次，你可以选择一名男性角色，弃置一张手牌或将一张装备牌置于其装备区，你与其体力较高的角色摸一张牌，体力值较低的角色回复1点体力",
  qingnang_info: "出牌阶段限一次，你可以弃置一张手牌并令一名角色回复一点体力。",
  jijiu_info: "你的回合外，你可以将一张红色牌当做【桃】使用。",
  wushuang_info:
    "锁定技，当你使用【杀】或【决斗】指定目标后，你令此牌需要依次使用或打出两张【闪】或【杀】响应。",
  lijian_info:
    "出牌阶段限一次，你可以弃置一张牌，视为一名男性角色对另一名男性角色使用一张【决斗】（不可被【无懈可击】响应）。",
  biyue_info: "结束阶段，你可以摸一张牌。",
  xinbiyue_info: "结束阶段，你可以摸一张牌",
  xinbiyue_info_alter: "结束阶段，你可以摸一张牌，如果你没有手牌，改为摸2张牌",
  yaowu: "耀武",
  yaowu_info:
    "锁定技，一名角色使用红色【杀】对你造成伤害时，该角色回复1点体力或摸一张牌。",
  new_jiangchi: "将驰",
  new_jiangchi_info:
    "摸牌阶段结束时，你可以选择一项：1、摸一张牌，若如此做，你本回合内不能使用或打出【杀】且【杀】不计入手牌上限。 2、弃置一张牌，若如此做，出牌阶段你使用【杀】无距离限制且你可以额外使用一张【杀】，直到回合结束。",
  xinfu_jijie: "机捷",
  xinfu_jijie_info:
    "出牌阶段限一次。你可以观看牌堆底的一张牌，然后将其交给一名角色。",
  xinfu_jiyuan: "急援",
  xinfu_jiyuan_info:
    "当一名角色进入濒死状态时，或你交给一名其他角色牌时，你可以令其摸一张牌。",
  ganglie_three: "刚烈",
  ganglie_three_info:
    "当你受到伤害后，你可令一名敌方角色判定。若结果不为♥，其弃置两张牌或受到来自你的1点伤害。",
  zhongyi: "忠义",
  zhongyi2: "忠义",
  zhongyi_info:
    "限定技，出牌阶段，你可以将一张牌置于武将牌上。你的武将牌上有〖忠义〗牌时，己方角色使用【杀】造成的伤害+1。下轮游戏开始时，你将〖忠义〗牌置入弃牌堆。",
  zhanshen: "战神",
  zhanshen_info:
    "觉醒技，准备阶段，若场上有已死亡的其他己方角色且你已受伤，则你弃置装备区的武器牌，减1点体力上限，获得技能〖马术〗和〖神戟〗。",
  shenji: "神戟",
  shenji_info: "锁定技，你使用【杀】指定的目标数上限+2，次数上限+1。",
  rewangzun: "妄尊",
  rewangzun2: "妄尊",
  rewangzun_info:
    "锁定技，一名其他角色的准备阶段开始时，若其体力值大于你，你摸一张牌。然后若其身份为主公/主帅/君主/地主且明置，则你摸一张牌，且其本回合的手牌上限-1。",
  retongji: "同疾",
  retongji_info:
    "攻击范围内包含你的角色成为【杀】的目标时，若你不是此【杀】的使用者或目标，其可弃置一张牌，然后将此【杀】转移给你。",
  re_xushu: "徐庶",
  re_lidian: "李典",

  standard_2008: "2008版标准包",
  standard_2013: "2013版标准包",
  standard_2019: "2019版标准包",
};
export const translate_swd = {
  swd_yangshuo: "杨硕",
  swd_septem: "赛特",
  swd_yuxiaoxue: "于小雪",
  swd_lilian: "莉莲",
  swd_cheyun: "车芸",
  swd_jipeng: "疾鹏",
  swd_muyun: "徐暮云",
  swd_zhaoyun: "皇甫朝云",
  swd_jiliang: "姬良",
  swd_lanyin: "兰茵",
  swd_zhiyin: "芝茵",
  swd_hengai: "横艾",
  swd_huzhongxian: "壶中仙",
  swd_qiner: "磬儿",
  swd_huanyuanzhi: "桓远之",
  swd_murongshi: "慕容诗",
  swd_hupo: "琥珀",
  swd_miles: "麦尔斯",
  swd_kangnalishi: "康那里士",
  swd_satan: "撒旦",
  swd_philis: "菲力斯",
  swd_weida: "薇达",
  swd_fengtianling: "凤天凌",
  swd_huyue: "瑚月",
  swd_jiting: "姬亭",
  swd_rongshuang: "蓉霜",
  swd_zhuoshanzhu: "浊山铸",
  swd_jialanduo: "迦兰多",
  swd_linming: "林明",
  swd_duanmeng: "端蒙",
  swd_nicole: "妮可",
  swd_kendi: "肯迪",
  swd_lijing: "李靖",
  swd_hanteng: "韩腾",
  swd_yuwentuo: "宇文拓",
  swd_shanxiaoxiao: "单小小",
  swd_yuchiyanhong: "尉迟嫣红",
  swd_pepin: "丕平",
  swd_anka: "安卡",
  swd_jiangwu: "疆梧",
  swd_situqiang: "司徒蔷",
  swd_tuwei: "徒维",
  swd_yeyaxi: "耶亚希",
  swd_chunyuheng: "淳于恒",
  swd_duguningke: "独孤宁珂",
  swd_duguningke2: "魔化宁珂",
  swd_chenjingchou: "陈靖仇",
  swd_zhanglie: "张烈",
  swd_guyue: "古月圣",
  swd_kama: "卡玛",
  swd_yuli: "玉澧",
  swd_duopeng: "多鹏",
  swd_jiangziya: "姜子牙",
  swd_heran: "何然",
  swd_zhanggao: "张诰",
  swd_hanlong: "韩龙",
  swd_jiuyou: "久悠",
  swd_qingming: "青冥",
  swd_shangzhang: "尚章",
  swd_youzhao: "游兆",
  swd_wangsiyue: "王思月",
  swd_huanglei: "黄雷",
  swd_tuobayuer: "拓跋玉儿",
  swd_tuobayueer: "拓跋月儿",
  swd_chengyaojin: "程咬金",
  swd_qinshubao: "秦叔宝",
  swd_lishimin: "李世民",
  swd_shuijing: "水镜",
  swd_xuanyuanjianxian: "轩辕剑仙",
  swd_xuanyuanjiantong: "轩辕剑童",
  swd_luchengxuan: "陆承轩",
  swd_xiarou: "夏柔",
  swd_moye: "莫耶",
  swd_fu: "毛民·福",
  swd_hanluo: "寒洛",
  swd_linyue: "临月",
  swd_zidashu: "子大暑",
  swd_maixing: "麦星",
  swd_haidapang: "海大胖",
  swd_shaowei: "少微",
  swd_fuyan: "符验",
  swd_huiyan: "慧彦",
  swd_sikongyu: "司空宇",
  swd_muyue: "沐月",
  swd_ziqiao: "子巧",
  swd_fengyu: "凤煜",
  swd_qi: "柒",
  swd_chenfu: "陈辅",
  swd_libai: "李白",
  swd_xingtian: "刑天",
  swd_lanmoshen: "蓝魔神",
  swd_wushi: "巫师",
  swd_quxian: "屈娴",
  swd_xiyan: "犀衍",
  swd_shuwaner: "舒莞儿",
  swd_xiaohuanglong: "小黄龙",

  cyshuiyun: "水云",
  cyshuiyun_info:
    "准备阶段，你可以弃置一名其他角色的一张牌；每当你失去此技能，你可以弃置一名其他角色的一张牌",
  cyliuzi: "流紫",
  cyliuzi_info:
    "摸牌阶段，你可以额外摸一张牌；每当你失去此技能，你可以摸一张牌",
  cyyijin: "异金",
  cyyijin_info:
    "出牌阶段，你可以对一名体力值为全场最多的角色造成一点伤害；每当你失去此技能，你可以对一名体力值为全场最多的角色造成一点伤害",
  cyqingling: "青凌",
  cyqingling_info:
    "弃牌阶段，若你弃置了至少一张牌，你可以获得一点护甲；每当你失去此技能，你可以获得一点护甲",
  cyqiandian: "千靛",
  cyqiandian_info:
    "结束阶段，你可以视为使用一张惊雷闪；每当你失去此技能，你可以视为使用一张惊雷闪",
  gxianyin: "仙音",
  gxianyin_info:
    "出牌阶段限一次，你可以选择一种花色，将你的手牌中该花色的牌移至弃牌堆，然后选择另一种花色，从牌堆中获得等量的该花色的牌",
  // gxianyin_info_alter:'',
  cyxianjiang: "仙匠",
  cyxianjiang_info:
    "每当你使用一张牌指定惟一目标时，你可以复制对方装备区内的一张你没有的牌，并置入你的装备区，每回合对一名角色最多发动一次",
  cyqiaoxie: "巧械",
  cyqiaoxie_info:
    "每当你失去一张装备牌（使用除外），你可以随机观看三张机关牌，并使用其中一张",
  cyqiaoxie_info_alter:
    "每当你装备一件装备，若你的手牌数不大于体力值，你可以摸一张牌；每当你失去一件装备牌，你可以随机观看2张机关牌，并使用其中一张",
  cyzhencha: "侦察",
  cyzhencha_info:
    "出牌阶段限一次，若你的装备区内的可强化装备，你可以弃置一张基本牌并观看一名其他角色的手牌，若其中有与你弃置的牌颜色相同的牌，你随机升级装备区内的一件装备，否则你摸一张牌；你根据装备区内升级的装备数获得额外技能",
  cylingjia: "灵甲",
  cylingjia_info:
    "出牌阶段限一次，你可以弃置一张装备牌，然后令云狐随机装备一件装备（不替换现有装备）并将其强化",
  cyqiaobo: "巧补",
  cyqiaobo_info: "出牌阶段限一次，你可以弃置一张锦囊牌，然后令云狐回复一点体力",
  cqiaoxie: "巧械",
  cqiaoxie_info:
    "出牌阶段限一次，你可以将一张锦囊牌当作零件袋使用；每当你使用一张零件牌，你获得一点技能点数",
  xiufu: "修复",
  xiufu_info: "出牌阶段，你可以弃置一张装备牌或机关牌，令云狐回复一点体力",
  yhshengong: "神工",
  yhshengong_info:
    "游戏开始时，你获得3点技能点数；每当你造成一点伤害，你获得一点技能点数；出牌阶段，你可以通过消耗技能点令云狐获得新的技能（云狐体力为0时无法学习或发动技能）",
  juxi: "聚息",
  juxi_info:
    "锁定技，每当一名角色于其回合外弃置牌，你获得一枚聚息标记；出牌阶段限一次，你可以移去X枚聚息标记，然后选择一项：对一名角造成一点伤害，或令一名角色回复一点体力，X为存活角色数",
  yeying: "曳影",
  yeying_info: "出牌阶段限一次，你可以将一张黑色牌当作乾坤镖使用",
  jiefen: "解纷",
  jiefen_info:
    "出牌阶段限一次，你可以令一名手牌数多于你的角色交给你一张牌，然后你交给一名手牌数少于你的角色一张牌",
  datong: "大同",
  datong_info:
    "任意一名角色的结束阶段，若全场手牌数最多和最少的角色手牌数之差不超过1，你摸两张牌",
  huodan: "火丹",
  huodan_info:
    "出牌阶段限一次，你可以弃置一张红色牌并失去一点体力，然后将两点火属性伤害分配给1~2名角色",
  huodan_info_alter:
    "出牌阶段限一次，你可以弃置一张红色牌并失去一点体力，然后将两点火属性伤害分配给1~2名角色；若你只分配了一名角色，该角色在结算后摸一张牌",
  sxianjing: "陷阱",
  sxianjing_bg: "阱",
  sxianjing_info:
    "出牌阶段，你可以将一张手牌背面朝上置于你的武将牌上（不能与已有花色相同）。当一名其他角色使用与一张“陷阱”牌花色相同的牌指定你为目标时，你移去对应的“陷阱”牌，然后随机获得该角色的一张牌。每当你受到一次伤害，你随机将一张“陷阱”牌返回手牌",
  zhanxing: "占星",
  zhanxing_info:
    "出牌阶段限一次，你可以弃置任意张牌，并亮出牌堆顶的等量的牌，并根据亮出的牌包含的花色执行以下效果：♦︎摸两张牌；♥回复一点体力（若未损失体力改为获得一点护甲）；♣令所有敌人随机弃置一张牌；♠令一名角色受到一点无来源的雷属性伤害",
  kbolan: "博览",
  kbolan_info:
    "每当你摸牌时，你可以额外摸一张牌，然后摸牌结束时将一张手牌置于牌堆顶",
  gaizao: "改造",
  gaizao_info:
    "每当你即将装备一张牌（特殊类装备除外），若你的装备区内对应位置已有牌，你可以永久改变此牌的装备类型使其装备在装备区内的空余位置",
  lingshi: "灵矢",
  lingshi_info:
    "你的装备区内每有一张牌，你的攻击范围+2；当你的装备区内有武器牌或防具牌时，你的杀不可闪避；当你的装备区内有马时，你摸牌阶段额外摸一张牌；当你的装备内的宝物牌时，你回合内可以额外使用一张杀",
  tiebi: "铁壁",
  tiebi_info:
    "当距离你1以内的一名角色成为杀的目标时，若其没有护甲，你可以弃置一张黑色手牌使其获得一点护甲",
  shenyan: "神炎",
  shenyan_bg: "炎",
  shenyan_info:
    "限定技，当你即将造成火焰伤害时，你可以令此伤害+1，并对目标距离1以内的所有其他角色各造成一点火焰伤害",
  xuanying: "旋影",
  xuanying_info:
    "你可以横置你的武将牌，视为使用一张无视距离的杀；每当你于回合外失去牌，你可以竖置你的武将牌，视为使用一张无视距离的杀",
  hwendao: "问道",
  hwendao_info:
    "每当你于回合外使用或打出一张牌，你可以令当前回合角色弃置一张与之花色相同的牌，否则你获得其一张牌",
  lingfeng: "凌锋",
  lingfeng_info:
    "结束阶段，若你本回合内使用了至少X张牌，你可以选择一项：获得一点护甲，或对攻击范围内的一名角色造成一点伤害（X为你当前的体力值且最多为3）",
  hxunzhi: "殉志",
  hxunzhi_info:
    "限定技，出牌阶段，你可以视为使用一张万箭齐发并获得技能武圣、咆哮，若如此做，你在此阶段结束时死亡",
  hxunzhi_info_alter:
    "限定技，出牌阶段，你可以获得技能武圣、咆哮，若如此做，你在此阶段结束时死亡",
  lmazui: "麻醉",
  lmazui2: "麻醉",
  lmazui_info:
    "出牌阶段限一次，你可以将一张黑色手牌置于一名角色的武将牌上，该角色造成的下一次伤害-1，然后获得此牌",
  hyunshen: "云身",
  hyunshen2: "云身",
  hyunshen_info:
    "每当你打出一张闪，你可以令你的防御距离+1；准备阶段，你将累计的防御距离清零，然后摸等量的牌",
  hlingbo: "凌波",
  hlingbo_info: "每当你使用或打出一张闪，你可以摸两张牌",
  gtiandao: "天道",
  gtiandao_info: "任意一名角色的判定生效前，你可以打出一张牌替换之",
  nlianji: "连计",
  nlianji_info:
    "出牌阶段限一次，你可以选择一张手牌并指定两名角色进行拼点。若拼点结果不为平局，拼点赢的角色获得此牌，并对没赢的角色造成一点伤害。",
  fengze: "风泽",
  fengze_info: "出牌阶段限一次，你可以将一张黑色牌当作桃园结义使用",
  lingyue: "凌月",
  lingyue_info: "每当你使用一张杀，你可以令目标弃置一张牌",
  jinlin: "金鳞",
  jinlin_info:
    "限定技，出牌阶段，你可以令任意名角色各获得3点护甲，获得护甲的角色于每个准备阶段失去1点护甲，直到首次失去所有护甲或累计以此法失去3点护甲",
  huanxia: "幻霞",
  huanxia_info:
    "你可以将一张红色牌当作杀使用，若此杀未造成伤害，你在结束阶段收回此牌",
  jingjie: "幻镜",
  jingjie_info: "准备阶段，你可以流失一点体力，并",
  jingjie_old_info:
    "限定技，出牌阶段，你可以令所有角色弃置所有牌，然后摸两张牌（不触发任何技能）",
  kongmo: "恐魔",
  kongmo_info: "锁定技，你使用基本牌或普通锦囊牌后将额外结算一次卡牌效果",
  jufu: "巨斧",
  jufu_info: "锁定技，当你有武器牌时，杀造成的伤害+1",
  huajing: "化精",
  huajing_info: "每当你使用锦囊牌造成伤害，可以回复一点体力并摸一张牌",
  pingxu: "冯虚",
  pingxu_info:
    "锁定技，当你没有武器牌时，你的进攻距离+1；当你没有防具牌时，你的防御距离+1",
  yudun: "愚钝",
  yudun_info:
    "锁定技，你无法使用锦囊牌；你可以将两张锦囊牌当作一张不计入出杀次数的杀使用",
  bingfeng: "冰封",
  bingfeng2: "冰封",
  bingfeng2_info: "不能使用或打出手牌",
  bingfeng_info:
    "限定技，出牌阶段，你可以指定至多三个目标与其一同翻面，且处于翻面状态时不能使用或打出手牌；若如此做，你失去技能玄咒并减少一点体力上限",
  guozao: "聒噪",
  guozao_info:
    "锁定技，每当距离你1以内的角色受到一次伤害，若伤害来源不你，你须观看牌堆顶的三张牌，然后指定距离2以内的一名有手牌角色将手牌与这些牌交换",
  guozao_info_alter:
    "锁定技，每当距离你1以内的角色受到一次伤害，若伤害来源不你，你须观看牌堆顶的三张牌，然后指定距离1以内的一名有手牌角色将手牌与这些牌交换",
  heihuo: "黑火",
  heihuo_info:
    "出牌阶段，你可以弃置一张装备牌，令你的手牌数加倍；若你的手牌因此达到8张或更多，你立即受到3点火焰伤害且本回合内不能再次发动黑火",
  yaotong: "妖瞳",
  yaotong1: "妖瞳",
  yaotong2: "妖瞳",
  yaotong3: "妖瞳",
  yaotong4: "妖瞳",
  yaotong_info:
    "当你的手牌数为奇数时，你可以将一张手牌当作杀或闪使用或打出，当你的手牌数为偶数时，你可以将一张手牌当作无懈可击使用",
  yaotong_info_alter:
    "当你的手牌数为奇数时，你可以将一张手牌当作杀使用或打出，当你的手牌数为偶数时，你可以将一张手牌当作无懈可击使用",
  pojian: "破茧",
  pojian_info: "每当你失去最后一张手牌，可以从牌堆中获得一张装备牌并装备之",
  huajin: "化金",
  huajin2: "化金",
  huajin_info:
    "出牌阶段限一次，你可以弃置一张牌令你造成的伤害+1，直到你的下一回合开始",
  poxiao: "破霄",
  poxiao_info:
    "你可以将一张装备牌当杀使用；当你没有武器牌时，你的攻击范围+1，杀可以额外指定一个目标",
  jianji: "箭疾",
  jianji_info:
    "你可以将一张装备牌当杀使用，然后摸一张牌，此杀无视距离和防具，且不计入回合内出杀限制",
  yuchen: "浴尘",
  yuchen_info: "每当你于回合外使用或打出一张黑色牌，你可以弃置一名角色的一张牌",
  huangyu: "凰羽",
  huangyu_info: "出牌阶段限一次，你可以将两张红色牌当炽羽袭使用",
  bingjian: "冰箭",
  bingjian_info:
    "出牌阶段限一次，你可以弃置一张黑色的杀，令一名有手牌的其他角色展示手牌并弃置其中的所有闪，若其没有闪则受到一点雷电伤害",
  rumeng: "入梦",
  rumeng_info:
    "其他角色的出牌阶段前，你可以弃置一张非基本牌，并令其选择一项：弃置一张基本牌，或跳过出牌及弃牌阶段",
  lianda: "连打",
  lianda_info: "当你使用一杀结算完毕后，可以弃置一张牌视为对目标再使用一张杀",
  xianghui: "祥晖",
  xianghui_info:
    "出牌阶段限一次，你可以弃置一张红色手牌，然后令场上体力值最少的角色各回复一点体力",
  huiqi: "回气",
  huiqi_info:
    "每当你受到一次伤害，可令一名其他角色摸X张牌，X为你已损失的体力值",
  toudan: "投弹",
  toudan_info:
    "出牌阶段限一次，你可以弃置一张黑桃牌对一名其他角色造成一点火焰伤害，然后你与距离该角色1以内的所有角色各弃置一张牌",
  shending: "神丁",
  shending_info: "锁定技，若你没有宝物牌，视为装备了蓝格怪衣",
  hzhenwei: "镇卫",
  hzhenwei_info:
    "当一名其他角色成为杀的目标后，若你在杀的使用者的攻击范围内，你可以弃置一张牌将此杀转移给自己，并在杀结算完毕后摸一张牌",
  shoulie: "狩猎",
  shoulie_info: "当你使用一张杀指定目标后，可以弃置一张手牌令此杀不可闪避",
  hudun: "盾甲",
  hudun_bg: "盾",
  hudun2: "盾甲",
  hudun_info:
    "锁定技，当你对其他角色造成伤害后，若你没有护甲，你获得一点护甲值",
  zhenjiu: "针灸",
  zhenjiu2: "针灸",
  zhenjiu_info:
    "出牌阶段限一次，你可以将一张红色手牌置于一名角色的武将牌上，该角色于下一个准备阶段回复一点体力，然后获得此牌",
  ljifeng: "疾风",
  ljifeng_info:
    "锁定技，你的攻击范围+X，杀可以额外指定X个目标，X为你已损失的体力值",
  lxianglong: "翔龙",
  lxianglong_info: "每当你闪避一张杀，你可以视为使用一张杀",
  shangxi: "伤袭",
  shangxi_info:
    "准备阶段，你可以弃置一张牌，并对攻击范围内一名体力值不小于你的其他角色造成一点伤害",
  fzhenwei: "镇威",
  fzhenwei_info:
    "在你的回合内，你可以将其他角色打出的卡牌交给除该角色外的任意一名角色",
  fuyan: "覆岩",
  fuyan2: "覆岩",
  fuyan_info: "每当你受到一次伤害，可以令一名没有护甲的角色获得一点护甲值",
  guaili: "怪力",
  guaili_info: "锁定技，你的杀造成的伤害+1，造成伤害后需弃置两张手牌",
  pingshen: "凭神",
  pingshen2: "凭神",
  pingshen_info:
    "锁定技，受到过你的伤害的角色可在回合内对你发动一次【离魂】（每局限发动一次）",
  xingzhui: "星坠",
  xingzhui_info:
    "出牌阶段限一次，你可以弃置一张牌，并令一名有牌的其他角色弃置一张类别相同的牌，若则受到一点伤害",
  lingxian: "凌仙",
  lingxian_info:
    "每当你于回合外使用或打出一张手牌，你可以选择攻击范围外的一名其他角色与你各摸一张牌",
  shouyin: "守印",
  shouyin_info:
    "限定技，当任意一名角色处于濒死状态时，若你的武将牌正朝上，可以将武将牌翻面，然后令场上所有存活角色将体力回复至体力上限",
  shouyin_info_alter:
    "限定技，当任意一名角色处于濒死状态时，若你的武将牌正朝上，可以将武将牌翻面，然后令场上所有存活角色回复两点体力",
  bofeng: "搏风",
  bofeng_info:
    "锁定技，体力值不大于你的角色视为在你的攻击范围；当你使用杀指定目标时，可令目标额外打出一张闪，否则此杀不可闪避且造成的伤害+1",
  hutian: "护天",
  hutian2: "护天",
  hutian3: "护天",
  hutian_info:
    "结束阶段，你可以将任意张牌置于一名角色的武将牌上，则该角色的体力值始终不能小于“护天”牌数；在你的下一个结束阶段，该角色获得武将牌上的“护天”牌（在此回合不能再次发动）",
  linyun: "凌云",
  linyun_info: "你可以将两张牌当作杀使用，此杀需要额外一张闪才能闪避",
  sliufeng: "流风",
  sliufeng_info: "锁定技，体力值不大于你的角色视为在你的攻击范围",
  chengjian: "承剑",
  chengjian_info: "每当其他角色使用杀造成一次伤害，你可以令其摸一张牌",
  huanling: "幻灵",
  huanling2: "幻灵",
  huanling_info:
    "结束阶段，你可以选择一名角色与你同时翻面；翻面状态下，你防止一切伤害",
  xiaozhan: "消战",
  xiaozhan_info: "其他角色使用杀时，若你不是杀的目标，可以弃置一张杀取消之",
  xielei: "挟雷",
  xielei_info:
    "每当你使用或打出一张杀，可以弃置一张牌并对目标以外的一名角色造成一点雷电伤害",
  dangping: "荡平",
  dangping_info:
    "每当你造成一次伤害，可以弃置一张手牌对其距离1以内的另一名角色造成一点伤害，每回合限一次",
  guisi: "归思",
  guisi_info: "每当你成为杀的目标，你可以交给对方一张手牌并取消之",
  duishi: "对诗",
  duishi_info:
    "出牌阶段，你可以弃置一张手牌，并指定一名有手牌的角色选择一项：1)弃置一张与之花色相同的手牌，本回合内对诗不能再次指定其为目标，2)令你获得其一张牌，对诗失效直到回合结束",
  anlianying: "连营",
  anlianying_info: "每当你失去最后一张手牌，可摸两张牌",
  lianwu: "连舞",
  lianwu_info: "锁定技，你的杀可以额外指定一个目标，你的红杀不可被闪避",
  jiying: "疾鹰",
  jiying_info: "锁定技，你使用杀无视距离",
  daofa: "道法",
  daofa_info: "每当有一名其他角色造成伤害，你可以令其弃置一张牌",
  xiaomoyu: "魔愈",
  xiaomoyu_info:
    "锁定技，每当你于一个回合内首次造成伤害，你回复一点体力，若你没有受伤，则改为摸一张牌",
  yihua: "移花",
  yihua_info:
    "每当你成为其他角色的某张卡牌的惟一目标时，你可以弃置两张手牌，将使用者与目标对调",
  youyin: "游吟",
  youyin_info:
    "每当有其他角色弃置卡牌时，若其中有非基本牌且你的手牌数不超过5，你可以摸一张牌",
  rexue: "热血",
  rexue_info: "任意一名角色的准备阶段，你可以对其使用一张杀，并摸一张牌",
  huopu: "火瀑",
  huopu_info: "出牌阶段限一次，你可以将一张红桃牌当作流星火羽使用",
  benlei: "奔雷",
  benlei2: "奔雷",
  benlei_info:
    "你可以将三张牌当惊雷闪使用；每当你造成一次雷属性伤害，你回复一点体力",
  lingwu: "灵舞",
  lingwu_info:
    "回合结束后，若你在本回合内使用的牌数不少于当前体力值，你可以进行一个额外的回合（不可重复发动）",
  miejing: "灭境",
  miejing_info:
    "限制技，你可以弃置所有黑色牌，然后令所有其他角色受到一点雷电伤害",
  lingxin: "灵心",
  lingxin_info: "结束阶段，你可以亮出牌堆顶的三张牌，然后获得其中的红桃牌",
  fushen: "附身",
  fushen_info:
    "回合开始前，你可以将自己移出游戏，并代替另一名角色进行一回合，然后流失一点体力",
  fushen2: "附身",
  wangchen: "忘尘",
  wangchen_info:
    "弃牌阶段结束时，若你于此阶段弃置了基本牌，你可以令一名角色翻面",
  wangchen_info_alter:
    "弃牌阶段结束时，若你于此阶段弃置了基本牌，你可以令一名角色翻面并获得一点护甲",
  // wangchen_info:'若你于弃牌阶段弃置了基本牌，可令一名角色翻面',
  // wangchen_info:'弃牌阶段结束时，若你于此阶段弃置了基本牌，可将一名其他角色移出游戏直到你死亡或下一回合开始',
  guiyin: "归隐",
  guiyin_info: "若你于弃牌阶段弃置了至少两张牌，你可以摸两张牌",
  shejie: "设界",
  shejie2: "设界",
  shejie_info:
    "每当你受到一次伤害，可以令伤害来源不能使用或打出其手牌，直到其下一回合开始",
  shejie2_info: "不能使用或打出手牌，直到下一回合开始",
  yinyue: "引月",
  yinyue_info:
    "每当有一名角色回复一次体力，你可以令其摸一张牌，若该角色不是你且你的手牌数不大于该角色，你也摸一张牌。",
  yinyue_info_alter: "每当有一名角色回复一次体力，你可以令其摸一张牌",
  mohua2: "魔化",
  mohua2_info:
    "锁定技，当你进入濒死状态时，你立即变身为撒旦，将体力回复至２，然后摸两张牌",
  liexin: "裂心",
  liexin_info: "每当你即将造成伤害，你可以弃置一张牌令伤害+1",
  swdxueyi: "血裔",
  swdxueyi_info: "锁定技，你摸牌阶段额外摸X张牌，X为你已损失的体力值",
  moyan: "血焰",
  moyan_info:
    "出牌阶段，你可以弃置X张红色手牌，然后对至多X名角色各造成一点火焰伤害，X为你已损失的体力值。每阶段限一次",
  aojian: "傲剑",
  aojian_info:
    "出牌阶段，你可以弃置X张手牌，然后对攻击范围内至多X名角色各造成一点伤害，X为你已损失的体力值。每阶段限一次",
  milesxiehun: "邪魂",
  milesxiehun_info:
    "锁定技，出牌阶段结束后，你令随机Ｘ名角色各弃置一张牌，Ｘ为你已损失的体力值且至少为1 ",
  liaochen: "撩尘",
  liaochen_info: "锁定技，出牌阶段结束后，所有角色需弃置一张牌",
  yinmo: "引魔",
  yinmo_info:
    "锁定技，当你对场上所有角色发动「连计」后，你立即变身为魔化宁珂，然后对所有其他角色造成一点雷电伤害",
  huanxing: "幻形",
  huanxing2: "幻形",
  huanxing_info:
    "准备阶段，你可以弃置一张牌并选择一名男性角色，获得其所有技能，直到你首次受到伤害",
  meihuo: "魅惑",
  meihuo_info:
    "每当你失去最后一张装备牌，你可以获得一名其他角色的一张牌，若此牌来自装备区，你立即装备之",

  touxi: "偷袭",
  touxi_info:
    "在其他角色的结束阶段，你可以进行一次判定，若结果为黑色，你对其造成一点雷电伤害，且直到下一回合开始不能再次发动偷袭；若结果为红色，对方可以弃置你的一张牌",
  touxi_info_alter:
    "在其他角色的结束阶段，你可以进行一次判定，若结果为黑色，你对其造成一点雷电伤害，且直到下一回合开始不能再次发动偷袭；若结果为红色，对方可以获得你的一张牌",
  minjing: "明镜",
  minjing_info: "若你没有防具牌，你视为装备了光纱天衣",
  jqimou: "奇谋",
  jqimou_info: "每当你于回合外受到一次伤害，你可以摸一张牌，并可以使用一张牌",
  mufeng: "沐风",
  mufeng_info: "结束阶段，若你本回合使用过基本牌，则可发现一张牌",
  mufeng_info_alter: "结束阶段，你可以将手牌数补至当前体力值",
  mufeng_old2_info:
    "在一名角色的结束阶段，若你的手牌数比其少，你可以将手牌补至与该角色相同（最多补至5），每轮限一次",
  hjifeng: "祭风",
  hjifeng_info:
    "出牌阶段限一次，若你手牌中没有祭器牌，你可以将一张手牌置于牌堆顶，并根据其花色获得对应祭器：黑桃-青龙之圭；梅花-白兽之琥；方片-朱雀之璋；红桃-玄武之璜",
  mufeng_old_info:
    "锁定技，每当你于回合外失去牌，你的防御距离+1；若防御距离的变化值超过了存活角色数的一半，则降至0",
  lexue: "乐学",
  lexue_info:
    "回合内，你随机获得制衡、集智、缔盟、驱虎中的一个技能；回合外，你随机获得遗计、急救、鬼道、反馈中的一个技能",
  mingfu: "冥缚",
  mingfu_info: "出牌阶段限一次，你可以将一张梅花牌当鬼幽结使用",
  chuanyue: "穿月",
  chuanyue_info: "出牌阶段限一次，你可以将两张手牌当决斗使用",

  miedao: "灭道",
  miedao1: "灭道",
  miedao2: "灭道",
  miedao_info:
    "锁定技，摸牌阶段，你额外摸X张牌；弃牌阶段，你至少须弃X张牌（不足则全弃），X为你已损失的体力值。",

  senluo: "森罗",
  senluo_info:
    "出牌阶段限一次，若你的手牌数为全场最少或之一，你可以令所有有手牌的其他角色弃置两张手牌然后摸一张牌",
  polang: "破浪",
  polang_info: "每当你造成一次伤害，可以一张对方的装备牌",
  jikong: "亟空",
  jikong2: "亟空",
  jikong_info:
    "准备阶段，你可以指定一名角色视为对其使用一张雷杀；每当你失去最后一张手牌，你可以指定一名角色视为对其使用一张雷杀（每回合限发动一次）",
  jikong_info_alter: "准备阶段，你可以指定一名角色视为对其使用一张雷杀",
  xiangu: "仙骨",
  xiangu_info: "锁定技，你的手牌上限不会因体力值的减少而减少。",
  hujing: "壶境",
  hujing_info:
    "锁定技，准备阶段，若弃牌堆中有炼妖壶，你装备之；当你的装备区内有炼妖壶时，你的手牌上限+2",
  huajian: "化剑",
  huajian_info: "出牌阶段结束时，你可以将一张牌当作杀对任意一名角色使用",
  xuanyuan: "轩辕",
  xuanyuan_info:
    "锁定技，你无视【轩辕剑】的装备条件及流失体力的效果；结束阶段，你可以弃置一张黑桃牌从弃牌堆中获得【轩辕剑】并装备之",
  jilve: "极略",
  jilve_backup: "极略",
  jilve2: "极略",
  jilve_info:
    "出牌阶段，你可以观看牌堆顶的三张牌，然后使用其中的非装备牌。每回合最多发动三次",
  jilve_info_alter:
    "出牌阶段，你可以观看牌堆顶的两张牌，然后使用其中的非装备牌。每回合最多发动三次",
  gongshen: "工神",
  gongshen_info:
    "任意一名其他角色使用一张基本牌或锦囊牌指定目标后，你可以弃置一张装备牌令其失效",

  swdliuhong: "流虹",
  swdliuhong_info: "每当你使用一张杀，可以摸一张牌",
  poyue: "破月",
  poyue_info:
    "锁定技，你的黑杀无视距离，红色杀不计入回合内的出杀限制且不可闪避",
  poyue_info_alter: "锁定技，你的黑杀无视距离，红色杀不可闪避",
  mojian: "墨剑",
  mojian_info:
    "每当你使用杀并指定目标后，你可以令其摸一张牌，然后你回复一点体力",
  duanyue: "断月",
  duanyue_info:
    "出牌阶段限一次，你可以弃置一张装备牌，对一名其他角色造成一点伤害",
  tuzhen: "突阵",
  tuzhen_info: "当你造成一次伤害后，你可以弃置对方手牌中的非基本牌",
  tuzhen_info_alter: "当你造成一次伤害后，你可以弃置对方手牌中的一张非基本牌",
  fengmo: "封魔",
  fengmo_info:
    "出牌阶段限一次，你可以弃置场所有武器牌（至少两张），然后令一名未翻面的角色摸等量的牌并翻面",
  pozhou: "破咒",
  pozhou_bg: "破",
  pozhou2: "破咒",
  pozhou_info:
    "每当你受到一次伤害，你获得一枚破咒标记。出牌阶段，你可以指定任意名其他角色并弃置等量的破咒标记，令目标的非锁定技失效直到其下一回合结束",
  xuanzhou: "玄咒",
  xuanzhou_info:
    "出牌阶段限一次，你可以将一张普通锦囊牌当作任意一张延时锦囊，对任意一名角色使用（无视锦囊使用范围限制）",
  ningxian: "凝霰",
  ningxian_info:
    "每当你受到一次伤害，你可以弃置任意张黑色牌并选择等量其他角色对其各造成一点伤害",
  guanhu: "贯鹄",
  guanhu_info: "每当你使用杀造成伤害，你可以弃置对方一张手牌和一张装备牌",
  chuanyang: "穿杨",
  chuanyang_info:
    "每当你使用一张杀，若你不在目标的攻击范围，你可以令此杀不可闪避",
  fengming: "凤鸣",
  fengming_info:
    "出牌阶段限一次，你可以弃置一张装备牌，令一名角色恢复一点体力并摸一张牌",
  duanxing: "锻星",
  duanxing_info: "每当你装备一张未强化的装备牌，可以视为一名角色使用一张杀",
  wanjun: "万钧",
  wanjun_info: "你可以将一张装备牌当作南蛮入侵使用",
  dunxing: "遁形",
  dunxing_info:
    "当你成为其他角色卡牌的目标时，你可以弃置一张牌并进行一次判定，若不为红桃，则取消之",
  guiying: "鬼影",
  guiying_info: "你可以将一张黑色牌当偷梁换柱使用",
  shehun: "摄魂",
  shehun_info:
    "出牌阶段限一次，你可以弃置任意张花色不同的牌，另一名其他角色弃置等量的牌，若其弃置的牌中有牌的花色与你弃置的牌相同，你对其造成一点伤害",

  zhanlu: "沾露",
  luomu: "落木",
  jifeng: "魔影",
  liaoyuan: "燎原",
  huanhun: "唤魂",
  daixing: "代形",
  yishan: "异闪",
  yishan2: "异闪",
  swd_wuxie: "无邪",
  lqingcheng: "倾城",
  xianjiang: "仙匠",
  xianjiang3: "仙匠",
  shengong: "神工",
  ningjian: "凝剑",
  ningjian1: "凝剑",
  ningjian2: "凝剑",
  taixu: "太虚",
  duoren: "夺刃",
  tanlin: "探麟",
  tanlin2: "探麟",
  pozhen: "破阵",
  yunchou: "运筹",
  swdtianshu: "天书",
  swdtianshu_bg: "书",
  swdtianshu2: "天书",
  xingdian: "星点",
  luomei: "落梅",
  yulin: "玉鳞",
  funiao: "符鸟",
  xuehuang: "血凰",
  xuehuang_bg: "凰",
  zhuyu: "朱羽",
  ningshuang: "凝霜",
  zaowu: "造物",
  // shouhua:'收化',
  xielv: "谐率",
  tianhuo: "天火",
  huanyin: "幻音",
  tianlun: "天轮",
  hlongyin: "龙吟",
  lanzhi: "兰芷",
  duanyi: "断意",
  miesheng: "灭生",
  guxing: "孤星",
  guxing1: "孤星",
  guxing2: "孤星",
  poxing: "破星",
  mohua: "魔化",
  miles_xueyi: "血裔",
  wuying: "无影",
  xiehun: "邪魂",
  xiehun1: "邪魂",
  xiehun2: "邪魂",
  xiehun3: "邪魂",
  jumo: "聚魔",
  duijue: "对决",
  duijue_bg: "决",
  yueren: "月刃",
  busi: "不死",
  xuying: "虚影",
  yinguo: "因果",
  guiyan: "鬼眼",
  guiyan2: "鬼眼",
  swd_xiuluo: "修罗",
  suiyan: "碎岩",
  suiyan_info: "每当你造成一次伤害，可以弃置一张牌并弃置对方的全部装备牌",
  xianyin: "散结",
  qiaoxie: "巧械",
  qiaoxie2: "巧械",
  qiaoxie3: "巧械",
  qiaoxie4: "巧械",
  mailun: "脉轮",
  mailun31: "脉轮",
  mailun32: "脉轮",
  mailun41: "脉轮",
  mailun42: "脉轮",
  kunlunjing: "幻镜",
  kunlunjing1: "幻镜",
  kunlunjing2: "幻镜",
  susheng: "苏生",
  shengshou: "圣手",
  huanjian: "幻箭",
  huanjian_info: "出牌阶段，你可以将一张黑色牌当作冰魄针使用",
  shengshou_info: "你可以将一张黑色手牌当作草药使用",
  susheng_info:
    "在任意一名角色即将死亡时，你可以弃置一张手牌防止其死亡，并将其体力回复至1，每回合限发动一次",
  susheng_info_alter:
    "在任意一名角色即将死亡时，你可以弃置一张红色手牌防止其死亡，并将其体力回复至1，每回合限发动一次",
  zhanlu_info:
    "出牌阶段限一次，你可以弃置一张黑桃牌令至多3名角色各回复一点体力",
  kunlunjing_info:
    "准备阶段，若你的体力值小于上回合结束时的体力值，你可以将场上所有牌还原到你上一回合结束时的位置",
  kunlunjing_info_alter:
    "准备阶段，若你的体力值小于上回合结束时的体力值，你可以将场上所有牌还原到你上一回合结束时的位置，然后流失一点体力",
  swd_xiuluo_info:
    "准备阶段，你可以弃一张手牌来弃置你判断区里的一张延时类锦囊（必须花色相同）",
  xianyin_info:
    "出牌阶段，你可以令所有判定区内有牌的角色弃置判定区内的牌，然后交给你一张手牌",
  qiaoxie_info:
    "每当你装备一张牌，可摸一张牌；每当你失去一张装备牌（不含替换），你可以弃置其他角色的一张牌",
  mailun_info: "准备阶段，你可以选择一个脉轮效果直到下一回合开始",
  guiyan_info:
    "出牌阶段，你可以观看一名角色的手牌，并获得其中一张梅花牌，每阶段限一次。当你首次进入濒死状态时，你须回复一点体力并失去技能鬼眼",
  busi_info:
    "锁定技，当你进入濒死状态时，你进行一次判定，若结果不为黑桃，你将体力回复至1并将武将牌翻至背面",
  xuying_info:
    "锁定技，每当你即将受到伤害，你防止此伤害，若你此时有手牌，你流失一点体力",
  yinguo_info:
    "除你之外的任意一名角色即将受到受到伤害时，若有伤害来源，你可以弃置一张牌将伤害来源和目标对调",
  yueren_info:
    "每当你使用一张杀，可以进行一次判定，若结果为黑色，你弃置目标一张牌，若结果为红色，你将此杀收回，每回合限发动一次",
  duijue_info:
    "限定技，出牌阶段，你可以指定一名体力值大于1的其他角色，你结束出牌阶段，并在回合结束后将所有其他角色移出游戏，然后该角色与你轮流进行回合，直到有一方死亡或一共进行六个回合为止",
  wuying_info: "锁定技，你的杀和单体x锦囊目标锁定为范围内的所有角色",
  xiehun_info:
    "锁定技，受到来自你伤害的角色进入混乱状态，行为不受控制，且会攻击队友，直到你的下一回合开始",
  jumo_info:
    "锁定技，结束阶段，你摸X-1张牌，X为未进入混乱状态的角色数与进入混乱状态的角色数之差（若为双将则改为X）",
  jifeng_info:
    "你的杀和单体锦囊可以额外指定任意个目标，若如此做，此卡牌有一定机率失效，指定的目标越多失效的概率越大",
  mohua_info:
    "锁定技，在身份局中，当你进入濒死状态时，你立即变身为撒旦，体力上限变为现存角色数（至少为4），并成为其他所有角色的共同敌人",
  miles_xueyi_info: "锁定技，你防止即将受到的伤害，然后流失一点体力",
  duanyi_info:
    "出牌阶段限一次，你可以弃置两张杀，对一名角色造成一点伤害，然后其随机弃置X张牌，X为其已损失的体力值",
  duanyi_info_alter:
    "出牌阶段限一次，你可以弃置两张杀，并对一名角色造成一点伤害",
  guxing_info:
    "出牌阶段，你可以将最后至多X张手牌当杀使用，此杀无视距离且可以指定至多3个目标，每造成一次伤害，你摸一张牌，Ｘ为你已损失的体力值且至少为１。",
  tianlun_info:
    "任意一名角色的判定牌生效前，你可以弃置一张场上角色的判定牌代替之",
  hlongyin_info:
    "出牌阶段，你可以弃置任意张颜色相同且点数不同的牌，并获得逆时针座位距离与卡牌点数相同的角色区域内的一张牌。每阶段限一次",
  lanzhi_info:
    "每当你使用一张梅花牌，你可以令所有体力值不大于你的角色回复一点体力",
  lanzhi_old_info:
    "每当你即将造成伤害，可以防止此伤害，然后摸两张牌。每回合限发动一次。",
  tianhuo_info:
    "出牌阶段，你可以令所有角色弃置其判定区域内的牌，并受到没有来源的等量火焰伤害，每阶段限一次",
  huanyin_info:
    "锁定技，每当你成为其他角色的卡牌的目标时，你进行一次判定，若为黑桃则取消之，若为红桃你摸一张牌",
  luomu_info: "锁定技，每当你造成伤害时，受伤害角色随机弃置一张牌",
  poxing_info: "锁定技，每当你即将造成伤害，若目标的体力值大于你，你令伤害+1",
  liaoyuan_info:
    "每当你使用一张杀指定目标后，你可以弃置任意张与此杀花色相同的牌，若如此做，目标需额外打出等量的闪，每少打出一张闪，此杀的伤害+1",
  liaoyuan_info_alter:
    "每当你使用一张杀指定目标后，你可以弃置一张与此杀花色相同的牌，若如此做，目标需额外打出一张闪，若目标没打出闪，此杀的伤害+1",
  yishan_info: "每当你受到一次伤害，你可以重新获得最近失去的两张牌",
  huanhun_info:
    "当一名角色进入濒死状态时，你可以弃置一张牌并令其进行一次判定，若结果为红色，其回复一点体力，否则其获得你弃置的牌",
  huanhun_info_alter:
    "当一名角色进入濒死状态时，你可以弃置一张红色手牌并令其进行一次判定，若结果为红色，其回复一点体力，否则其获得你弃置的牌",
  daixing_info:
    "结束阶段，你可以弃置任意张牌并获得等量的护甲；这些护甲将在你的下个准备阶段消失",
  swd_wuxie_info: "锁定技，你不能成为其他角色的延时锦囊的目标",
  lqingcheng_info:
    "结束阶段，你可以进行判定，若为红色则可以继续判定，最多判定3次，判定结束后将判定成功的牌收入手牌",
  xianjiang_old_info:
    "出牌阶段，你可以将一张装备牌永久转化为任意一张其它装备牌，一张牌在一个阶段只能转化一次",
  xianjiang_info: "出牌阶段限一次，你可以弃置一张锦囊牌并随机装备一件装备",
  xianjiang_info_alter:
    "出牌阶段限一次，若你装备内没有牌，你可以弃置一张锦囊牌并随机装备一件装备",
  shengong_info:
    "每当你需要打出一张杀或闪时，你可以弃置一名其他角色装备区内的一张武器牌或防具牌，视为打出一张杀或闪，然后该角色摸一张牌，你弃一张牌",
  ningjian_info: "你可以将一张红色牌当闪、黑色牌当杀使用或打出",
  taixu_info:
    "限定技，你可以弃置你的所有牌（至少1张），并对一名体力值大于1为其他角色造成X点火焰伤害，X为你已损失的体力值且至少为1",
  duoren_info: "每当你闪避一张杀，你可以立即获得来源的武器牌",
  tanlin_info:
    "出牌阶段限一次，你可以与一名其他角色进行拼点，若你赢，你获得双方拼点牌、对该角色使用卡牌无视距离且可以额外使用一张杀直到回合结束，若你没赢，你受到该角色的一点伤害。",
  tanlin_info_alter:
    "出牌阶段限一次，你可以与一名其他角色进行拼点，若你赢，你获得对方拼点牌、对该角色使用卡牌无视距离且可以额外使用一张杀直到回合结束，若你没赢，你受到该角色的一点伤害。",
  pozhen_info:
    "每当你受到一次伤害，若你的手牌数大于伤害来源，你可以弃置X张手牌对其造成一点伤害；若你的手牌数小于伤害来源，你可以弃置其X张手牌。X为你与伤害来源的手牌数之差。",
  pozhen_info_alter:
    "每当你受到一次伤害，若你的手牌数小于伤害来源，你可以弃置其X张手牌。X为你与伤害来源的手牌数之差。",
  yunchou_info:
    "出牌阶段限一次，你可以弃置一张手牌，并弃置一名其他角色的一张手牌，若两张牌颜色相同，你摸一张牌，否则对方摸一张牌",
  yunchou_info_alter:
    "出牌阶段限一次，你可以弃置一张非基本手牌，并弃置一名其他角色的一张手牌，若两张牌颜色相同，你摸一张牌，否则对方摸一张牌",
  swdtianshu_old_info:
    "结束阶段，你可以弃置一张牌并从三名随机武将中选择一个，在2X回合后你将其所有技能加入你的天书列表，X为其技能数；在技能加入天书列表时，或于出牌阶段，你可以装备一项天书列表中的技能",
  swdtianshu_info:
    "出牌阶段，你可以弃置一张锦囊牌，然后获得一名其他角色的一项技能直到该角色死亡（替换以此法获得的前一个技能）",
  zaowu_info: "出牌阶段限一次，你可以将一张黑桃或红桃手牌当作封印之蛋使用",
  luomei_info: "每当你使用或打出一张梅花花色的牌，你可以摸一张牌",
  xingdian_info:
    "出牌阶段限一次，你可以弃置一张手牌，然后随机弃置两名敌人各一张牌",
  yulin_info: "每当你即将受到伤害，你可以弃置一张装备牌抵消此伤害",
  funiao_info:
    "出牌阶段限一次，你可以将一张手牌交给一名其他角色，然后摸一张牌并观看其手牌",
  funiao_old_info:
    "出牌阶段，你可以交给一名角色一张手牌，然后观看其手牌，每个阶段对一名角色只能发动一次",
  xuehuang_info:
    "限定技，出牌阶段，若你没有黑色手牌，你可以展示并弃置所有手牌，每弃置一张牌视为使用一张火杀，随机指定两名敌人为目标",
  zhuyu_info:
    "每当一名横置的角色即将受到伤害时，你可以弃置一张红色牌令此伤害+1并变为火属性",
  ningshuang_info:
    "每当你成为黑色牌的目标，你可以弃置一张黑色牌将其横置，并摸一张牌，若其已经模置则改为将其翻面",
  zaowu_old_info:
    "出牌阶段，你可以弃置三张不同类型的牌，创造任意两张牌并获得之",
  xielv_info:
    "弃牌阶段结束后，若你的所有手牌（至少两张）颜色均相同，你可以展示所有手牌，然后回复一点体力并弃置场上的所有判定牌",
};
export const translate_tw = {
  tw_beimihu: "TW卑弥呼",
  nashime: "难升米",
  tw_xiahouba: "TW夏侯霸",
  tw_zumao: "TW祖茂",
  tw_caoang: "TW曹昂",
  tw_dingfeng: "TW丁奉",
  tw_caohong: "TW曹洪",
  tw_maliang: "TW马良",

  twyanqin: "姻亲",
  twyanqin_info: "准备阶段，你可以将势力变更为魏或蜀。",
  twbaobian: "豹变",
  twbaobian_info:
    "当你使用【杀】或【决斗】造成伤害时，若目标角色的势力与你相同，则你可以防止此伤害，然后其将手牌数补充至与体力值相同。若不同且其手牌数大于体力值，则你可以将其手牌弃置至与其体力值相同。",
  twtijin: "替巾",
  twtijin_info:
    "当你攻击范围内的一名其他角色使用【杀】指定另一名其他角色为目标时，你可以将此【杀】的目标改为你。若如此做，此【杀】结算完成后，你弃置该角色的一张牌。",
  twxiaolian: "孝廉",
  twxiaolian_info:
    "当一名其他角色使用【杀】指定另一名其他角色为目标时，你可以将此【杀】的目标改为你。若如此做，当你受到此【杀】的伤害后，你可以将一张牌放在此【杀】原目标的武将牌旁，称之为“马”。锁定技，场上的一名角色每有一张“马”，其他角色计算与其的距离便+1。",
  twqijia: "弃甲",
  twqijia_info:
    "出牌阶段，你可以弃置一张装备区内的牌（每种类型的装备牌限一次），然后视为对攻击范围内的一名其他角色使用了一张【杀】。",
  twzhuchen: "诛綝",
  twzhuchen_info:
    "出牌阶段，你可以弃置一张【桃】或【酒】并选择一名其他角色。你与其的距离视为1直到此阶段结束。",
  twhuzhu: "护主",
  twhuzhu_info:
    "出牌阶段限一次，若你的装备区内有牌，则你可以令一名其他角色交给你一张手牌，然后获得你装备区内的一张牌。若其体力值不大于你，则你可以令其回复1点体力。",
  twliancai: "敛财",
  twliancai_info:
    "结束阶段，你可以将武将牌翻面，然后获得一名其他角色装备区内的一张牌。当你的武将牌翻面时，你可以将手牌补至与体力值相同。",
  twrangyi: "攘夷",
  twrangyi2: "攘夷",
  twrangyi_info:
    "出牌阶段限一次，你可以将所有手牌交给一名其他角色，然后令其选择一项：1.使用其中的一张牌，并于此牌被使用时将其余的牌交还给你。2.受到来自你的1点伤害。",
  twbaimei: "白眉",
  twbaimei_info:
    "锁定技，若你没有手牌，则防止你受到的所有属性伤害和锦囊牌造成的伤害。",
  chijie: "持节",
  chijie_info: " 游戏开始时，你可以选择一个现存势力，你的势力视为该势力。 ",
  waishi: "外使",
  waishi_info:
    " 出牌阶段限一次，你可以用至多X张牌交换一名其他角色等量的手牌（X为现存势力数），然后若其与你势力相同或手牌多于你，你摸一张牌。",
  renshe: "忍涉",
  renshe_info:
    "当你受到伤害后，你可以选择一项：将势力改为现存的另一个势力；或可以额外发动一次“外使”直到你的下个出牌阶段结束；或与另一名其他角色各摸一张牌。",
  tw_gexuan: "TW葛玄",
  twdanfa: "丹法",
  twdanfa_info:
    "准备阶段或结束阶段开始时，你可将一张牌置于武将牌上，称为“丹”。每回合每种花色限一次，当你使用牌时，若“丹”中有与此牌花色相同的牌，则你摸一张牌。",
  twlingbao: "灵宝",
  twlingbao_info:
    "出牌阶段限一次，你可以将两张花色不同的“丹”置入弃牌堆。若这两张牌：均为红色，你令一名其他角色回复1点体力；均为黑色，你弃置一名其他角色区域内至多两张区域不同牌；颜色不同，则你令一名角色摸一张牌，并令另一名角色弃置一张牌。",
  twsidao: "司道",
  twsidao_info:
    "游戏开始时，你选择一张“法宝”置入装备区。准备阶段，若你以此法选择的法宝在牌堆/弃牌堆中，则你使用之。",
  gx_lingbaoxianhu: "灵宝仙壶",
  gx_lingbaoxianhu_info:
    "锁定技，当你造成点数大于1的伤害后，或有角色死亡后，你加1点体力上限并回复1点体力。",
  gx_taijifuchen: "太极拂尘",
  gx_taijifuchen_info:
    "锁定技，当你使用【杀】指定目标后，你令目标角色选择一项：①弃置一张牌，若此牌和【杀】花色相同，则你获得之。②其不可响应此【杀】。",
  gx_chongyingshenfu: "冲应神符",
  gx_chongyingshenfu_info:
    "锁定技。①当你受到牌造成的伤害后，你记录此牌的名称。②当你受到〖冲应神符①〗记录过的牌造成的伤害时，你令此牌伤害-1。",
  tw_dongzhao: "TW董昭",
  twmiaolve: "妙略",
  twmiaolve_info:
    "游戏开始时，你获得两张【瞒天过海】。当你受到1点伤害后，你可选择：①获得一张【瞒天过海】并摸一张牌。②获得一张智囊。",
  twyingjia: "迎驾",
  twyingjia_info:
    "一名角色的回合结束时，若你本回合内使用过两张或更多的同名锦囊牌，则你可弃置一张手牌并令一名角色进行一个额外回合。",
  dz_mantianguohai: "瞒天过海",
  dz_mantianguohai_info:
    "此牌不计入拥有者的手牌上限。出牌阶段，对一至两名区域内有牌的其他角色使用。你获得目标角色一张牌，然后依次交给每名目标角色各一张牌。",
  jiachong: "TW贾充",
  beini: "悖逆",
  beini_info:
    "出牌阶段限一次，你可以选择一名体力值不小于你的角色，令你或其摸两张牌，然后未摸牌的角色视为对摸牌的角色使用一张【杀】。",
  dingfa: "定法",
  dingfa_info:
    "弃牌阶段结束时，若本回合你失去的牌数不小于你的体力值，你可以选择一项：1、回复1点体力；2、对一名其他角色造成1点伤害。 ",
  duosidawang: "朵思大王",
  equan: "恶泉",
  equan_info:
    "锁定技。①当有角色于你的回合内受到伤害后，其获得X枚“毒”（X为伤害值）。②准备阶段，你令所有拥有“毒”标记的角色移去所有“毒”标记并失去等量的体力。③当有角色因〖恶泉②〗进入濒死状态时，你令其所有技能失效直到回合结束。",
  manji: "蛮汲",
  manji_info:
    "锁定技。其他角色失去体力后，若你的体力值：不大于该角色，你回复1点体力；不小于该角色，你摸一张牌。",
  wuban: "吴班",
  jintao: "进讨",
  jintao_info:
    "锁定技，你使用【杀】无距离限制且次数上限+1。你于出牌阶段内使用的第一张【杀】伤害+1，第二张【杀】不可被响应。",
  yuejiu: "乐就",
  cuijin: "催进",
  cuijin_info:
    "当你或你攻击范围内的角色使用【杀】时，你可以弃置一张牌并获得如下效果：此【杀】的伤害值基数+1，且当此【杀】结算结束后，若未造成过伤害，则你对使用者造成1点伤害。",
  tw_zhaoxiang: "TW赵襄",
  twfuhan: "扶汉",
  twfuhan_info:
    '限定技。准备阶段开始时时，你可以移去所有"梅影"标记，然后从五张未登场的蜀势力武将牌中选择一名获得其所有技能，将体力上限数调整为以此技能移去所有“梅影”标记的数量（最少为2，最多为8）并回复1点体力，然后从牌堆/弃牌堆/场上获得【梅影枪】。',
  twqueshi: "鹊拾",
  twqueshi_info: "游戏开始时，你将【梅影枪】置于你的装备区。",
  meiyingqiang: "梅影枪",
  meiyingqiang_info:
    "当你于其他角色的回合内第一次失去牌时，你可以使用一张【杀】。",
  tw_fuwan: "TW伏完",
  twmoukui: "谋溃",
  twmoukui_info:
    "当你使用【杀】指定目标后，你可以选择一项：①摸一张牌；②弃置该角色的一张牌；③背水：若此【杀】未因造成伤害而令该角色进入过濒死状态，则该角色弃置你的一张牌。",
  tw_yujin: "SP于禁",
  xinzhenjun: "镇军",
  xinzhenjun_info:
    "出牌阶段开始时，你可以将一张牌交给一名其他角色，令其选择是否使用一张不为黑色的【杀】。若其选择是，则你于此【杀】结算完成后摸1+X张牌(X为此【杀】造成的伤害总点数)。若其选择否，则你对其或其攻击范围内的一名其他角色造成1点伤害。",
  tw_hucheer: "TW胡车儿",
  twshenxing: "神行",
  twshenxing_info:
    "锁定技。若你的装备区内没有坐骑牌，则你至其他角色的距离-1且手牌上限+1。",
  twdaoji: "盗戟",
  twdaoji_info:
    "出牌阶段限一次，你可以弃置一张非基本牌并选择一名攻击范围内的角色，获得其一张牌。若你以此法获得的牌为：基本牌，你摸一张牌；装备牌，你使用此牌并对其造成1点伤害。",
  tw_hejin: "TW何进",
  twmouzhu: "谋诛",
  twmouzhu_info:
    "出牌阶段限一次，你可以选择一名其他角色A。你令除A外所有体力值小于等于你的其他角色依次选择是否交给你一张牌。若你以此法获得的牌数X：等于0，你和所有进行选择的角色依次失去1点体力。大于0，你令A选择由你视为对其使用一张伤害值基数为X的【杀】或【决斗】。",
  twyanhuo: "延祸",
  twyanhuo_info:
    "当你死亡时，你可以选择一项：①令一名其他角色弃置X张牌。②令X名其他角色依次弃置一张牌。（X为你的牌数）",
  tw_mayunlu: "TW马云禄",
  twfengpo: "凤魄",
  twfengpo_info:
    "①当你使用【杀】或【决斗】指定唯一目标后，你可观看目标角色的手牌并选择一项：⒈摸X张牌。⒉令此牌的伤害值基数+X（X为其手牌中的♦数）。②当你杀死一名角色后，你将〖凤魄①〗中的“♦数”改为“红色牌数”。",
  tw_re_caohong: "TW手杀曹洪",
  tw_re_caohong_ab: "曹洪",
  twyuanhu: "援护",
  twyuanhu_info:
    "出牌阶段限一次。你可将一张装备牌置入一名角色的装备区内。若此牌为：武器牌，你弃置与其距离为1的另一名角色区域的一张牌；防具牌，其摸一张牌；坐骑牌，其回复1点体力。若其的体力值或手牌数不大于你，则你可摸一张牌，且可以于本回合的结束阶段再发动一次〖援护〗。",
  twjuezhu: "决助",
  twjuezhu_info:
    "限定技。准备阶段，你可废除一个坐骑栏，令一名角色获得〖飞影〗并废除判定区。该角色死亡后，你恢复以此法废除的装备栏。",
  tw_zangba: "TW臧霸",
  twhanyu: "捍御",
  twhanyu_info:
    "锁定技。游戏开始时，你获得牌堆中的基本牌，锦囊牌，装备牌各一张。",
  twhengjiang: "横江",
  twhengjiang_info:
    "出牌阶段限一次，当你使用基本牌或普通锦囊牌指定唯一目标后，你可将此牌的目标改为攻击范围内的所有合法目标，然后你于此牌结算结束后摸X张牌（X为因响应此牌而使用或打出过牌的角色数）。",
  tw_huojun: "霍峻",
  twsidai: "伺怠",
  twsidai_info:
    "限定技。出牌阶段，你可以将手牌区内的所有基本牌当做【杀】使用（无距离和次数限制）。若此牌对应的实体牌中：包含【闪】，则目标角色成为此牌的目标后，需弃置一张基本牌，否则不可响应此牌；包含【桃】，则当目标角色受到此牌的伤害后，其减1点体力上限；包含【酒】，则当目标角色受到此牌的伤害时，此伤害×2。",
  twjieyu: "竭御",
  twjieyu_info:
    "每轮限一次。结束阶段开始时，或当你于一轮内第一次受到伤害后，你可以弃置所有手牌，然后从弃牌堆中获得不同牌名的基本牌各一张。",
  tw_liuhong: "TW刘宏",
  twyujue: "鬻爵",
  twyujue_give: "鬻爵",
  twyujue_info:
    "①其他角色的出牌阶段内，可以交给你任意张牌（每阶段上限为两张）。②当你于回合外获得其他角色的一张牌后，你可令其选择本回合内未选择过的一项：⒈弃置攻击范围内一名角色的一张牌。⒉下一次使用牌时，从牌堆中获得一张同类别的牌。",
  twgezhi: "革制",
  twgezhi_info:
    "①当你于出牌阶段内首次使用某种类别的牌时，你可以重铸一张手牌。②出牌阶段结束时，若你本阶段内因〖革制①〗失去过至少两张牌，则你可以令一名角色选择获得一个其未获得过的效果：⒈攻击范围+2；⒉手牌上限+2；⒊加1点体力上限。",
  twfengqi: "烽起",
  twfengqi_info:
    "主公技，锁定技。①其他群势力角色发动〖鬻爵①〗时，将每阶段上限改为四张。②以其他角色为目标的〖革制②〗结算结束后，目标角色可以激活其武将牌上的主公技。",
  tw_caocao: "TW曹操",
  twlingfa: "令法",
  twlingfa_info:
    "①第一轮游戏开始时，你可选择获得如下效果直到本轮结束：其他角色使用【杀】时，若其有牌，则其需弃置一张牌，否则受到你造成的1点伤害。②第二轮游戏开始时，你可选择获得如下效果直到本轮结束：其他角色使用【桃】结算结束后，若其有牌，则其需交给你一张牌，否则受到你造成的1点伤害。③第三轮游戏开始时，你失去〖令法〗并获得〖治暗〗。",
  twzhian: "治暗",
  twzhian_info:
    "每回合限一次。一名角色使用装备牌或延时锦囊牌后，你可选择：⒈弃置位于场上的此牌。⒉弃置一张手牌并获得位于场上的此牌。⒊对其造成1点伤害。",
  tw_zhangmancheng: "张曼成",
  twfengji: "蜂集",
  twfengji_info:
    "出牌阶段开始时，若你没有“示”，则你可以将一张牌作为“示”置于武将牌上并施法：从牌堆中获得X张与“示”牌名相同的牌，然后移去“示”。",
  twyiju: "蚁聚",
  twyiju_info:
    "非锁定技。若你的武将牌上有“示”，则：①你使用【杀】的次数上限和攻击范围的基数改为你的体力值。②当你受到伤害时，你移去“示”，且令此伤害+1。",
  twbudao: "布道",
  twbudao_info:
    "限定技。准备阶段，你可减1点体力上限，回复1点体力并选择获得一个“施法”技能。然后你可以令一名其他角色也获得此技能并交给你一张牌。",
  twzhouhu: "咒护",
  twzhouhu_info: "出牌阶段限一次。你可以弃置一张红色手牌并施法：回复1点体力。",
  twharvestinori: "丰祈",
  twharvestinori_info:
    "出牌阶段限一次。你可以弃置一张黑色手牌并施法：摸2X张牌。",
  twzuhuo: "阻祸",
  twzuhuo_info:
    "出牌阶段限一次。你可以弃置一张非基本牌并施法：防止你受到的下X次伤害。",
  tw_chengpu: "程普",
  twlihuo: "疠火",
  twlihuo2: "疠火",
  twlihuo3: "疠火",
  twlihuo_info:
    "①当你声明使用普【杀】时，你可以将此【杀】改为火【杀】。此牌使用结算结束后，若有角色因此【杀】造成的伤害进入过濒死状态，则你失去1点体力。②当你使用火【杀】选择目标后，你可为此牌增加一个目标。",
  twchunlao: "醇醪",
  twchunlao_info:
    "①准备阶段，若场上没有“醇”，则你可将一名角色区域内的一张牌置于其武将牌上，称为“醇”。②一名角色使用【杀】时，若其有“醇”，则其可以交给你一张牌，令此【杀】的伤害值基数+1。③一名角色进入濒死状态时，若其有“醇”，则你可以移去“醇”并摸一张牌，然后令其回复1点体力。",
  tw_guohuai: "TW郭淮",
  twjingce: "精策",
  twjingce_info:
    "当你于出牌阶段使用第X张牌时，你可以摸X张牌（X为你的体力值）。若此阶段你此前摸过牌或本回合造成过伤害，你获得一枚“策”标记。",
  yuzhang: "御嶂",
  yuzhang_info:
    "你可以弃置一枚“策”标记，然后跳过一个阶段。当你受到伤害后，你可弃置一枚“策”标记，然后选择一项：⒈令伤害来源弃置X张牌（X为其体力值）；⒉令伤害来源本回合不能再使用或打出牌。",
  tw_caozhao: "曹肇",
  twfuzuan: "复纂",
  twfuzuan_info:
    "出牌阶段限一次/当你受到伤害后/当你对其他角色造成伤害后，你可选择一名拥有转换技的角色，变更其的一个转换技的的状态。",
  twchongqi: "宠齐",
  twchongqi_info:
    "锁定技。游戏开始时，你令所有角色获得〖非服〗。然后你可减1点体力上限，令一名其他角色获得〖复纂〗。",
  twfeifu: "非服",
  twfeifu_info:
    "转换技。阴：当你成为【杀】的唯一目标后；阳：当你使用【杀】指定唯一目标后；目标角色须交给使用者一张牌。若此牌为装备牌，则使用者可使用此牌。",
  tw_wangchang: "TW王昶",
  twkaiji: "开济",
  twkaiji_info:
    "准备阶段，你可令至多X名角色各摸一张牌（X为本局游戏内进入过濒死状态的角色数+1）。若有角色以此法获得了非基本牌，则你摸一张牌。",
  twshepan: "慑叛",
  twshepan_info:
    "每回合限一次。当你成为其他角色使用牌的目标后，你可选择一项：⒈摸一张牌。⒉将其区域内的一张牌置于牌堆顶。然后若你的手牌数与其相等，则你将此技能的发动次数归零，且可以令此牌对你无效。",
  tw_wangcan: "TW王粲",
  twdianyi: "典仪",
  twdianyi_info:
    "锁定技。你的回合结束时，若你本回合内：造成过伤害，你弃置所有手牌；未造成过伤害，你将手牌数调整至四张。",
  twyingji: "应机",
  twyingji_wuxie: "应机",
  twyingji_info:
    "当你于回合外需要使用或打出一张基本牌或普通锦囊牌时，若你没有手牌，则你可摸一张牌，然后视为使用或打出此牌。",
  twshanghe: "觞贺",
  twshanghe_info:
    "限定技。当你进入濒死状态时，你可令所有其他角色依次交给你一张牌；若这些牌中没有【酒】，则你将体力回复至1点。",
  tw_wujing: "TW吴景",
  twfenghan: "锋捍",
  twfenghan_info:
    "每回合限一次。当你使用【杀】或伤害类锦囊牌指定第一个目标后，你可令至多X名角色各摸一张牌（X为此牌的目标数）。",
  twcongji: "从击",
  twcongji_info:
    "当你的红色牌于回合外因弃置而进入弃牌堆后，你可令一名其他角色获得这些牌。",
  old_quancong: "TW全琮",
  zhenshan: "振赡",
  zhenshan_info:
    "当你需要使用或打出一张基本牌时，你可以与一名手牌数少于你的角色交换手牌，视为使用或打出此牌。",
  tw_tianyu: "TW田豫",
  twzhenxi: "震袭",
  twzhenxi_info:
    "每回合限一次。当你使用【杀】指定目标后，你可选择一项：⒈弃置其X张手牌（X为你至其的距离）；⒉将其装备区或判定区内的一张牌移动到另一名角色的装备区或判定区内。若其体力值大于你或其体力值为全场最高，则你可以改为依次执行以上两项。",
  twyangshi: "扬师",
  twyangshi_info:
    "锁定技。当你受到伤害后，若场上有不在你攻击范围内的其他角色，则你令攻击范围+1；若没有，则你从牌堆中获得一张【杀】。",
  tw_puyangxing: "TW濮阳兴",
  twzhengjian: "征建",
  twzhengjian_info:
    "游戏开始时，你可选择获得一项效果：⒈其他角色的出牌阶段结束时，若其本阶段内未使用过非基本牌，则其须交给你一张牌，然后你可失去此效果并获得〖征建〗的效果二。⒉其他角色的出牌阶段结束时，若其本阶段内未获得过牌，则其须交给你一张牌，然后你可失去此效果并获得〖征建〗的效果二。",
  twzhongchi: "众斥",
  twzhongchi_info:
    "锁定技，限定技。当你因〖征建〗而获得牌后，若已经有至少X名角色因〖征建〗而交给你过牌（X为游戏人数的一半且向上取整），则你于本局游戏内受到渠道为【杀】的伤害+1，且你将〖征建〗中的“其须交给你一张牌”改为“你可对其造成1点伤害”。",

  tw_mobile: "移动版·海外服",
  tw_mobile2: "海外服异构",
  tw_yijiang: "一将成名TW",
  tw_english: "英文版",
};
export const translate_xiake = {
  xk_dongfangweiming: "东方未明",
  xk_guyuexuan: "谷月轩",
  xk_jinji: "荆棘",
  xk_shenxiangyun: "沈湘芸",
  xk_fujianhan: "傅剑寒",
  zhongzhan: "重斩",
  zhongzhan_info: "每当你即将造成伤害，你可流失一点体力令伤害+1",
  gzhenji: "震击",
  gzhenji_info:
    "你使用杀造成伤害后，可以摸一张牌，并且本回合内可以额外使用一张杀",
  rouquan: "柔拳",
  rouquan_info:
    "你可以重铸装备区内的牌；当你没有武器牌时，你的杀可以指定任意个目标",
  zitong: "通悟",
  zitong_info:
    "当你于自己的回合内使用第三张牌时，你可以将一张传送门置于你的手牌",
};
export const translate_xianjian = {
  pal_xiahoujinxuan: "夏侯瑾轩",
  pal_muchanglan: "暮菖兰",
  pal_xia: "瑕",
  pal_jiangcheng: "姜承",

  pal_jiangyunfan: "姜云凡",
  pal_tangyurou: "唐雨柔",
  pal_longyou: "龙幽",
  pal_xiaoman: "小蛮",

  pal_wangxiaohu: "王小虎",
  pal_sumei: "苏媚",
  pal_shenqishuang: "沈欺霜",
  pal_longkui: "龙葵",
  pal_nangonghuang: "南宫煌",
  pal_wenhui: "温慧",
  pal_wangpengxu: "王蓬絮",
  pal_xingxuan: "星璇",
  pal_leiyuange: "雷元戈",

  pal_zhaoliner: "赵灵儿",
  pal_linyueru: "林月如",
  pal_lixiaoyao: "李逍遥",

  pal_xuejian: "雪见",
  pal_jingtian: "景天",
  pal_zixuan: "紫萱",
  pal_anu: "阿奴",

  pal_yuntianhe: "云天河",
  pal_hanlingsha: "韩菱纱",
  pal_liumengli: "柳梦璃",
  pal_murongziying: "慕容紫英",
  pal_changqing: "长卿",
  pal_xuanxiao: "玄霄",

  pal_yuejinzhao: "越今朝",
  pal_yueqi: "越祈",
  pal_luozhaoyan: "洛昭言",
  pal_xianqing: "闲卿",
  pal_mingxiu: "明绣",
  pal_jushifang: "居十方",

  xyufeng: "御蜂",
  xyufeng_info: "出牌阶段限一次，可以将一张黑桃牌当作机关蜂使用",
  lingquan: "灵泉",
  lingquan_info:
    "觉醒技，结束阶段，若游戏轮数不小于3且你本回合使用的牌数大于你的体力值，你摸三张牌，然后获得技能【水蕴】",
  shenwu: "神舞",
  shenwu_info:
    "觉醒技，在一名角色的结束阶段，若你本局至少发动过3次【水蕴】，你增加一点体力和体力上限并获得两点护甲，然后获得技能【回梦】",
  txianqu: "仙音",
  txianqu_info:
    "出牌阶段限一次，当你即将造成伤害时，你可以防止之，然后摸两张牌并回复一点体力",
  qiongguang: "穹光",
  qiongguang_info:
    "弃牌阶段结束时，若你弃置了至少两张牌，你可以对所有敌方角色施加一个随机的负面效果",
  xunying: "迅影",
  xunying_info: "每当你使用杀对一名目标结算完毕后，你可以继续对目标使用杀",
  liefeng: "冽风",
  liefeng_info:
    "锁定技，当你在回合内使用第二张牌时，你本回合获得【炎斩】；当你在回合内使用第三张牌时，你本回合获得【天剑】；当你在回合内使用第四张牌时，你本回合获得【御风】",
  yuexing: "越行",
  yuexing2: "越行",
  yuexing_info:
    "出牌阶段限一次，你可以指定一名角色，本阶段内将你与该角色到其他角色的距离基数互换",
  lingdi: "灵笛",
  lingdi_info:
    "出牌阶段，你可以弃置一张本回合与此法弃置的牌花色均不同的手牌，然后选择一名与你距离为X的角色与其各摸一张牌，X为本回合发动灵笛的次数（含此次）",
  xiaoyue: "啸月",
  xiaoyue_info:
    "锁定技，每轮开始时，若你手牌中有杀，你将手牌中的一张随机杀对一名随机敌方角色使用，然后获得一点护甲",
  minsha: "冥煞",
  minsha_info:
    "出牌阶段限一次，你可以弃置两张牌，对一名体力值大于1的其他角色造成一点雷属性伤害，然后距离目标1以内的所有其他角色随机弃置一张牌",
  xhuanlei: "唤雷",
  xhuanlei_info:
    "每当你受到一次伤害，若伤害来源体力值大于你，你可以对其造成一点雷属性伤害，然后其摸一张牌",
  anwugu: "巫蛊",
  anwugu2: "蛊",
  anwugu_info:
    "每当你对其他角色造成一次伤害，你可以令目标获得三枚蛊标记；拥有蛊标记的角色手牌上限-1，每回合最多使用X张牌（X为蛊标记数），每个结束阶段失去一枚蛊标记",
  xtanxi: "探息",
  xtanxi_info:
    "出牌阶段限一次，你可以弃置一张手牌，然后随机选择一名手牌中有与之同名的牌的敌方角色，观看其手牌并获得任意一张",
  linghuo: "灵火",
  linghuo_info:
    "每两轮限一次，在一名其他角色的结束阶段，若其本回合内造成过伤害，你可以对其造成一点火属性伤害",
  guijin: "归烬",
  guijin2: "归烬",
  guijin2_bg: "烬",
  guijin_info:
    "每三轮限一次，出牌阶段，你可以观看牌堆顶的4张牌，然后可以将其中任意张牌分配给任意角色，被分到牌的角色跳过下一摸牌阶段，然后将剩余牌以原顺序放回牌堆顶",
  chengxin: "澄心",
  chengxin2: "澄心",
  chengxin2_bg: "心",
  chengxin_info:
    "每四轮限一次，当一名角色进入濒死状态时，你可以令其将体力值回复至1，然后该角色防止一切伤害直到下一回合结束",
  tianwu: "天舞",
  tianwu_info:
    "每当你使用卡牌指定一名敌方角色为惟一目标，你可以对其施加一个随机的负面效果",
  tianwu_info_alter:
    "每当你使用卡牌指定一名敌方角色为惟一目标，你可以对其施加一个随机的负面效果，每回合限发动一次",
  liguang: "离光",
  liguang_info:
    "结束阶段，你可以弃置一张手牌并将场上的一张牌移动到另一个合理的位置",
  shiying: "逝影",
  shiying_info:
    "限定技，在一名其他角色死亡前，你可以防止其死亡，然后你与该角色失去全部技能、将体力和体力上限变为3、移去所有牌并摸3张牌",
  yujia: "御甲",
  yujia_info:
    "每当你使用一张未强化的装备牌，你可以随机观看X张机关牌，并选择一张获得之，X为你本局使用过的机关牌数且至少为1",
  xiepan: "械磐",
  xiepan_info:
    "每当你失去最后一张基本牌，你可以弃置一张手牌，然后获得一张随机装备牌",
  yanshi: "偃师",
  yanshi_info:
    "觉醒技，结束阶段，若你累计有4个回合使用过机关牌，你增加一点体力和体力上限，然后用随机装备填满你的装备区",
  ywuhun: "雾魂",
  ywuhun_bg: "魂",
  ywuhun_info:
    "锁定技，回合开始前，你获得一个额外的回合，并在此回合结束后复原场上及牌堆中的所有牌；当你在此回合中造成伤害后，终止所有结算并结束此回合",
  // ywuhun_info_alter:'锁定技，回合开始前，你获得一个额外的回合，并在此回合结束后复原场上及牌堆中的所有牌；当你在此回合中造成伤害后，终止所有结算并结束此回合',
  feichen: "飞尘",
  feichen_info: "",
  tanhua: "昙华",
  tanhua_info:
    "锁定技，你回复体力的效果改为摸两张牌；当你进入濒死状态时，你回复一点体力并失去此技能",
  xjyingfeng: "影锋",
  xjyingfeng_info:
    "锁定技，每当你使用一张杀结算完毕后，你随机对一名不是此杀目标的敌方角色使用一张杀",
  fenglue: "风掠",
  fenglue_info:
    "你可以放弃出牌阶段，改为指定一名其他角色并选择任意张手牌，依次对该角色使用，若如此做，此阶段内该角色每受到一点伤害，你在结算后摸一张牌",
  xjzongyu: "纵雨",
  xjzongyu_info:
    "出牌阶段限一次，你可以弃置一张黑色手牌，视为使用一张飞镖，随机指定两名敌方角色为目标",
  fanling: "返灵",
  fanling_info:
    "锁定技，每当一名角色失去体力，你回复一点体力，每回合只能发动一次",
  huahu: "化狐",
  huahu_bg: "狐",
  huahu_info:
    "限定技，你可以失去所有技能和一点体力上限，然后令任意名其他角色回复一点体力、获得一点护甲并摸一张牌",
  sheying: "蛇影",
  sheying_info:
    "每回合限一次，当你使用卡牌造成一次伤害后，你可以进行一次判定，若结果为黑色，你收回此牌",
  dujiang: "毒降",
  dujiang_info: "出牌阶段限一次，你可以弃置一张黑色牌令一名随机敌人获得一张毒",
  binxin: "冰心",
  binxin_info: "在一名角色的结束阶段，若其体力值为1，你可以令其获得一点护甲",
  qixia: "绮霞",
  qixia_info:
    "锁定技，当你累计使用或打出了4种不同花色的牌后，你于本回合结束后获得一个额外回合",
  jianzhen: "剑阵",
  jianzhen_info:
    "锁定技，当你使用杀对目标结算完毕后，其他角色可以对该目标使用一张杀，当有人选择出杀后终止此结算",
  husha: "虎煞",
  husha_bg: "煞",
  husha_info:
    "每当你于出牌阶段造成一点伤害，你获得一枚虎煞标记（标记数不超过3）；结束阶段，你可以选择一项：1. 移去一枚虎煞标记，视为对任意角色使用一张杀；2. 移去两枚虎煞标记，视为使用一张南蛮入侵；3. 移去三枚虎煞标记，视为对除你之外的角色使用一张元素毁灭",
  longhuo: "龙火",
  longhuo_info: "结束阶段，你可以对所有角色各造成一点火焰伤害",
  fenshi: "焚世",
  fenshi_info:
    "觉醒技，当你解除濒死状态时，你获得两点护甲，摸两张牌，然后获得技能龙火",
  yanzhan: "炎斩",
  yanzhan_info:
    "出牌阶段限一次，你可以将一张红色牌当作火杀使用，此杀只能用与之花色相同的闪响应；若此杀造成了伤害，你本回合可以额外使用一张杀",
  feixia: "飞霞",
  feixia_info:
    "出牌阶段限一次，你可以弃置一张红色牌视为对一名随机敌人使用一张不计入出杀次数的杀",
  lueying: "掠影",
  lueying_info:
    "每当你使用一张杀，你可以随机获得目标的一张牌，然后目标可以指定一名其他角色，你弃置该角色一张牌（每回合限发动一次，没有弃牌目标时无法发动）",
  feng: "风",
  feng_info: "锁定技，当你累计摸2次牌后，你下一次摸牌时摸牌数+1",
  ya: "雅",
  ya_info: "锁定技，当你累计受到2次伤害后，你下一次受到的伤害-1",
  song: "颂",
  song_info: "锁定技，当你累计造成2次伤害后，你下一次造成的伤害+1",
  longxiang: "龙翔",
  longxiang_info:
    "当你使用杀指定目标后，你可以弃置目标若干张手牌直到其手牌数与你相同",
  huxi: "虎袭",
  huxi_info: "你可以失去一点体力并获得一点护甲，视为使用一张杀",
  xuanmo: "玄墨",
  xuanmo_info:
    "出牌阶段限一次，你可以将一张手牌置于牌堆顶并随机获得两张与之类别相同的牌",
  danqing: "丹青",
  danqing_info:
    "结束阶段，若你累计使用了4张花色不同的牌，你可以选择至多4名角色随机获得一个正面效果",
  danqing_info_alter:
    "结束阶段，若你累计使用了4张花色不同的牌，你可以选择至多2名角色随机获得一个正面效果",
  zhangmu: "障目",
  zhangmu_info:
    "每回合限一次，当你需要使用或打出一张闪时，你可以展示一张闪，视为使用或打出了此闪",
  feizhua: "飞爪",
  feizhua_info: "当你使用一张杀时，你可以将与目标相邻的角色追加为额外目标",
  leiyu: "雷狱",
  leiyu_info:
    "结束阶段，你可以弃置一张黑色手牌，视为对本回合内所有成为过你的卡牌目标的角色使用一张惊雷闪",
  lingxue: "灵血",
  lingxue_info: "锁定技，每当你回复一点体力，你获得一点护甲",
  zhaoyao: "招摇",
  zhaoyao_info:
    "其他角色的摸牌阶段开始时，你可以与其拼点，若你赢，你摸两张牌，然后将两张牌置于牌堆顶",
  sheling: "摄灵",
  sheling_info:
    "其他角色于你的回合内因使用、打出或弃置而失去牌时，你可以获得之（每回合最多发动三次）",
  fenxing: "分形",
  fenxing_info: "锁定技，准备阶段，你有50%概率变身为另一形态",
  guijiang: "鬼降",
  guijiang2: "鬼降",
  guijiang_info:
    "出牌阶段限一次，你可以弃置一张黑色牌，令一名其他角色无法成为回复牌的目标直到你下一回合开始",
  diesha: "叠杀",
  diesha_info:
    "锁定技，每当你使用杀造成伤害，受伤害角色失去一点体力，你回复一点体力",
  lingyu: "灵愈",
  lingyu_info: "结束阶段，你可以令一名其他角色回复一点体力",
  diewu: "蝶舞",
  diewu_info:
    "出牌阶段，你可以将一张【杀】交给一名角色，若你于此阶段内首次如此做，你摸一张牌",
  duxinshu: "读心",
  duxinshu_info:
    "出牌阶段限一次，你可以观看一名其他角色的手牌，然后可以用一张手牌替换其中的一张",
  feixu: "飞絮",
  feixu_info: "每当一名角色使用或打出一张闪，你可以令其摸一张牌",
  xuanyan: "玄炎",
  xuanyan2: "玄炎",
  xuanyan_info: "锁定技，你的火属性伤害+1；你造成火属性伤害后流失1点体力",
  ningbin: "凝冰",
  ningbin_info: "锁定技，每当你受到1次雷属性伤害，你回复1点体力",
  xfenxin: "焚心",
  xfenxin2: "焚心",
  xfenxin_info:
    "锁定技，每当你的体力值发生改变，你摸等量的牌；每当你杀死一名角色，你增加一点体力上限并回复一点体力",
  xfenxin_info_alter: "锁定技，每当你的体力值发生改变，你摸一张牌",
  luanjian: "乱剑",
  luanjian_info:
    "出牌阶段，你可以将两张杀当杀使用，此杀无视距离，可以指定任意名目标且有50%的机率伤害+1",
  ctianfu: "天符",
  ctianfu2: "天符",
  ctianfu3: "天符",
  ctianfu_info:
    "出牌阶段，你可以将一张闪置于一名其他角色的武将牌上，该角色在下一次造成伤害时受到来自你的一点雷属性伤害并随机弃置一张牌，然后移去此牌",
  shuiyun: "水蕴",
  shuiyun_bg: "蕴",
  shuiyun2: "水蕴",
  shuiyun5: "水蕴",
  shuiyun3: "水蕴",
  shuiyun_info:
    "结束阶段，你可以将一张与武将牌上的牌类别均不相同的手牌置于武将牌上称为“蕴”；任意一名角色处于濒死状态时，你可以弃置一张“蕴”令其回复1点体力",
  shuiyun_info_alter:
    "结束阶段，你可以将一张与武将牌上的牌类别均不相同的手牌置于武将牌上称为“蕴”（不能超过2张）；任意一名角色处于濒死状态时，你可以弃置一张“蕴”令其回复1点体力",
  wangyou: "忘忧",
  wangyou_info:
    "其他角色的结束阶段，你可以弃置一张牌，令此回合内受过伤害的所有角色各摸一张牌",
  changnian: "长念",
  changnian2: "追思",
  changnian2_info: "锁定技，结束阶段，你摸一张牌",
  changnian_info:
    "你死亡时，可以将所有牌交给一名其他角色，令其获得技能【追思】",
  sajin: "洒金",
  sajin_info:
    "出牌阶段限一次，你可以弃置一张手牌并指定任意名角色进行判定，若判定颜色与你弃置的牌相同，该角色回复一点体力",
  jtjubao: "聚宝",
  jtjubao_info:
    "当其他角色于你的回合外首次弃置非基本牌时，你可以获得其中的随机一张",
  guiyuan: "归元",
  guiyuan_info: "出牌阶段限一次，你可以弃置一张杀，然后回复一点体力并摸一张牌",
  xshuangren: "双刃",
  xshuangren_info:
    "当你的武器牌被替换时，你可以将其置于你的武将牌上，并获得此装备的武器效果（不含距离）",
  duci: "毒刺",
  duci_info: "每当你失去一次装备牌，可以对距离1以内的一名其他角色造成一点伤害",
  shenmu: "神木",
  shenmu_info:
    "任意一名角色濒死时，你可以展示你的手牌并弃置其中的所有红色牌（至少一张），若如此做，该角色回复一点体力，然后摸X张牌，X为你弃置的手牌数",
  qijian: "气剑",
  qijian_info:
    "弃牌阶段结束时，你可以指定至多X名目标视为使用一张杀，X为你于此阶段弃置的卡牌数",
  poyun: "破云",
  poyun_info: "每当你造成一次伤害，你可以弃置一枚玄凝标记，然后弃置对方两张牌",
  poyun_info_alter:
    "每当你造成一次伤害，你可以弃置一枚玄凝标记，然后弃置对方一张牌",
  qianfang: "千方",
  qianfang_info:
    "准备阶段，若你有玄凝标记，你可以弃置3-X张牌和所有玄凝标记，视为使用了一张【万箭齐发】，每当一名敌方角色因此牌受到伤害，你摸一张牌。X为你的玄凝标记数",
  qianfang_info_alter:
    "准备阶段，若你有玄凝标记，可以弃置3-X张牌和所有玄凝标记，视为使用了一张【万箭齐发】，X为你的玄凝标记数",
  longxi: "龙息",
  longxi2: "龙息",
  longxi_info:
    "锁定技，在回合外每当你需要使用或打出一张卡牌时，若牌堆顶的前两张中有可使用或打出的牌，你立即获得之",
  zhuyue: "逐月",
  zhuyue_info:
    "出牌阶段限一次，你可以弃置一张非基本牌并指定至多两个目标各随机弃置一张牌，若如此做，你本回使用的杀须指定选中角色为目标",
  zhuyue_info_alter:
    "出牌阶段限一次，你可以弃置一张黑色非基本牌并指定至多两个目标各随机弃置一张牌，若如此做，你本回使用的杀须指定选中角色为目标",
  guanri: "贯日",
  guanri_info:
    "限制技，你可以弃置两张红色手牌并流失一点体力，然后对一名体力值不少于你的其他角色造成两点火焰伤害并弃置其所有装备牌",
  tianxian: "天弦",
  tianxian_info:
    "锁定技，你的杀无视距离且可指定任意多个目标，目标须进行一次判定，若结果为黑色则取消之",
  zhimeng: "织梦",
  zhimeng2: "织梦",
  zhimeng3: "织梦",
  zhimeng_info:
    "结束阶段，你可以选择一名其他角色将牌堆顶的一张牌置于该角色的武将牌上，直到你的下个准备阶段将其收入手牌。当一名角色武将牌上有织梦牌时，每当其成为与此牌类型相同的卡牌的目标，可以摸一张牌",
  zhimeng_info_alter: "结束阶段，你可以令一名其他角色摸一张牌",
  runxin: "润心",
  runxin_info: "每当你使用或打出一张红桃牌，你可以令一名角色回复一点体力",
  tannang: "探囊",
  tannang_info:
    "出牌阶段限一次，你可以将一张梅花手牌当顺手牵羊使用；你的顺手牵羊无距离限制",
  tuoqiao: "烟瘴",
  tuoqiao_info: "你可以将一张黑色牌当作石灰粉使用",
  xiaoyao: "逍遥",
  xiaoyao_info:
    "每当你成为其他角色的卡牌目标，你可以弃置一张与之花色相同的手牌取消之",
  tianjian: "天剑",
  tianjian_info:
    "出牌阶段限一次，你可以将一张杀当作万箭齐发使用，受到伤害的角色随机弃置一张牌",
  tianjian_info_alter: "出牌阶段限一次，你可以将一张杀当作万箭齐发使用",
  xjyufeng: "御风",
  xjyufeng_info:
    "锁定技，当你失去手牌后，若手牌数少于2，你将手牌数补至2（每回合最多发动两次）",
  huimeng: "回梦",
  huimeng_info: "每当你回复一点体力，可以摸两张牌",
  tianshe: "天蛇",
  tianshe2: "天蛇",
  tianshe_info:
    "锁定技，你防止即将受到的属性伤害，每当你造成一次属性伤害，你回复一点体力",
};
export const translate_xinghuoliaoyuan = {
  xinghuoliaoyuan: "星火燎原",
  sp_taishici: "SP太史慈",
  wangcan: "王粲",
  re_jsp_pangtong: "SP庞统",
  lvdai: "吕岱",
  re_zhangliang: "张梁",
  lvqian: "吕虔",
  panjun: "潘濬",
  duji: "杜畿",
  zhoufang: "周鲂",
  yanjun: "严畯",
  liuyao: "刘繇",
  liuyan: "刘焉",
  xinfu_guolun: "过论",
  xinfu_guolun_info:
    "出牌阶段限一次，你可以展示一名其他角色的手牌，然后展示你的一张牌。你与其交换这两张牌，然后展示的牌点数较小的角色摸一张牌。",
  xinfu_zhanji: "展骥",
  xinfu_zhanji_info:
    "锁定技，你的出牌阶段内，当你因摸牌且不是因为此技能效果而获得牌时，你额外摸一张牌。",
  xinfu_songsang: "送丧",
  xinfu_songsang_info:
    "限定技，其他角色死亡时，你可以回复一点体力（若你未受伤，则改为加一点体力上限）；然后获得技能〖展骥〗。",
  xinfu_jixu: "击虚",
  xinfu_jixu_info:
    "出牌阶段限一次，若你有手牌，你可以令任意名体力值相等的其他角色猜测你的手牌中是否有【杀】。然后，你摸X张牌（X为猜错的角色数）。若你有【杀】，则你本回合内使用【杀】时，所有这些角色均成为【杀】的目标；若你没有【杀】，则你弃置所有这些角色的各一张牌。若X为零，你结束出牌阶段。",
  jixu_sha: "击虚",
  jixu_sha_info: "",
  xinfu_sanwen: "散文",
  xinfu_sanwen_info:
    "每回合限一次。当你获得牌后，若你的原手牌中有与这些牌名称相同的牌，则你可以展示这些牌，弃置新得到的同名牌并摸两倍的牌。",
  xinfu_qiai: "七哀",
  xinfu_qiai_info:
    "限定技，当你进入濒死状态时，你可以令所有其他角色依次交给你一张牌。",
  xinfu_denglou: "登楼",
  xinfu_denglou_info:
    "限定技，结束阶段，若你没有手牌，则你可以观看牌堆顶的四张牌，依次使用其中的所有基本牌（不能使用则弃置），然后获得其余的牌。",
  qinguo_use: "勤国",
  qinguo_use_info: "",
  xinfu_qinguo: "勤国",
  xinfu_qinguo_info:
    "当你使用的装备牌结算完成时，你可以视为使用一张【杀】；当你因使用或失去装备牌导致装备区内牌的数量发生变化后，若你装备区内牌的数量等于你的体力值，则你回复1点体力。",
  qinguo_lose: "勤国",
  qinguo_lose_info: "",
  xinfu_jijun: "集军",
  xinfu_jijun_info:
    "当你于回合内使用非装备牌或武器牌指定目标后，若你是此牌的目标，你可以进行一次判定。然后，你将判定牌置于自己的武将牌上，称之为「方」。",
  xinfu_fangtong: "方统",
  xinfu_fangtong_info:
    "结束阶段，你可以弃置总点数之和为36的一张牌与任意张「方」，并对一名其他角色造成3点雷电伤害。",
  xinfu_weilu: "威虏",
  xinfu_weilu_info:
    "锁定技，当你受到伤害后，伤害来源获得一枚「虏」。你的下个出牌阶段开始时，所有有「虏」的角色将体力失去至1点。此阶段结束后，这些角色回复以此法失去的体力。",
  weilu_effect: "威虏",
  weilu_effect_info: "",
  weilu_effect2: "威虏",
  weilu_effect2_info: "",
  xinfu_zengdao: "赠刀",
  xinfu_zengdao_info:
    "限定技，出牌阶段，你可以将装备牌内的任意张牌置于一名其他角色的武将牌旁，称之为「刀」。该角色造成伤害时，其须移去一张「刀」，然后此伤害+1。",
  xinfu_zengdao2: "赠刀",
  xinfu_zengdao2_info: "",
  xinfu_guanwei: "观微",
  xinfu_guanwei_info:
    "每回合限一次。一名角色的出牌阶段结束时，若其于出牌阶段内使用过两张以上的牌且花色均相同，则你可以弃置一张牌，令其摸两张牌并进行一个额外的出牌阶段。",
  xinfu_gongqing: "公清",
  xinfu_gongqing_info:
    "锁定技。当你受到伤害时，若伤害来源的攻击范围：<3，则你令此伤害的数值减为1。>3，你令此伤害+1。",
  xinfu_andong: "安东",
  xinfu_andong_info:
    "当你受到伤害时，你可以令伤害来源选择一项：1.令你观看其的手牌并获得其中的所有红桃牌；2.防止此伤害，然后其本回合内的红桃手牌不计入手牌上限。",
  xinfu_yingshi: "应势",
  xinfu_yingshi_info:
    "出牌阶段开始时，若场上的所有角色均没有「酬」，则你可以将所有的红桃牌置于一名其他角色的武将牌旁，称之为「酬」。有「酬」的角色受到「杀」的伤害/死亡时，伤害来源/你获得其中的一张/所有的「酬」。",
  yingshi_heart: "应势",
  yingshi_heart_info: "",
  yingshi_die: "应势",
  yingshi_die_info: "",
  xinfu_duanfa: "断发",
  xinfu_duanfa_info:
    "出牌阶段，你可以弃置任意张黑色牌，然后摸等量的牌。（每回合内限X张，X为你的体力上限）",
  xinfu_youdi: "诱敌",
  xinfu_youdi_info:
    "结束阶段开始时，你可以令一名其他角色弃置你的一张手牌，若此牌：不为黑色，你摸一张牌。不为【杀】，你获得该角色的一张牌。",
  xinfu_guanchao: "观潮",
  xinfu_guanchao_info:
    "出牌阶段开始时，你可以选择获得一项效果直到回合结束：1.当你使用牌时，若你此阶段使用过的所有牌的点数为递增，你摸一张牌；2.当你使用牌时，若你此阶段使用过的所有牌的点数为递减，你摸一张牌。",
  xinfu_xunxian: "逊贤",
  xinfu_xunxian_info:
    "每名其他角色的回合限一次，当你使用或打出的牌结算完成后，你可以将其对应的所有实体牌交给一名手牌数大于你的角色。",
  xinfu_kannan: "戡难",
  xinfu_kannan_info:
    "出牌阶段限X次，你可以与一名本回合内未成为过〖戡难〗目标的角色拼点。若你赢，你使用的下一张【杀】的伤害值基数+1，且你本回合内不能再发动〖戡难〗。若你没赢，其使用的下一张【杀】的伤害值基数+1。（X为你的体力值）。",
  kannan_eff: "戡难",
  kannan_eff_info: "",
  xinfu_tushe: "图射",
  xinfu_tushe_info:
    "当你使用非装备牌指定目标后，若你没有基本牌，则你可以摸X张牌。（X为此牌指定的目标数）",
  xinfu_limu: "立牧",
  xinfu_limu_info:
    "出牌阶段限一次，你可以将一张♦牌当做【乐不思蜀】对自己使用，然后回复1点体力。只要你的判定区内有牌，你对攻击范围内的其他角色使用牌便没有次数和距离限制。",
  xinyingshi: "应势",
  xinyingshi_info:
    "出牌阶段开始时，若场上所有角色的武将牌上均没有“酬”，则你可以将任意张牌置于一名角色的武将牌上，称为“酬”。若如此做：当有角色使用牌对有“酬”的角色造成伤害后，其可以获得一张“酬”，并获得牌堆中所有与“酬”花色点数均相同的牌；有“酬”的角色死亡时，你获得其所有“酬”。",
};
export const translate_yijiang = {
  old_huaxiong: "华雄",
  yufan: "虞翻",
  xushu: "旧徐庶",
  caozhi: "曹植",
  zhangchunhua: "张春华",
  lingtong: "凌统",
  xunyou: "荀攸",
  liubiao: "刘表",
  zhuran: "朱然",
  yujin: "于禁",
  masu: "旧马谡",
  xin_masu: "马谡",
  xin_fazheng: "法正",
  wuguotai: "吴国太",
  chengong: "陈宫",
  xusheng: "徐盛",
  guohuai: "郭淮",
  caochong: "曹冲",
  bulianshi: "步练师",
  handang: "韩当",
  fuhuanghou: "伏寿",
  caifuren: "蔡夫人",
  zhonghui: "钟会",
  old_zhonghui: "旧钟会",
  sunluban: "孙鲁班",
  chenqun: "陈群",
  zhangsong: "张松",
  guyong: "顾雍",
  jianyong: "简雍",
  old_madai: "马岱",
  gz_madai: "马岱",
  xin_xushu: "徐庶",
  manchong: "满宠",
  liufeng: "刘封",
  liru: "旧李儒",
  yj_jushou: "沮授",
  zhuhuan: "朱桓",
  xiahoushi: "夏侯氏",
  panzhangmazhong: "潘璋马忠",
  caorui: "曹叡",
  caoxiu: "曹休",
  zhongyao: "钟繇",
  liuchen: "刘谌",
  zhangyi: "张嶷",
  sunxiu: "孙休",
  zhuzhi: "朱治",
  quancong: "全琮",
  gongsunyuan: "公孙渊",
  guotufengji: "郭图逢纪",
  zhoucang: "周仓",
  guanping: "关平",
  liaohua: "廖化",
  caozhen: "曹真",
  wuyi: "吴懿",
  hanhaoshihuan: "韩浩史涣",
  chengpu: "程普",
  gaoshun: "高顺",
  xin_yujin: "节钺于禁",
  xin_liru: "李儒",
  guohuanghou: "郭皇后",
  liuyu: "刘虞",
  sundeng: "孙登",
  liyan: "李严",
  sunziliufang: "孙资刘放",
  huanghao: "黄皓",
  zhangrang: "张让",
  cenhun: "岑昏",
  xinxianying: "OL辛宪英",
  wuxian: "吴苋",
  xushi: "徐氏",
  caojie: "曹节",
  xuezong: "薛综",
  jikang: "嵇康",
  qinmi: "秦宓",
  caiyong: "蔡邕",
  re_yujin: "于禁",

  new_qingxian: "清弦",
  new_qingxian_info:
    "出牌阶段限一次，你可以弃置至多X张牌并选择等量的其他角色。这些角色中，装备区内牌数少于你的回复1点体力，等于你的摸一张牌，多于你的失去1点体力。若你以此法指定的角色数等于X，则你摸一张牌。（X为你的体力值）",
  new_juexiang: "绝响",
  new_juexiang_info:
    "锁定技，当你死亡后，杀死你的角色弃置装备区内的所有牌并失去1点体力。然后，你可以令一名其他角色获得技能〖残韵〗。若该角色区域内有梅花牌，则其可以弃置其中的一张，然后其获得技能〖绝响〗。",
  new_canyun: "残韵",
  new_canyun_info:
    "出牌阶段限一次，你可以弃置至多X张牌并选择等量的其他角色（不能选择已经成为过〖残韵〗目标的角色）。这些角色中，装备区内牌数少于你的回复1点体力，等于你的摸一张牌，多于你的失去1点体力。若你以此法指定的角色数等于X，则你摸一张牌。（X为你的体力值）",
  qingxian_draw: "清弦",
  qingxian_draw_info: "",
  zhenjun: "镇军",
  zhenjun_info:
    "准备阶段，你可以弃置一名手牌数多于体力值的角色的X张牌（X为其手牌数和体力值之差），然后选择一项：1.你弃置等同于其中非装备牌数量的牌；2.其摸等量的牌。",
  rezhenjun: "镇军",
  rezhenjun_info:
    "准备阶段，你可以弃置一名角色的X张牌（X为其手牌数和体力值之差且至少为1），然后选择一项：1.你弃置X张牌；2.其摸X张牌。（X为其弃置的牌中非装备牌的数量）",
  fenli: "奋励",
  fenli_info:
    "若你的手牌数为全场最多，你可以跳过摸牌阶段；若你的体力值为全场最多，你可以跳过出牌阶段；若你的装备区里有牌且数量为全场最多，你可以跳过弃牌阶段。",
  pingkou: "平寇",
  pingkou_info:
    "回合结束时，你可以对至多X名其他角色各造成1点伤害（X为你本回合跳过的阶段数）。",
  xinanguo: "安国",
  xinanguo_info:
    "出牌阶段限一次，你可以选择一名其他角色，若其手牌数为全场最少，其摸一张牌；体力值为全场最低，回复1点体力；装备区内牌数为全场最少，随机使用一张装备牌。然后若该角色有未执行的效果且你满足条件，你执行之。",
  pindi: "品第",
  pindi_info:
    "出牌阶段，你可以弃置一张牌并选择一名其他角色（不能弃置相同类型牌且不能指定相同的角色），然后令其执行一项：摸X张牌；弃置X张牌（X为本回合此技能发动次数）。若其已受伤，你横置。",
  funan_jiexun: "诫训",
  bizhuan: "辟撰",
  bizhuan_bg: "书",
  bizhuan_info:
    "当你使用黑桃牌后，或你成为其他角色使用黑桃牌的目标后，你可以将牌堆顶的一张牌置于武将牌上，称为“书”；你至多拥有四张“书”，你每有一张“书” ，手牌上限+1",
  tongbo: "通博",
  tongbo_info:
    "摸牌阶段摸牌后，你可以用任意张牌替换等量的“书”，然后若你的“书”包含四种花色，你将所有“书”交给任意名其他角色",
  qingxian: "清弦",
  qingxian_info:
    "当你受到伤害/回复体力后，你可以令伤害来源/一名其他角色执行一项：失去1点体力，随机使用一张装备牌；回复1点体力，弃置一张装备牌。若其以此法使用或弃置的牌为梅花，你摸一张牌。",
  juexiang: "绝响",
  juexiang_info:
    "当你死亡后，你可以令一名角色随机获得“清弦残谱”其中一个技能，然后直到其下回合开始，其不能被选择为其他角色使用梅花牌的目标",
  juexiang_ji: "激弦",
  juexiang_ji_info:
    "当你受到伤害后，你可以令伤害来源失去1点体力，随机使用一张装备",
  juexiang_lie: "烈弦",
  juexiang_lie_info:
    "当你回复体力后，你可以令一名其他角色失去1点体力，随机使用一张装备",
  juexiang_rou: "柔弦",
  juexiang_rou_info:
    "当你受到伤害后，你可以令伤害来源回复1点体力，弃置一张装备",
  juexiang_he: "和弦",
  juexiang_he_info:
    "当你回复体力后，你可以令一名其他角色回复1点体力，弃置一张装备",
  juexiang_club: "绝响",
  juexiang_club_bg: "响",
  juexiang_club_info: "直到下回合开始，不能被选择为其他角色使用梅花牌的目标",
  jianzheng: "谏征",
  jianzheng_info:
    "当一名其他角色使用【杀】指定目标时，若你在其攻击范围内且你不是目标，则你可以将一张手牌置于牌堆顶，取消所有目标，然后若此【杀】不为黑色，你成为目标",
  zhuandui: "专对",
  zhuandui_info:
    "当你使用【杀】指定目标/成为【杀】的目标后，你可以与目标角色/此【杀】使用者拼点，若你赢，此杀不能被【闪】响应/对你无效",
  zhuandui_use_info:
    "当你使用【杀】指定目标后，你可以与目标角色拼点，若你赢，此杀不能被【闪】响应",
  zhuandui_respond_info:
    "当你成为【杀】的目标后，你可以与此【杀】使用者拼点，若你赢，此杀对你无效",
  tianbian: "天辩",
  tianbian_info:
    "你拼点时，可以改为用牌堆顶的一张牌进行拼点；当你拼点的牌亮出后，若此牌花色为红桃，则此牌的点数视为K。",
  funan: "复难",
  funan_info:
    "其他角色使用或打出牌响应你使用的牌时，你可令其获得你使用的牌（其本回合不能使用或打出这些牌），然后你获得其使用或打出的牌。",
  jiexun: "诫训",
  jiexun_info:
    "结束阶段，你可令一名其他角色摸等同于场上方块牌数的牌，然后弃置X张牌（X为此前该技能发动过的次数）。若有角色因此法弃置了所有牌，则你失去〖诫训〗，然后你发动〖复难〗时，无须令对方获得你使用的牌",
  xinjiexun: "诫训",
  xinjiexun_info:
    "结束阶段，你可令一名其他角色摸等同于场上方块牌数的牌，然后弃置X张牌（X为此前该技能发动过的次数）。若有角色因此法弃置了所有牌，则你将X归零，然后你发动〖复难〗时，无须令对方获得你使用的牌",
  shouxi: "守玺",
  shouxi_info:
    "当你成为【杀】的目标后，你可声明一种未以此法声明过的基本牌或锦囊牌的牌名。若使用者弃置一张你声明的牌，其获得你的一张牌；若否，则此【杀】对你无效",
  huimin: "惠民",
  huimin_info:
    "结束阶段，你可以摸X张牌并展示等量手牌（X为手牌数小于其体力值的角色数），然后从你指定的一名角色开始这些角色依次选择并获得其中一张",
  wengua: "问卦",
  wengua2: "问卦",
  wengua_info:
    "其他角色/你的出牌阶段限一次，其可以交给你一张牌，(若当前回合角色为你，则跳过此步骤)，你可以将此牌/一张牌置于牌堆顶或牌堆底，然后你与其/你从另一端摸一张牌",
  fuzhu: "伏诛",
  fuzhu_info:
    "一名男性角色的结束阶段，若牌堆剩余牌数不大于你体力值的十倍，则你可以依次对其使用牌堆中所有的【杀】（不能超过游戏人数），然后洗牌",
  fumian: "福绵",
  fumian_info:
    "准备阶段，你可以选择一项：1.摸牌阶段多摸一张牌；2.使用红色牌可以多选择一个目标（限一次）。若与你上回合选择的选项不同，则该选项数值+1并复原此技能",
  daiyan: "怠宴",
  daiyan_info:
    "结束阶段，你可以令一名其他角色从牌堆中获得一张红桃基本牌，然后若其于上回合成为过该技能目标，则其失去1点体力",
  xinzhongjian: "忠鉴",
  xinzhongjian_info:
    "出牌阶段限一次，你可以展示自己的一张手牌，然后展示一名其他角色的至多三张手牌。其展示的牌中：每有一张花色相同，你摸一张牌；点数相同，你对其造成1点伤害；均不同，你弃置一张手牌。",
  zhongjian: "忠鉴",
  zhongjian_bg: "鉴",
  zhongjian3: "忠鉴",
  zhongjian3_bg: "鉴",
  zhongjian_info:
    "出牌阶段限一次，你可以展示一张手牌，然后展示一名其他角色的X张手牌（X为其体力值）。若以此法展示的牌与你展示的牌：有颜色相同的，你选择：①摸一张牌。②弃置一名其他角色的一张牌；有点数相同的，本回合此技能改为“出牌阶段限两次”；均不同，你的手牌上限-1。",
  caishi: "才识",
  caishix: "才识/忠鉴",
  caishi_info:
    "摸牌阶段开始时，你可以选择一项：1.令手牌上限+1；2.回复1点体力，本回合内不能对自己使用牌。",
  xincaishi: "才识",
  xincaishi_info:
    "摸牌阶段，你可以选择一项：1.少摸一张牌，然后本回合发动〖忠鉴〗时可以多展示自己的一张牌；2.本回合手牌上限-1，然后本回合发动〖忠鉴〗时可以多展示对方的一张牌；3.多摸两张牌，本回合不能发动〖忠鉴〗。",
  guizao: "瑰藻",
  guizao_info:
    "弃牌阶段结束时，若你于此阶段弃置牌的数量不小于2且它们的花色各不相同，你可以回复1点体力或摸一张牌",
  jiyu: "讥谀",
  jiyu_info:
    "出牌阶段限一次，你可以令一名角色弃置一张手牌。若如此做，你不能使用与之相同花色的牌，直到回合结束。若其以此法弃置的牌为黑桃，你翻面并令其失去1点体力。若你有未被〖讥谀〗限制的手牌，则你可以继续发动此技能，但不能选择本回合已经选择过的目标。",
  qinqing: "寝情",
  qinqing_info:
    "结束阶段，你可以选择任意名攻击范围内含有主公的角色，然后弃置这些角色各一张牌并令其摸一张牌（无牌则不弃），若如此做，你摸X张牌（X为其中手牌比主公多的角色数）",
  huisheng: "贿生",
  huisheng_info:
    "当你受到其他角色对你造成的伤害时，你可以令其观看你任意数量的牌并令其选择一项：1.获得这些牌中的一张，防止此伤害，然后你不能再对其发动〖贿生〗；2.弃置等量的牌",
  jishe: "极奢",
  jishe_info:
    "出牌阶段限20次，若你的手牌上限大于0，你可以摸一张牌，然后你本回合的手牌上限-1。结束阶段开始时，若你没有手牌，则你可以横置至多X名角色的武将牌（X为你的体力值）",
  lianhuo: "链祸",
  lianhuo_info:
    "锁定技，当你受到火焰伤害时，若你的武将牌处于横置状态且此伤害不为连环伤害，则此伤害+1",
  taoluan: "滔乱",
  taoluan4: "滔乱",
  taoluan5: "滔乱",
  taoluan_backup: "滔乱",
  taoluan_info:
    "你可以将一张牌当做任意一张基本牌或普通锦囊牌使用（此牌不得是本局游戏你以此法使用过的牌），然后你令一名其他角色选择一项：1.交给你一张与你以此法使用的牌类别不同的牌；2.你于回合结束时失去1点体力且〖滔乱〗无效直到回合结束",
  xintaoluan: "滔乱",
  xintaoluan4: "滔乱",
  xintaoluan5: "滔乱",
  xintaoluan_backup: "滔乱",
  xintaoluan_info:
    "若场上没有濒死的角色，则你可以将一张牌当做任意一张基本牌或普通锦囊牌使用（此牌不得是本回合内你以此法使用过的牌），然后你令一名其他角色选择一项：1.交给你X张与你以此法使用的牌类别不同的牌；2.你失去X点体力且滔乱无效直到回合结束（X为你本回合内发动过〖滔乱〗的次数且至多为3）",
  jiaozhao: "矫诏",
  jiaozhao3: "矫诏",
  jiaozhao3_backup: "矫诏",
  jiaozhao2: "矫诏",
  jiaozhao_info:
    "出牌阶段限一次，你可以展示一张手牌，然后选择距离最近的一名其他角色，该角色声明一张基本牌的牌名。在此出牌阶段内，你可以将此手牌当声明的牌使用（你不能对自己使用此牌）。",
  danxin: "殚心",
  danxin_info:
    "当你受到伤害后，你可以摸一张牌，或对“矫诏”的描述依次执行下列一项修改：1.将“基本牌”改为“基本牌或普通锦囊牌”；2.将“选择距离最近的一名其他角色，该角色”改为“你”。",
  xindanxin: "殚心",
  xindanxin_info:
    "当你受到伤害后，你可以摸一张牌，并对“矫诏”的描述依次执行下列一项修改：1.将“基本牌”改为“基本牌或普通锦囊牌”；2.将“选择距离最近的一名其他角色，该角色”改为“你”。3.将“出牌阶段限一次”改为“出牌阶段限两次”",
  duliang: "督粮",
  duliang2: "督粮",
  duliang_info:
    "出牌阶段限一次，你可以获得一名其他角色的一张手牌，然后选择一项：1.令其观看牌堆顶的两张牌，然后获得其中的基本牌；2.令其于下个摸牌阶段额外摸一张牌。",
  fulin: "腹鳞",
  fulin_info: "锁定技，你于回合内获得的牌不计入你本回合的手牌上限。",
  kuangbi: "匡弼",
  kuangbi_info:
    "出牌阶段限一次，你可以选择一名有牌的其他角色，该角色将其的一至三张牌置于你的武将牌上。若如此做，你的下个准备阶段，你获得武将牌上的所有牌，然后其摸等量的牌。",
  xinzhige: "止戈",
  xinzhige_info:
    "出牌阶段限一次，你可以令一名攻击范围内含有你的其他角色交给你一张【杀】或武器牌，否则其视为对你指定的另一名其攻击范围内的角色使用了一张【杀】。",
  zhige: "止戈",
  zhige_info:
    "出牌阶段限一次，若你的手牌数大于你的体力值，你可以选择攻击范围内含有你的一名其他角色，除非该角色使用一张【杀】，否则其将其装备区里的一张牌交给你",
  xinzongzuo: "宗祚",
  xinzongzuo_info:
    "锁定技，游戏的第一个回合开始前，你加X点体力上限并回复X点体力（X为全场势力数）；当一名角色死亡后，若没有与其势力相同的角色，你减1点体力上限并摸两张牌。",
  zongzuo: "宗祚",
  zongzuo_info:
    "锁定技，游戏的第一个回合开始前，你加X点体力上限并回复X点体力（X为全场势力数）；当一名角色死亡后，若没有与其势力相同的角色，你减1点体力上限。",
  xinjuece: "绝策",
  xinjuece_info: "结束阶段，你可以对一名没有手牌的角色造成1点伤害。",
  xinmieji: "灭计",
  xinmieji_info:
    "出牌阶段限一次，你可以展示一张黑色锦囊牌并将之置于牌堆顶，然后令有手牌的一名其他角色选择一项：弃置一张锦囊牌；或依次弃置两张非锦囊牌。",
  xinfencheng: "焚城",
  xinfencheng_info:
    "限定技。出牌阶段，你可以令所有其他角色各选择一项：弃置至少X张牌(X为该角色的上家以此法弃置牌的数量+1)；或受到你对其造成的2点火焰伤害。",
  qianju: "千驹",
  qianju_info:
    "锁定技，若你已受伤，你计算与其他角色的距离时-X（X为你已损失的体力值）。",
  qingxi: "倾袭",
  qingxi_info:
    "当你使用【杀】对目标角色造成伤害时，若你的装备区里有武器牌，你可以令其选择一项：1、弃置X张手牌（X为此武器牌的攻击范围），若如此做，其弃置你的此武器牌；2、令伤害值+1",
  reqianju: "千驹",
  reqianju_info:
    "锁定技，若你已受伤，你计算与其他角色的距离时-X（X为你已损失的体力值且至少为1）。",
  reqingxi: "倾袭",
  reqingxi_info:
    "当你使用【杀】或【决斗】指定目标后，你可以令其选择一项：1、弃置X张手牌（X为你攻击范围内的角色数，且当你装备区内有武器牌/没有武器牌时至多为4/2），若如此做，其弃置你的此武器牌；2、令此牌的伤害值+1且你进行判定，若结果为红色，则其不能响应此牌。",
  jieyue: "节钺",
  jieyue1: "节钺",
  jieyue2: "节钺",
  jieyue3: "节钺",
  jieyue4: "节钺",
  jieyue_info:
    "结束阶段开始时，你可以弃置一张手牌，然后令一名其他角色选择一项：将一张牌置于你的武将牌上（称之为“节”）；或令你弃置其一张牌。当你你武将牌上有“节”时，你可以将红色手牌当作【闪】、黑色的手牌当作【无懈可击】使用或打出。准备阶段开始时，你获得你武将牌上的“节”。",
  xianzhen: "陷阵",
  xianzhen_info:
    "出牌阶段限一次，你可以与一名角色拼点。若你赢，你获得以下效果直到回合结束：无视与该角色的距离；无视该角色的防具且对其使用【杀】没有次数限制。若你没赢，你不能使用【杀】直到回合结束。",
  xinxianzhen: "陷阵",
  xinxianzhen_info:
    "出牌阶段限一次，你可以与一名角色拼点。若你赢，你获得以下效果直到回合结束：无视该角色的防具且对其使用牌没有次数和距离限制，且当你使用【杀】或普通锦囊牌指定其他角色为唯一目标时可以令该角色也成为此牌的目标。若你没赢，你不能使用【杀】且你的【杀】不计入手牌上限直到回合结束。",
  xinxianzhen2: "陷阵",
  jinjiu: "禁酒",
  jinjiu_info: "锁定技，你的【酒】均视为【杀】。",
  chunlao: "醇醪",
  chunlao2: "醇醪",
  chunlao_info:
    "结束阶段开始时，若你没有“醇”，你可以将至少一张【杀】置于你的武将牌上，称为“醇”。当一名角色处于濒死状态时，你可以移去一张“醇”，视为该角色使用一张【酒】",
  lihuo: "疠火",
  lihuo_info:
    "当你声明使用普通【杀】时，你可以将此【杀】改为火【杀】。若以此法使用的【杀】造成了伤害，则此【杀】结算后你失去1点体力；你使用火【杀】选择目标后，可以额外指定一个目标。",
  shenduan: "慎断",
  shenduan_info:
    "当你的黑色基本牌因弃置而进入弃牌堆后，你可以将其当做【兵粮寸断】使用（无距离限制）。",
  yonglve: "勇略",
  yonglve_info:
    "一名其他角色的判定阶段开始时，若其在你攻击范围内，则你可以弃置其判定区里的一张牌，视为对该角色使用一张【杀】。若此【杀】未造成伤害，你摸一张牌。",
  reshenduan: "慎断",
  reshenduan_info:
    "当你的黑色基本牌或装备牌因弃置而进入弃牌堆后，你可以将其当做【兵粮寸断】使用（无距离限制）。",
  reyonglve: "勇略",
  reyonglve_info:
    "其他角色的判定阶段开始时，你可以弃置其判定区里的一张牌。然后若该角色在你攻击范围内，你摸一张牌。若其在你攻击范围外，视为你对其使用一张【杀】。",
  benxi: "奔袭",
  benxi_info:
    "锁定技，你的回合内，你每使用一次牌后，你的进攻距离+1直到回合结束；你的回合内，若你与所有角色的距离均为1，你无视其他角色的防具，且你使用的【杀】可额外指定一个目标",
  xinbenxi: "奔袭",
  xinbenxi_info:
    "锁定技，当你于回合内使用牌时，你本回合计算与其他角色的距离-1。你的回合内，若你至场上所有其他角色的距离均不大于1，则当你使用【杀】或普通锦囊牌选择唯一目标后，你选择至多两项：1.为此牌多指定一个目标；2.令此牌无视防具；3.令此牌不可被抵消；4.此牌造成伤害时摸一张牌。",
  sidi: "司敌",
  sidi2: "司敌",
  sidi3: "司敌",
  sidi_info:
    "当你使用或其他角色在你的回合内使用【闪】时，你可以将牌堆顶的一张牌正面向上置于你的武将牌上；一名其他角色的出牌阶段开始时，你可以移去一张“司敌”牌，然后该角色本阶段可使用杀的次数上限-1",
  xinsidi: "司敌",
  xinsidi2: "司敌",
  xinsidi_info:
    "其他角色出牌阶段开始时，你可以弃置一张与你装备区里的牌颜色相同的非基本牌，然后该角色于此阶段内不能使用和打出与此牌颜色相同的牌。此阶段结束时，若其此阶段没有使用【杀】，视为你对其使用了【杀】",
  dangxian: "当先",
  dangxian_info: "锁定技，准备阶段，你执行一个额外的出牌阶段",
  xindangxian: "当先",
  xindangxian_info:
    "锁定技，准备阶段，你执行一个额外的出牌阶段。此阶段开始时，你失去1点体力并从牌堆/弃牌堆中获得一张【杀】（若你已发动过〖伏枥〗，则可以不发动此效果）。",
  longyin: "龙吟",
  longyin_info:
    "当一名角色于其出牌阶段使用【杀】时，你可弃置一张牌令此【杀】不计入出牌阶段使用次数，若此【杀】为红色，你摸一张牌。",
  zhongyong: "忠勇",
  zhongyong_info:
    "当你于出牌阶段内使用的【杀】被目标角色使用的【闪】抵消时，你可以将此【闪】交给除该角色外的一名角色。若获得此【闪】的角色不是你，你可以对相同的目标再使用一张【杀】。",
  xinzhongyong: "忠勇",
  xinzhongyong_info:
    "当你使用的【杀】结算完毕后，你可以将此【杀】或目标角色使用的【闪】交给一名该角色以外的其他角色，以此法获得红色牌的角色可以对你攻击范围内的角色使用一张【杀】",
  jigong: "急攻",
  jigong_info:
    "出牌阶段开始时，你可以摸两张牌。若如此做，你本回合的手牌上限改为X（X为你此阶段造成的伤害点数之和）。",
  shifei: "饰非",
  shifei_info:
    "当你需要使用或打出【闪】时，你可以令当前回合角色摸一张牌。然后若其手牌数不为全场唯一最多，则你弃置全场手牌数最多（或之一）角色的一张牌，视为你使用或打出了一张【闪】。",
  huaiyi: "怀异",
  huaiyi_info:
    "出牌阶段限一次，你可以展示所有手牌，若这些牌的颜色不全部相同，则你选择一种颜色并弃置该颜色的所有手牌，然后你可以获得至多X名角色的各一张牌（X为你以此法弃置的手牌数）。若你以此法获得的牌不少于两张，则你失去1点体力。",
  yaoming: "邀名",
  yaoming_info:
    "每回合限一次，当你造成或受到伤害后，你可以选择一项：1. 弃置手牌数大于你的一名角色的一张手牌；2. 令手牌数小于你的一名角色摸一张牌",
  xinyaoming: "邀名",
  xinyaoming_info:
    "每回合每个选项限一次，当你造成或受到伤害后，你可以选择一项：1. 弃置手牌数大于你的一名角色的一张手牌；2. 令手牌数小于你的一名角色摸一张牌；3.令手牌数等于你的角色弃置至多两张牌，然后摸等量的牌。",
  anguo: "安国",
  anguo_info:
    "出牌阶段限一次，你可以选择一名其他角色装备区里的一张牌，令其将此牌收回手牌。然后若该角色攻击范围内的角色数因此减少，则你摸一张牌。",
  yanzhu: "宴诛",
  yanzhu_info:
    "出牌阶段限一次，你可以令一名有牌的其他角色选择一项：令你获得其装备区里所有的牌，然后你失去技能〖宴诛〗；或弃置一张牌",
  xingxue: "兴学",
  xingxue_info:
    "结束阶段开始时，你可以令至多X名角色依次摸一张牌并将一张牌置于牌堆顶（X为你的体力值，若你已失去技能〖宴诛〗，则将X改为你的体力上限）。",
  zhaofu: "诏缚",
  zhaofu_info:
    "主公技，锁定技，你距离为1的角色视为在其他吴势力角色的攻击范围内。",
  reyanzhu: "宴诛",
  reyanzhu2: "宴诛",
  reyanzhu_info:
    "出牌阶段限一次，你可以令一名其他角色选择一项：将装备区里的所有牌交给你并令你修改〖宴诛〗和〖兴学〗，或弃置一张牌并令下一次受到的伤害+1直到其下回合开始。",
  reyanzhu_rewrite: "宴诛·改",
  reyanzhu_rewrite_info:
    "出牌阶段限一次，你可以选择一名其他角色。该角色下一次受到的伤害+1直到其下回合开始。",
  rexingxue: "兴学",
  rexingxue_info:
    "结束阶段开始时，你可以令至多X名角色各摸一张牌。然后若有手牌数大于体力值的目标角色，则这些角色各将一张牌置于牌堆顶。（X为你的体力值）。",
  rexingxue_rewrite: "兴学·改",
  rexingxue_rewrite_info:
    "结束阶段开始时，你可以令至多X名角色各摸一张牌。然后若有手牌数大于体力值的目标角色，则这些角色各将一张牌置于牌堆顶。（X为你的体力上限）。",
  rezhaofu: "诏缚",
  rezhaofu_info:
    "主公技，锁定技，你攻击范围内的角色视为在其他吴势力角色的攻击范围内。",
  wurong: "怃戎",
  wurong_info:
    "出牌阶段限一次，你可以令一名其他角色与你同时展示一张手牌：若你展示的是【杀】且该角色展示的不是【闪】，则你弃置此【杀】并对其造成1点伤害；若你展示的不是【杀】且该角色展示的是【闪】，则你弃置你展示的牌并获得其一张牌",
  shizhi: "矢志",
  shizhi_info: "锁定技，当你的体力值为1时，你的【闪】均视为【杀】",
  zhanjue: "战绝",
  zhanjue_info:
    "出牌阶段，你可以将所有手牌当作【决斗】使用。此【决斗】结算后，你与以此法受到伤害的角色各摸一张牌。若你在同一阶段内以此法摸了两张或更多的牌，则此技能失效直到回合结束",
  qinwang: "勤王",
  qinwang1: "勤王",
  qinwang2: "勤王",
  qinwang_info:
    "主公技，当你需要使用或打出一张【杀】时，你可以弃置一张牌，然后视为你发动了〖激将①〗。若有角色响应，则该角色打出【杀】时摸一张牌。",
  huomo: "活墨",
  huomo_info:
    "当你需要使用一张本回合内未使用过的基本牌时，你可以将一张黑色非基本牌置于牌堆顶，视为使用此基本牌。",
  zuoding: "佐定",
  zuoding_info:
    "当其他角色于其回合内使用♠牌指定目标后，若本回合内没有角色受到过伤害，则你可以令其中一名目标角色摸一张牌",
  taoxi: "讨袭",
  taoxi2: "讨袭",
  taoxi3: "讨袭",
  taoxi_info:
    "出牌阶段限一次，当你使用牌指定一名其他角色为唯一目标后，你可以亮出其一张手牌直到回合结束，并且你可以于此回合内将此牌如手牌般使用。结束阶段，若该角色未失去此手牌，则你失去1点体力",
  huituo: "恢拓",
  huituo_info:
    "当你受到伤害后，你可以令一名角色进行一次判定，若结果为红色，该角色回复1点体力；若结果为黑色，该角色摸X张牌（X为此次伤害的伤害点数）",
  mingjian: "明鉴",
  mingjian2: "明鉴",
  mingjian_info:
    "出牌阶段限一次，你可以将所有手牌交给一名其他角色，若如此做，该角色于其下个回合的手牌上限+1，且使用【杀】的次数上限+1",
  xingshuai: "兴衰",
  xingshuai_info:
    "主公技，限定技，当你进入濒死状态时，其他魏势力角色可依次令你回复1点体力，然后这些角色依次受到1点伤害。",
  reduodao: "夺刀",
  reduodao_info:
    "当你成为【杀】的目标后，你可以弃置一张牌。然后你获得此【杀】使用者装备区里的武器牌。",
  reanjian: "暗箭",
  reanjian_info:
    "锁定技，当你使用【杀】指定目标后，若你不在其攻击范围内，则此杀伤害+1且无视其防具。若其因执行此【杀】的效果受到伤害而进入濒死状态，则其不能使用【桃】直到此濒死事件结算结束。",
  duodao: "夺刀",
  duodao_info:
    "当你受到【杀】造成的伤害后，你可以弃置一张牌，然后获得伤害来源装备区里的武器牌",
  anjian: "暗箭",
  anjian_info:
    "锁定技，当你使用【杀】对目标角色造成伤害时，若你不在其攻击范围内，则此杀伤害+1。",
  xinpojun: "破军",
  xinpojun2: "破军",
  xinpojun_info:
    "当你于出牌阶段内使用【杀】指定一个目标后，你可以将其至多X张牌扣置于该角色的武将牌旁（X为其体力值）。若如此做，当前回合结束后，该角色获得其武将牌旁的所有牌。",

  qiaoshi: "樵拾",
  qiaoshi_info:
    "其他角色的结束阶段开始时，若你的手牌数与其相等，则你可以与其各摸一张牌。",
  yanyu: "燕语",
  yanyu2: "燕语",
  yanyu_info:
    "出牌阶段，你可以重铸【杀】。出牌阶段结束时，若你于此阶段以此法重铸了至少两张【杀】，则你可以令一名男性角色摸两张牌。",

  zzhenggong: "争功",
  zzhenggong_info:
    "你每受到一次伤害，可以获得伤害来源装备区中的一张牌并立即放入你的装备区。",
  zquanji: "权计",
  zquanji_info:
    "其他角色的回合即将开始时，你可以与该角色进行一次拼点。若你赢，该角色跳过准备阶段及判定阶段。",
  zbaijiang: "拜将",
  zbaijiang_info:
    "觉醒技，准备阶段若你的装备区的装备牌为两张或更多时，你必须增加1点体力上限，失去技能〖权计〗和〖争功〗并获得技能〖野心〗和〖自立〗。",
  zyexin: "野心",
  zyexin2: "野心",
  zyexin_info:
    "当你造成或受到伤害后，你可以将牌堆顶的一张牌置于你的武将牌上，称为“权”。出牌阶段限一次，你可以用任意数量的手牌与等量的“权”交换。",
  zzili: "自立",
  zzili_info:
    "觉醒技，准备阶段，若你的“权”为四张或更多，你减1点体力上限，并获得技能〖排异〗。",
  zpaiyi: "排异",
  zpaiyi_info:
    "结束阶段，你可以将一张“权”移动到一个合理的区域。若不是你的区域，你可以摸一张牌",
  shibei: "矢北",
  shibei_info:
    "锁定技，当你受到伤害后：若此伤害是你本回合第一次受到的伤害，则你回复1点体力；否则你失去1点体力。",
  jianying: "渐营",
  jianying_info:
    "当你于出牌阶段内使用与此阶段你使用的上一张牌点数或花色相同的牌时，你可以摸一张牌。",
  xinenyuan: "恩怨",
  xinenyuan2: "恩怨",
  xinenyuan_info:
    "当你获得一名其他角色两张或更多的牌后，你可以令其摸一张牌；当你受到1点伤害后，你可以令伤害来源选择一项：1、将一张手牌交给你；2、失去1点体力。",
  xinxuanhuo: "眩惑",
  xinxuanhuo_info:
    "摸牌阶段开始时，你可以改为令一名其他角色摸两张牌，然后该角色需对其攻击范围内你选择的另一名角色使用一张【杀】，否则你获得其两张牌。",
  fuhun: "父魂",
  fuhun2: "父魂",
  fuhun_info:
    "你可以将两张手牌当做【杀】使用或打出；出牌阶段，若你以此法使用的【杀】造成了伤害，你获得技能〖武圣〗和〖咆哮〗直到回合结束。",
  yuce: "御策",
  yuce_info:
    "当你受到伤害后，你可以展示一张手牌，并令伤害来源选择一项：弃置一张与此牌类型不同的手牌，或令你回复一点体力。",
  xiansi: "陷嗣",
  xiansix: "陷嗣",
  xiansi_bg: "逆",
  xiansi2: "陷嗣",
  xiansi_info:
    "准备阶段开始时，你可以将一至两名角色的各一张牌置于你的武将牌上，称为“逆”；当一名角色需要对你使用【杀】时，其可以移去两张“逆”，然后视为对你使用了一张【杀】。",
  chanhui: "谮毁",
  chanhui_info:
    "出牌阶段限一次，当你使用【杀】或黑色普通锦囊牌指定唯一目标时，你可令可以成为此牌目标的另一名其他角色选择一项：交给你一张牌并成为此牌的使用者；或成为此牌的额外目标。",
  rechanhui: "谮毁",
  rechanhui_info:
    "当你使用【杀】或普通锦囊牌指定唯一目标时，你可令可以成为此牌目标（无距离限制）的另一名其他角色选择一项：交给你一张牌并成为此牌的使用者；或成为此牌的额外目标且你本回合内不能再次发动〖谮毁〗。",
  jiaojin: "骄矜",
  jiaojin_info:
    "当你受到男性角色造成的伤害时，你可以弃置一张装备牌，令此伤害-1。",
  rejiaojin: "骄矜",
  rejiaojin_info:
    "当你成为其他角色使用【杀】或普通锦囊牌的目标后，你可以弃置一张装备牌，令此牌对你无效并获得此牌对应的所有实体牌。若此牌的使用者为女性角色，则你令〖骄矜〗失效直到回合结束。",
  shenxing: "慎行",
  shenxing_info: "出牌阶段，你可以弃置两张牌，然后摸一张牌。",
  bingyi: "秉壹",
  bingyi_info:
    "结束阶段开始时，你可以展示所有手牌，若这些牌颜色均相同，则你令至多X名角色各摸一张牌(X为你的手牌数)。",
  qiangzhi: "强识",
  qiangzhi_draw: "强识",
  qiangzhi_info:
    "出牌阶段开始时，你可以展示一名其他角色的一张手牌。若如此做，当你于此阶段内使用与此牌类别相同的牌时，你可以摸一张牌。",
  xiantu: "献图",
  xiantu2: "献图",
  xiantu3: "献图",
  xiantu_info:
    "一名其他角色的出牌阶段开始时，你可以摸两张牌，然后交给其两张牌。若如此做，此阶段结束时，若该角色未于此阶段内杀死过角色，则你失去1点体力。",
  dingpin: "定品",
  dingpin_info:
    "出牌阶段，你可以弃置一张手牌，然后令一名已受伤的角色进行一次判定，若结果为黑色，该角色摸X张牌(X为该角色已损失的体力值)，然后你本回合不能再对其发动〖定品〗；若结果为红色，将你的武将牌翻面。（你不能弃置本回合已弃置或使用过的类型的牌）",
  faen: "法恩",
  faen_info: "当一名角色翻至正面或横置后，你可以令其摸一张牌。",
  jyzongshi: "纵适",
  jyzongshi_info:
    "当你拼点赢时，你可以获得对方此次拼点的牌；当你拼点没赢时，你可以收回你此次拼点的牌。",
  qiaoshui: "巧说",
  qiaoshui_info:
    "出牌阶段开始时，你可与一名其他角色拼点。若你赢，你使用的下一张基本牌或普通锦囊牌可以额外指定任意一名其他角色为目标或减少指定一个目标；若你没赢，你不能使用锦囊牌直到回合结束",
  reqiaoshui: "巧说",
  reqiaoshui_info:
    "出牌阶段，你可与一名其他角色拼点。若你赢，你使用的下一张基本牌或普通锦囊牌可以额外指定任意一名其他角色为目标或减少指定一个目标；若你没赢，你结束出牌阶段且本回合内锦囊牌不计入手牌上限。",
  junxing: "峻刑",
  junxing_info:
    "出牌阶段限一次，你可以弃置至少一张手牌并选择一名其他角色，该角色需弃置一张与你弃置的牌类别均不同的手牌，否则其先将其武将牌翻面再摸X张牌（X为你以此法弃置的手牌数量）。",
  xinjunxing: "峻刑",
  xinjunxing_info:
    "出牌阶段限一次，你可以弃置至少一张手牌并选择一名其他角色，该角色需弃置一张与你弃置的牌类别均不同的手牌，否则其先将其武将牌翻面，然后将手牌摸至四张。",

  xswuyan: "无言",
  xinwuyan: "无言",
  jujian: "举荐",
  xinjujian: "举荐",
  luoying: "落英",
  luoying_discard: "落英",
  luoying_judge: "落英",
  luoying_judge_noconf: "落英·判定",
  jiushi: "酒诗",
  jiushi1: "酒诗",
  jiushi2: "酒诗",
  jiushi3: "酒诗",
  jueqing: "绝情",
  shangshi: "伤逝",
  xuanfeng: "旋风",
  zhiyu: "智愚",
  qice: "奇策",
  qice_backup: "奇策",
  jiangchi: "将驰",
  jiangchi_less: "少摸一张",
  jiangchi_more: "多摸一张",
  zishou: "自守",
  zongshi: "宗室",
  danshou: "胆守",
  olddanshou: "胆守",
  xindanshou: "胆守",
  yizhong: "毅重",
  xinzhan: "心战",
  xinzhan_gain: "获得",
  xinzhan_place: "牌堆顶",
  huilei: "挥泪",
  enyuan: "恩怨",
  enyuan1: "恩怨",
  enyuan2: "恩怨",
  xuanhuo: "眩惑",
  ganlu: "甘露",
  buyi: "补益",
  mingce: "明策",
  zhichi: "智迟",
  zhichi2: "智迟",
  pojun: "破军",
  jingce: "精策",
  xinjingce: "精策",
  chengxiang: "称象",
  oldchengxiang: "称象",
  renxin: "仁心",
  oldrenxin: "仁心",
  zhenlie: "贞烈",
  miji: "秘计",
  zhiyan: "直言",
  zongxuan: "纵玄",
  anxu: "安恤",
  old_anxu: "安恤",
  zhuiyi: "追忆",
  gongji: "弓骑",
  qiuyuan: "求援",
  oldqiuyuan: "求援",
  zhuikong: "惴恐",
  oldzhuikong: "惴恐",
  qieting: "窃听",
  xianzhou: "献州",
  quanji: "权计",
  zili: "自立",
  paiyi: "排异",
  paiyi_backup: "排异",
  sanyao: "散谣",
  olsanyao: "散谣",
  olsanyao_backup: "散谣",
  zhiman: "制蛮",
  resanyao: "散谣",
  rezhiman: "制蛮",
  qianxi: "潜袭",
  qianxi2: "潜袭",
  qianxi2_bg: "袭",
  fuli: "伏枥",
  xinfuli: "伏枥",
  jiefan: "解烦",
  juece: "绝策",
  mieji: "灭计",
  fencheng: "焚城",
  youdi: "诱敌",
  youdi_info:
    "结束阶段开始时，你可以令一名其他角色弃置你的一张牌，若此牌不为【杀】，你获得该角色的一张牌。",
  fencheng_info:
    "限定技。出牌阶段，你可令所有其他角色依次选择一项：弃置X张牌；或受到1点火焰伤害。(X为该角色装备区里牌的数量且至少为1)",
  mieji_info:
    "当你使用黑色普通锦囊牌选择目标后，若目标数为1，则你可以额外指定一个目标。",
  juece_info:
    "当其他角色在你回合内失去最后一张手牌时，你可以对其造成一点伤害。",
  jiefan_info:
    "限定技，出牌阶段，你可以选择一名角色，令攻击范围内含有该角色的所有角色依次选择一项：1.弃置一张武器牌；2.令其摸一张牌。",
  fuli_info:
    "限定技，当你处于濒死状态时，你可以将体力回复至与场上势力数相同，然后翻面",
  xinfuli_info:
    "限定技，当你处于濒死状态时，可以将体力回复至X点并将手牌摸至X张（X为场上势力数）。若X大于2，你翻面。",
  qianxi_info:
    "准备阶段，你可以摸一张牌，并弃置一张牌，然后令一名距离为1的角色不能使用或打出与你弃置的牌颜色相同的手牌直到回合结束。",
  zhiman_info:
    "当你对一名其他角色造成伤害时，你可以防止此伤害，然后获得其装备区或判定区的一张牌。",
  sanyao_info:
    "出牌阶段限一次，你可以弃置一张牌并指定一名体力值最多(或之一)的角色，你对其造成1点伤害。",
  olsanyao_info:
    "出牌阶段每项各限一次，你可以弃置一张牌并指定一名体力值或手牌数最多(或之一)的角色，并对其造成1点伤害。",
  rezhiman_info:
    "当你对一名其他角色造成伤害时，你可以防止此伤害，然后获得其区域内的一张牌。",
  resanyao_info:
    "出牌阶段限一次，你可以弃置任意张牌并指定等量除你外体力值最多(或之一)的其他角色。你对这些角色依次造成1点伤害。",
  paiyi_info:
    "出牌阶段限一次，你可以移去一张“权”并选择一名角色，令其摸两张牌，然后若其手牌数大于你，你对其造成1伤害。",
  zili_info:
    "觉醒技，准备阶段开始时，若“权”的数量不小于3，你减1点体力上限，然后选择一项：1、回复1点体力；2、摸两张牌。然后你获得技能“排异”。",
  quanji_info:
    "当你受到1点伤害后，你可以摸一张牌，然后将一张手牌置于武将牌上，称为“权”；你的手牌上限+X（X为“权”的数量）。",
  xianzhou_info:
    "限定技。出牌阶段，你可以将装备区内的所有牌交给一名其他角色，然后该角色选择一项：令你回复X点体力；或对其攻击范围内的X名角色各造成1点伤害(X为你以此法交给该角色的牌的数量)。",
  qieting_info:
    "其他角色的结束阶段，若其未于此回合内使用过指定其他角色为目标的牌，你可以选择一项：将其装备区里的一张牌移动至你装备区里的相应位置；或摸一张牌。",
  zhuikong_info:
    "其他角色的准备阶段，若你已受伤，你可以与该角色拼点。若你赢，该角色本回合使用的牌不能指定除该角色外的角色为目标。若你没赢，其本回合至你的距离视为1。",
  oldzhuikong_info:
    "其他角色的准备阶段，若你已受伤，你可以与该角色拼点。若你赢，该角色跳过本回合的出牌阶段。若你没赢，其本回合至你的距离视为1。",
  qiuyuan_info:
    "当你成为【杀】的目标时，你可以令一名其他角色选择一项：①、交给你一张【闪】；②、成为此【杀】的额外目标。",
  oldqiuyuan_info:
    "当你成为【杀】的目标时，你可以令一名有手牌的其他角色正面朝上交给你一张牌。若此牌不为【闪】，则该角色也成为此【杀】的额外目标。",
  gongji_info:
    "出牌阶段限一次，你可以弃置一张牌，然后你的攻击范围视为无限直到回合结束。若你以此法弃置的牌为装备牌，则你可以弃置一名其他角色的一张牌。",
  zhuiyi_info:
    "当你死亡时，你可以令一名其他角色（杀死你的角色除外）摸三张牌，然后其回复1点体力。",
  anxu_info:
    "出牌阶段限一次，你可以选择两名手牌数不同的其他角色，令其中手牌多的角色将一张手牌交给手牌少的角色，然后若这两名角色手牌数相等，你摸一张牌或回复1点体力",
  old_anxu_info:
    "出牌阶段限一次，你可以选择两名手牌数不同的其他角色，令其中手牌少的角色获得手牌多的角色的一张手牌并展示之。然后若此牌不为黑桃，则你摸一张牌。",
  zongxuan_info: "当你的牌因弃置而进入弃牌堆后，你可以将其按任意顺序置于牌堆顶",
  zhiyan_info:
    "结束阶段，你可以令一名角色摸一张牌并展示之，若为装备牌，其使用此牌并回复一点体力。",
  miji_info:
    "结束阶段，若你已受伤，则可以摸X张牌，然后可以将等量的牌交给一名其他角色（X为你已损失的体力值）。",
  zhenlie_info:
    "当你成为其他角色使用【杀】或普通锦囊牌的目标后，你可以失去一点体力并令此牌对你无效，然后弃置对方一张牌。",
  chengxiang_info:
    "当你受到伤害后，你可以亮出牌堆顶的四张牌。然后获得其中任意数量点数之和不大于13的牌",
  oldchengxiang_info:
    "当你受到伤害后，你可以亮出牌堆顶的四张牌。然后获得其中任意数量点数之和不大于12的牌",
  renxin_info:
    "当体力值为1的一名其他角色受到伤害时，你可以将武将牌翻面并弃置一张装备牌，然后防止此伤害。",
  oldrenxin_info:
    "其他角色进入濒死状态时，你可以将所有手牌交给该角色并翻面，然后该角色回复1点体力。",
  jingce_info:
    "出牌阶段结束时，若你本回合使用的牌数量大于或等于你的当前体力值，你可以摸两张牌。",
  xinjingce_info:
    "结束阶段，若你本回合使用的牌数量大于或等于你的当前体力值，你可以摸两张牌。",
  xswuyan_info:
    "锁定技，你使用的普通锦囊牌对其他角色无效；其他角色使用的普通锦囊牌对你无效。",
  xinwuyan_info:
    "锁定技，当你使用锦囊牌造成伤害时，你防止此伤害；锁定技，当你受到锦囊牌对你造成的伤害时，你防止此伤害。",
  jujian_info:
    "出牌阶段限一次，你可以弃至多三张牌，然后令一名其他角色摸等量的牌。若你以此法弃牌不少于三张且均为同一类别，你回复1点体力。",
  xinjujian_info:
    "结束阶段开始时，你可以弃置一张非基本牌并选择一名其他角色，令其选择一项：1.摸两张牌；2.回复1点体力；3.将其武将牌翻转至正面朝上并重置之。",
  luoying_info: "当其他角色的梅花牌因弃置或判定而进入弃牌堆后，你可以获得之。",
  jiushi_info:
    "当你需要使用一张【酒】时，若你的武将牌正面朝上，则你可以将武将牌翻面并视为使用了一张【酒】；当你受到伤害时，若你的武将牌背面朝上，则你可在此伤害结算后将武将牌翻回正面。",
  jueqing_info: "锁定技，你即将造成的伤害均视为失去体力。",
  shangshi_info:
    "当你的手牌数小于X时，你可以将手牌摸至X张（X为你已损失的体力值）",
  xuanfeng_info:
    "当你失去装备区内的牌时，或于弃牌阶段弃置了两张或更多的手牌后，你可以依次弃置一至两名其他角色的共计两张牌。",
  zhiyu_info:
    "当你受到伤害后，你可以摸一张牌，然后展示所有手牌。若颜色均相同，你令伤害来源弃置一张手牌。",
  qice_info:
    "出牌阶段限一次，你可以将所有的手牌（至少一张）当做任意一张普通锦囊牌使用。",
  jiangchi_info:
    "摸牌阶段摸牌时，你可以选择一项：1、额外摸一张牌，若如此做，你不能使用或打出【杀】直到回合结束。 2、少摸一张牌，若如此做，你使用【杀】无距离限制且可以多使用一张【杀】直到回合结束。",
  zishou_info:
    "摸牌阶段，你可以额外摸X张牌（X为场上现存势力数）。若如此做，你于本回合出牌阶段内使用的牌不能指定其他角色为目标。",
  zongshi_info: "锁定技，你的手牌上限+X（X为场上现存势力数）。",
  danshou_info:
    "出牌阶段，你可以选择你攻击范围内的一名其他角色，然后弃置X张牌（X为此前你于此阶段你发动“胆守”的次数+1）。若X：为1，你弃置该角色的一张牌；为2，令该角色交给你一张牌；为3，你对该角色造成1点伤害；不小于4，你与该角色各摸两张牌。",
  olddanshou_info:
    "当你造成伤害后，你可以摸一张牌。若如此做，终止一切结算，当前回合结束。",
  xindanshou_info:
    "①每回合限一次，当你成为基本牌或锦囊牌的目标后，你可以摸X张牌（X为你本回合内成为过基本牌或锦囊牌的目标的次数）。②一名其他角色的结束阶段，若你本回合内没有发动过〖胆守①〗，则你可以弃置X张牌并对其造成1点伤害（X为其手牌数，无牌则不弃）。",
  yizhong_info: "锁定技，当你的防具栏为空时，黑色的杀对你无效",
  xinzhan_info:
    "出牌阶段限一次，你可以观看牌堆顶的3张牌，然后展示其中任意数量♥的牌并获得之。",
  huilei_info: "锁定技，当你死亡时，杀死你的角色弃置所有的牌。",
  enyuan_info:
    "锁定技，当有其他角色令你回复一点体力后，该角色摸一张牌；其他角色对你造成伤害后，须交给你一张♥手牌，否则该角色失去1点体力。",
  xuanhuo_info:
    "出牌阶段限一次，你可以将一张红桃手牌交给一名其他角色，获得该角色的一张牌，然后交给除该角色外的一名其他角色",
  ganlu_info:
    "出牌阶段限一次，你可以选择两名装备区内装备数之差不大于X的角色，令其交换装备区内的牌（X为你已损失的体力值）。",
  buyi_info:
    "当有角色进入濒死状态时，你可以展示该角色的一张手牌：若此牌不为基本牌，则该角色弃置此牌并回复1点体力。",
  mingce_info:
    "出牌阶段，你可以交给一名其他角色一张装备牌或【杀】，然后令该角色选择一项：1. 视为对其攻击范围内的另一名由你指定的角色使用一张【杀】。2. 摸一张牌。每回合限一次。",
  zhichi_info:
    "锁定技，当你于回合外受到伤害后，所有【杀】或普通锦囊牌对你无效直到回合结束。",
  zhichi2_info: "智迟已发动",
  pojun_info:
    "当你使用【杀】造成伤害后，你可以令受到该伤害的角色摸X张牌（X为该角色当前的体力值且最多为5），然后该角色将其武将牌翻面。",
  shiyong: "恃勇",
  shiyong_info:
    "锁定技，当你受到一次红色【杀】或【酒】【杀】造成的伤害后，须减1点体力上限",
  old_guanzhang: "关兴张苞",
  old_wangyi: "王异",
  oldqianxi: "潜袭",
  oldqianxi_info:
    "当你使用【杀】对距离为1的目标角色造成伤害时，你可以进行一次判定，若判定结果不为红桃，你防止此伤害，令其减1点体力上限",
  oldzhenlie: "贞烈",
  oldzhenlie_info: "在你的判定牌生效前，你可以亮出牌堆顶的一张牌代替之",
  oldmiji: "秘计",
  oldmiji_info:
    "准备/结束阶段开始时，若你已受伤，你可以判定，若判定结果为黑色，你观看牌堆顶的X张牌（X为你已损失的体力值），然后将这些牌交给一名角色",
  old_fuhun: "父魂",
  old_fuhun_info:
    "摸牌阶段开始时，你可以放弃摸牌，改为从牌堆顶亮出两张牌并获得之，若亮出的牌颜色不同，你获得技能“武圣”、“咆哮”，直到回合结束。",
  rejueqing: "绝情",
  rejueqing_info:
    "当你对其他角色造成伤害时，你可以令此伤害值+X。若如此做，你失去X点体力并修改〖绝情〗（X为伤害值）。",
  rejueqing_1st: "绝情",
  rejueqing_rewrite: "绝情·改",
  rejueqing_rewrite_info: "锁定技，你即将造成的伤害均视为失去体力。",
  reshangshi: "伤逝",
  reshangshi_2nd: "伤逝",
  reshangshi_info:
    "当你受到伤害时，你可以弃置一张牌。当你的手牌数小于X时，你可以将手牌摸至X张。（X为你已损失的体力值）",
  rejingce: "精策",
  rejingce2: "精策",
  rejingce_add: "精策",
  rejingce_info:
    "当你于一回合内首次使用某种花色的手牌时，你的手牌上限+1。出牌阶段结束时，你可以摸X张牌（X为你本阶段内使用过的牌的类型数）。",
  xinkuangbi: "匡弼",
  xinkuangbi_info:
    "出牌阶段限一次。你可以令一名其他角色交给你至多三张牌（不计入你本回合的手牌上限）。然后其于其的下回合开始时摸等量的牌。",
  xinzhaofu: "诏缚",
  xinzhaofu_info:
    "主公技，限定技。出牌阶段，你可选择至多两名其他角色。这两名角色视为在所有其他吴势力角色的攻击范围内。",
  olbingyi: "秉壹",
  olbingyi_info:
    "每阶段限一次。当你因弃置而失去牌后，你可以展示所有手牌。若这些牌的颜色均相同，则你可以与至多X名其他角色各摸一张牌（X为你的手牌数）。",
  lukai: "陆凯",
  lukai_spade: "♠",
  lukai_spade_bg: "♠️",
  lukai_heart: "♥",
  lukai_heart_bg: "♥️",
  lukai_club: "♣",
  lukai_club_bg: "♣",
  lukai_diamond: "♦",
  lukai_diamond_bg: "♦️️",
  lkbushi: "卜筮",
  lkbushi_info:
    "①你使用♠牌无次数限制。②当你使用或打出♥牌后，你摸一张牌。③当你成为♣牌的目标后，你可以弃置一张牌，令此牌对你无效。④结束阶段开始时，你从牌堆或弃牌堆获得一张♦牌。⑤准备阶段开始时，你可调整此技能中四种花色的对应顺序。",
  lkzhongzhuang: "忠壮",
  lkzhongzhuang_info:
    "锁定技。当你因执行【杀】的效果而造成伤害时，若你的攻击范围：大于3，则此伤害+1；小于3，则此伤害改为1。",

  yijiang_2011: "一将成名2011",
  yijiang_2012: "一将成名2012",
  yijiang_2013: "一将成名2013",
  yijiang_2014: "一将成名2014",
  yijiang_2015: "一将成名2015",
  yijiang_2016: "原创设计2016",
  yijiang_2017: "原创设计2017",
  yijiang_2022: "原创设计2022",
};
export const translate_yingbian = {
  jin_zhangchunhua: "晋张春华",
  jin_zhangchunhua_ab: "张春华",
  huishi: "慧识",
  huishi_info:
    "摸牌阶段，你可以放弃摸牌，改为观看牌堆顶的X张牌，获得其中的一半（向下取整），然后将其余牌置入牌堆底。（X为牌堆数量的个位数）",
  qingleng: "清冷",
  qingleng_info:
    "一名角色的回合结束时，若其体力值与手牌数之和不小于X，则你可将一张牌当无距离限制的冰属性【杀】对其使用（X为牌堆数量的个位数）。若你本局游戏内未对其发动过此技能，则你摸一张牌。",
  xuanmu: "宣穆",
  xuanmu2: "宣穆",
  xuanmu_info:
    "锁定技，隐匿技。你于其他角色的回合登场时，防止你受到的伤害直到回合结束。",
  jin_simayi: "晋司马懿",
  jin_simayi_ab: "司马懿",
  zhanghuyuechen: "张虎乐綝",
  xijue: "袭爵",
  xijue_gain: "袭爵",
  xijue_info:
    "锁定技，游戏开始时，你获得4枚“爵”。回合结束时，你获得X枚“爵”（X为你本回合内造成的伤害数）。你可弃置一枚“爵”并在合适的时机发动〖突袭〗和〖骁果〗。",
  xijue_info_guozhan:
    "锁定技，当你首次明置此武将牌时，你获得4枚“爵”。回合结束时，你获得X枚“爵”（X为你本回合内造成的伤害数）。你可弃置一枚“爵”并在合适的时机发动〖突袭〗和〖骁果〗。",
  xijue_tuxi: "突袭",
  xijue_tuxi_info:
    "摸牌阶段摸牌时，你可以少摸任意张牌，然后获得等量的角色的各一张手牌。",
  xijue_tuxi_info_guozhan:
    "摸牌阶段摸牌时，你可以少摸至多两张牌，然后获得等量的角色的各一张手牌。",
  xijue_xiaoguo: "骁果",
  xijue_xiaoguo_info:
    "其他角色的结束阶段开始时，你可以弃置一张基本牌，令该角色选择一项：1.弃置一张装备牌，然后你摸一张牌；2.受到你对其造成的1点伤害。",
  xijue_xiaoguo_info_guozhan:
    "其他角色的结束阶段开始时，你可以弃置一张基本牌，令该角色选择一项：1.弃置一张装备牌；2.受到你对其造成的1点伤害。",
  duyu: "杜预",
  sanchen: "三陈",
  sanchen_info:
    "出牌阶段，你可选择一名本回合内未选择过的角色。其摸三张牌，然后弃置三张牌。若其未以此法弃置牌或以此法弃置的牌的类别均不相同，则其摸一张牌。否则你本阶段内不能再发动〖三陈〗。",
  sanchen_info_guozhan:
    "出牌阶段，你可选择一名本回合内未选择过的角色。其摸三张牌，然后弃置三张牌。若其未以此法弃置牌或以此法弃置的牌的类别均不相同，则其摸一张牌且你获得技能〖破竹〗直到回合结束。否则你本阶段内不能再发动〖三陈〗。",
  zhaotao: "诏讨",
  zhaotao_info:
    "觉醒技，准备阶段，若你本局游戏内发动〖三陈〗的次数大于2，则你减1点体力上限并获得〖破竹〗。",
  pozhu: "破竹",
  pozhu_info:
    "出牌阶段，你可以将一张手牌当做【出其不意】使用。若你未因此牌造成过伤害，则你不能再发动〖破竹〗直到回合结束。",
  pozhu_info_guozhan: "出牌阶段限一次，你可以将一张手牌当做【出其不意】使用。",
  jin_wangyuanji: "晋王元姬",
  jin_wangyuanji_ab: "王元姬",
  shiren: "识人",
  shiren_info:
    "隐匿技。你于其他角色的回合内登场时，若其有手牌，则你可对其发动〖宴戏〗。",
  yanxi: "宴戏",
  yanxi2: "宴戏",
  yanxi_info:
    "出牌阶段，你可选择一名有手牌的角色。你将该角色的一张随机手牌与牌堆顶的两张牌混合后展示，并选择其中一张。若你以此法选择的是该角色的手牌，则你获得这三张牌。否则你获得选择的牌。你通过〖宴戏〗获得的牌，不计入当前回合的手牌上限。",
  yanxi_info_guozhan:
    "出牌阶段，你可选择一名有手牌的角色。你将该角色的一张随机手牌与牌堆中的两张随机牌混合后展示，并选择其中一张。若你以此法选择的是该角色的手牌，则你获得这三张牌。否则你获得选择的牌。你通过〖宴戏〗获得的牌，不计入当前回合的手牌上限。",
  jin_simazhao: "晋司马昭",
  jin_simazhao_ab: "司马昭",
  tuishi: "推弑",
  tuishi_info:
    "隐匿技，你于其他角色A的回合内登场时，可于此回合结束时选择其攻击范围内的一名角色B。A选择一项：①对B使用一张【杀】。②你对A造成1点伤害。",
  choufa: "筹伐",
  choufa2: "筹伐",
  choufa_info:
    "出牌阶段限一次，你可展示一名其他角色的一张手牌并记录其类型A。你令其原类型不为A的手牌的牌名均视为【杀】且均视为无属性，直到其回合结束。",
  xinchoufa: "筹伐",
  xinchoufa_info:
    "出牌阶段限一次，你可展示一名其他角色的一张手牌A。你令其所有类型与A不同的手牌的牌名均视为【杀】且均视为无属性，直到其回合结束。",
  zhaoran: "昭然",
  zhaoran2: "昭然",
  zhaoran_info:
    "出牌阶段开始时，你可令你的手牌对其他角色可见直到出牌阶段结束。若如此做，当你于此阶段内失去一张手牌后，若你的手牌里没有与此牌花色相同的牌且你本回合内未因该花色的牌触发过此效果，则你选择一项：①摸一张牌。②弃置一名其他角色的一张牌。",
  chengwu: "成务",
  chengwu_info:
    "主公技，锁定技，其他晋势力角色攻击范围内的角色视为在你的攻击范围内。",
  jin_xiahouhui: "晋夏侯徽",
  jin_xiahouhui_ab: "夏侯徽",
  baoqie: "宝箧",
  baoqie_info:
    "隐匿技，锁定技。你登场后，从牌堆中获得一张不为赠物的宝物牌。若此牌在你的手牌区内为宝物牌，则你可以使用此牌。",
  jyishi: "宜室",
  jyishi_info:
    "每回合限一次，当有其他角色于其出牌阶段内因弃置而失去手牌后，你可令其获得这些牌中位于弃牌堆的一张，然后你获得其余位于弃牌堆的牌。",
  shiduo: "识度",
  shiduo_info:
    "出牌阶段限一次，你可以与一名其他角色拼点。若你赢，你获得其所有手牌。然后你交给其X张手牌（X为你手牌数的一半，向下取整）。",
  jin_simashi: "晋司马师",
  jin_simashi_ab: "司马师",
  taoyin: "韬隐",
  taoyin2: "韬隐",
  taoyin_info:
    "隐匿技，当你登场后，若当前回合角色存在且不是你，则你可令该角色本回合的手牌上限-2。",
  yimie: "夷灭",
  yimie2: "夷灭",
  yimie_info:
    "每回合限一次，当你对其他角色造成伤害时，若伤害值X小于Y，则你可失去1点体力，将伤害值改为Y。此伤害结算结束后，其回复(Y-X)点体力。（Y为其体力值）’",
  ruilve: "睿略",
  ruilve2: "睿略",
  ruilve_info:
    "主公技，其他晋势力角色的出牌阶段限一次，该角色可以将一张带有伤害标签的基本牌或锦囊牌交给你。",
  tairan: "泰然",
  tairan2: "泰然",
  tairan_info:
    "锁定技，回合结束时，你回复Y点体力，并将手牌摸至X张。出牌阶段开始时，你失去Y点体力，弃置上次以此法获得的牌。（X为你的体力上限；Y=(X-你的体力值)且至多为5）；摸牌至多摸五张",
  gz_jin_simayi: "司马懿",
  gz_jin_zhangchunhua: "张春华",
  gz_jin_simazhao: "司马昭",
  gz_jin_wangyuanji: "王元姬",
  gz_jin_simashi: "司马师",
  gz_jin_xiahouhui: "夏侯徽",
  xinquanbian: "权变",
  xinquanbian_info:
    "出牌阶段，每当你首次使用/打出一种花色的手牌时，你可以从牌堆顶的X张牌中获得一张与此牌花色不同的牌，并将其余牌以任意顺序置于牌堆顶。出牌阶段，你至多可使用X张非装备手牌。（X为你的体力上限）",
  shibao: "石苞",
  zhuosheng: "擢升",
  zhuosheng_info:
    "出牌阶段，①你使用本轮内获得的基本牌时无次数和距离限制。②你使用本轮内获得的普通锦囊牌选择目标后，可令此牌的目标数+1或-1。③你使用本轮内获得的装备牌时可以摸一张牌（以此法获得的牌不能触发〖擢升〗）。",
  zhuosheng_info_guozhan:
    "出牌阶段，①你使用本轮内获得的基本牌时无距离限制。②你使用本轮内获得的普通锦囊牌选择目标后，可令此牌的目标数+1或-1。③你使用本轮内获得的装备牌时可以摸一张牌（以此法获得的牌不能触发〖擢升〗）。",
  jin_yanghuiyu: "晋羊徽瑜",
  jin_yanghuiyu_ab: "羊徽瑜",
  gz_jin_yanghuiyu: "羊徽瑜",
  huirong: "慧容",
  huirong_info:
    "隐匿技，锁定技。当你登场后，你令一名角色将手牌数摸至/弃至与体力值相同（至多摸至五张）。",
  ciwei: "慈威",
  ciwei_info:
    "一名角色于其回合内使用第二张牌时，若此牌为基本牌或普通锦囊牌，则你可以弃置一张牌，取消此牌的所有目标。",
  caiyuan: "才媛",
  caiyuan_info:
    "锁定技，当你扣减体力时，你获得一枚“才媛”标记直到你的下回合结束。结束阶段开始时，若你没有“才媛”标记且此回合不是你的第一个回合 ，则你摸两张牌。",
  simazhou: "司马伷",
  caiwang: "才望",
  caiwang_info:
    "当你使用或打出牌响应其他角色使用的牌，或其他角色使用或打出牌响应你使用的牌后，若这两张牌颜色相同，则你可以弃置对方的一张牌。",
  naxiang: "纳降",
  naxiang2: "纳降",
  naxiang_info:
    "锁定技，当你受到其他角色造成的伤害后，或你对其他角色造成伤害后，你对其发动〖才望①〗时的“弃置”改为“获得”直到你的下回合开始。",
  cheliji: "彻里吉",
  chexuan: "车悬",
  chexuan_info:
    "出牌阶段，若你的装备区里没有宝物牌，你可弃置一张黑色牌，选择一张【舆】置入你的装备区；当你失去装备区里的宝物牌后，你可进行判定，若结果为黑色，将一张随机的【舆】置入你的装备区。",
  qiangshou: "羌首",
  qiangshou_info: "锁定技，若你的装备区内有宝物牌，你与其他角色的距离-1。",
  cheliji_sichengliangyu: "四乘粮舆",
  cheliji_sichengliangyu_bg: "粮",
  cheliji_sichengliangyu_info:
    "一名角色的回合结束时，若你的手牌数小于体力值，你可以摸两张牌，然后弃置此牌。",
  cheliji_tiejixuanyu: "铁蒺玄舆",
  cheliji_tiejixuanyu_bg: "蒺",
  cheliji_tiejixuanyu_info:
    "其他角色的回合结束时，若其本回合未造成过伤害，你可以令其弃置两张牌，然后弃置此牌。",
  cheliji_feilunzhanyu: "飞轮战舆",
  cheliji_feilunzhanyu_bg: "轮",
  cheliji_feilunzhanyu_info:
    "其他角色的回合结束时，若其本回合使用过非基本牌，你可以令其交给你一张牌，然后弃置此牌。",
  weiguan: "卫瓘",
  zhongyun: "忠允",
  zhongyun2: "忠允",
  zhongyun_info:
    "锁定技。每名角色的回合限一次，你受伤/回复体力后，若你的体力值与手牌数相等，你回复一点体力或对你攻击范围内的一名角色造成1点伤害；每名角色的回合限一次，你获得手牌或失去手牌后，若你的体力值与手牌数相等，你摸一张牌或弃置一名其他角色一张牌。",
  shenpin: "神品",
  shenpin_info:
    "当一名角色的判定牌生效前，你可以打出一张与判定牌颜色不同的牌代替之。",
  zhongyan: "钟琰",
  bolan: "博览",
  bolan_info:
    "出牌阶段开始时，你可从三个描述中包含“出牌阶段限一次”的技能中选择一个获得直到此阶段结束；其他角色的出牌阶段开始时，其可以失去1点体力，令你从三个描述中包含“出牌阶段限一次”的技能中选择一个，其获得此技能直到此阶段结束。",
  yifa: "仪法",
  yifa2: "仪法",
  yifa_info:
    "锁定技，其他角色使用【杀】或黑色普通锦囊牌指定你为目标后，其手牌上限-1直到回合结束。",
  ol_huaxin: "OL华歆",
  caozhao: "草诏",
  caozhao_backup: "草诏",
  caozhao_info:
    "出牌阶段限一次，你可展示一张手牌并声明一种未以此法声明过的基本牌或普通锦囊牌，令一名体力不大于你的其他角色选择一项：令此牌视为你声明的牌，或其失去1点体力。然后若此牌声明成功，然后你可将其交给一名其他角色。",
  olxibing: "息兵",
  olxibing_info:
    "每当你受到其他角色造成的伤害后/对其他角色造成伤害后，你可弃置你或该角色两张牌，然后你们中手牌少的角色摸两张牌，以此法摸牌的角色不能使用牌指定你为目标直到回合结束。",
  recaiwang: "才望",
  recaiwang_info:
    "①当你使用或打出牌响应其他角色使用的牌，或其他角色使用或打出牌响应你使用的牌后，若这两张牌颜色相同，则你可以弃置对方的一张牌。②若你的手牌数为1，则你可以将该手牌当做【闪】使用或打出。③若你的装备区牌数为1，则你可以将该装备当做【无懈可击】使用或打出。④若你的判定区牌数为1，则你可以将该延时锦囊牌当做【杀】使用或打出。",
  recaiwang_hand: "才望",
  recaiwang_equip: "才望",
  recaiwang_judge: "才望",
  yangyan: "杨艳",
  xuanbei: "选备",
  xuanbei_info:
    "①游戏开始时，你从牌堆中获得两张具有应变标签的牌。②每回合限一次。当你使用的具有应变标签的牌结算结束后，你可将此牌对应的所有实体牌交给一名其他角色。",
  xianwan: "娴婉",
  xianwan_info:
    "①当你需要使用【闪】时，若你的武将牌未横置，则你可以横置武将牌并视为使用【闪】。②当你需要使用【杀】时，若你的武将牌横置，则你可以横置武将牌并视为使用【杀】。",
  yangzhi: "杨芷",
  wanyi: "婉嫕",
  wanyi_info:
    "每回合每项限一次。出牌阶段，你可以将一张具有应变效果的牌当做【逐近弃远】/【出其不意】/【水淹七军】/【洞烛先机】使用。",
  maihuo: "埋祸",
  maihuo_info:
    "①当你成为其他角色使用【杀】的目标后，若此【杀】不为转化牌且有对应的实体牌且其武将牌上没有“祸”且你是此牌的唯一目标，则你可以令此牌对你无效，并将此【杀】置于其武将牌上，称为“祸”。②一名其他角色的出牌阶段开始时，若其武将牌上有“祸”，则其对你使用此“祸”（有距离限制且计入次数限制，若你不是此牌的合法目标，则改为将此“祸”置入弃牌堆）。③当你对有“祸”的其他角色造成伤害后，你移去其“祸”。",
  xinchang: "辛敞",
  canmou: "参谋",
  canmou_info:
    "一名角色使用普通锦囊牌指定第一个目标时，若其手牌数为全场唯一最多，则你可以为此牌增加一个额外目标。",
  congjian: "从鉴",
  congjian_info:
    "一名其他角色成为普通锦囊牌的唯一目标时，若其体力值为全场唯一最多，则你也可以成为此牌的目标。此牌结算结束后，若你受到过渠道为此牌的伤害，则你摸两张牌。",
  xuangongzhu: "宣公主",
  gaoling: "高陵",
  gaoling_info:
    "隐匿技。当你于回合外明置此武将牌时，你可以令一名角色回复1点体力。",
  qimei: "齐眉",
  qimei_info:
    "准备阶段，你可以选择一名其他角色。你获得如下效果直到下回合开始：①每回合限一次，当你或其获得牌/失去手牌后，若你与其手牌数相等，则另一名角色摸一张牌。②每回合限一次，当你或其的体力值变化后，若你与其体力值相等，则另一名角色摸一张牌。",
  ybzhuiji: "追姬",
  ybzhuiji_info:
    "出牌阶段开始时，你可选择一项：①摸两张牌，并于出牌阶段结束时失去1点体力；②回复1点体力，并于出牌阶段结束时弃置两张牌。",
  jin_yanghu: "羊祜",
  huaiyuan: "怀远",
  huaiyuanx: "绥",
  huaiyuan_info:
    "①游戏开始时，你将你的手牌标记为“绥”。②当你失去一张“绥”后，你令一名角色执行一项：⒈其的手牌上限+1。⒉其的攻击范围+1。⒊其摸一张牌。③当你死亡时，你可令一名其他角色的手牌上限+X，且攻击范围+Y（X和Y为你自己被执行过〖怀远②〗的选项一和选项二的次数）。",
  chongxin: "崇信",
  chongxin_info:
    "出牌阶段限一次，你可重铸一张牌，且令一名有手牌的其他角色也重铸一张牌。",
  dezhang: "德彰",
  dezhang_info:
    "觉醒技。准备阶段，若你没有“绥”，则你减1点体力上限并获得〖卫戍〗。",
  weishu: "卫戍",
  weishu_info:
    "锁定技。①当你于摸牌阶段外不因〖卫戊①〗而摸牌后，你令一名角色摸一张牌。②当你于弃牌阶段外不因〖卫戊②〗而弃置牌后，你弃置一名其他角色的一张牌。",
  jin_jiachong: "贾充",
  xiongshu: "凶竖",
  xiongshu_info:
    "其他角色的出牌阶段开始时，你可弃置X张牌（X为你本轮内此前已发动过此技能的次数，为0则不弃）并展示其一张牌，然后你预测“其本阶段内是否会使用与展示牌牌名相同的牌”。此阶段结束时，若你的预测正确，则你对其造成1点伤害；否则你获得展示牌。",
  jianhui: "奸回",
  jianhui_info:
    "锁定技。当你造成伤害后，若受伤角色为A，则你摸一张牌；当你受到伤害后，若伤害来源为A，则A弃置一张牌。（A为除本次伤害外最近一次对你造成过伤害的角色）",
  xinxuanbei: "选备",
  xinxuanbei_info:
    "出牌阶段限一次。你可选择一名其他角色区域内的一张牌。然后其对你使用对应实体牌为此牌的【杀】。然后若此【杀】，未对你造成过伤害，你摸一张牌；对你造成过伤害，你摸两张牌。",
  xinwanyi: "婉嫕",
  xinwanyi_info:
    "①当你使用【杀】或普通锦囊牌指定其他角色为唯一目标后，你可将其的一张牌置于你的武将牌上作为“嫕”。②你不能使用/打出/弃置与“嫕”花色相同的牌。③结束阶段或当你受到伤害后，你令一名角色获得你的一张“嫕”。",
  jin_guohuai: "郭槐",
  zhefu: "哲妇",
  zhefu_info:
    "当你于回合外使用或打出基本牌后，你可令一名有手牌的其他角色选择一项：⒈弃置一张名称相同的基本牌。⒉受到你造成的1点伤害。",
  yidu: "遗毒",
  yidu_info:
    "当你使用的【杀】或伤害性锦囊牌结算结束后，若此牌目标数为1且你未造成过渠道为此牌的伤害，则你可以展示目标角色的至多三张手牌。若这些牌颜色均相同，则其弃置这些牌。",
  wangxiang: "王祥",
  bingxin: "冰心",
  bingxin_info:
    "每种牌名每回合限一次。当你需要使用基本牌时，若你的手牌数等于体力值且这些牌的颜色均相同，则你可以摸一张牌，视为使用一张基本牌。",

  yingbian_pack1: "文德武备·理",
  yingbian_pack2: "文德武备·备",
  yingbian_pack3: "文德武备·果",
  yingbian_pack4: "文德武备·戒",
  yingbian_pack5: "文德武备·约",
};
export const translate_yxs = {
  yxs_guanyu: "关羽",
  yxs_wuzetian: "武则天",
  yxs_caocao: "曹操",
  yxs_mozi: "墨子",
  yxs_bole: "伯乐",
  yxs_aijiyanhou: "埃及艳后",
  yxs_diaochan: "貂蝉",
  yxs_yangyuhuan: "杨玉环",
  yxs_baosi: "褒姒",
  yxs_napolun: "拿破仑",
  yxs_kaisa: "凯撒",
  yxs_zhuyuanzhang: "朱元璋",
  yxs_jinke: "荆轲",
  yxs_libai: "李白",
  yxs_luban: "鲁班",
  yxs_lvzhi: "吕雉",
  yxs_goujian: "勾践",
  yxs_lishimin: "李世民",
  yxs_huamulan: "花木兰",
  yxs_luobinhan: "罗宾汉",
  yxs_chengjisihan: "成吉思汗",
  yxs_mingchenghuanghou: "明成皇后",
  yxs_wangzhaojun: "王昭君",
  yxs_luocheng: "罗成",
  yxs_direnjie: "狄仁杰",
  yxs_sunwu: "孙武",
  yxs_chengyaojin: "程咬金",
  yxs_yujix: "虞姬",
  yxs_xiangyu: "项羽",
  yxs_yingzheng: "嬴政",
  yxs_yuefei: "岳飞",
  yxs_fuermosi: "福尔摩斯",
  yxs_guiguzi: "鬼谷子",
  yxs_xiaoqiao: "小乔",
  yxs_luzhishen: "鲁智深",
  yxs_handingdun: "汉丁顿伯爵",
  yxs_zhaoyong: "赵雍",
  yxs_yangguang: "杨广",
  yxs_tangbohu: "唐伯虎",
  yxs_zhangsanfeng: "张三丰",
  yxs_nandinggeer: "南丁格尔",
  yxs_weizhongxian: "魏忠贤",
  yxs_lanlinwang: "兰陵王",
  yxs_meixi: "妹喜",
  yxs_qinqiong: "秦琼",

  yxs_fanji: "反击",
  yxs_fanji2: "反击",
  yxs_fanji_info:
    "当你受到【杀】或【决斗】造成的伤害后，你可以对伤害来源使用一张【杀】。若此【杀】为红色，其不可闪避",
  yxs_menshen: "门神",
  yxs_menshen2: "门神",
  yxs_menshen3: "门神",
  yxs_menshen_info:
    "回合结束阶段，你可选择一名其他角色，若如此做，直到你的下回合开始，所有角色对该角色使用的【杀】或【决斗】均视为对你使用",
  zhuxin: "诛心",
  zhuxin_info:
    "出牌阶段限一次，你可以与一名其他角色拼点，若你赢，你对其造成一点伤害",
  wlianhuan: "连环",
  wlianhuan_info: "你使用杀造成伤害时，可以弃置一张装备区内的牌并令伤害+1",
  liebo: "裂帛",
  liebo_info:
    "出牌阶段限一次，你可以将你的手牌与一名其他角色交换（手牌数之差不能多于1）",
  yaoji: "妖姬",
  yaoji_info: "每当你受到一次伤害，你可以将一张乐不思蜀置入伤害来源的判定区",
  guimian: "鬼面",
  guimian_info:
    "锁定技，每当你在出牌阶段使用杀造成伤害，本阶段内出杀次数上限+1",
  lyuxue: "浴血",
  lyuxue2: "浴血",
  lyuxue_info:
    "锁定技，每当你造成一次伤害，若目标没有浴血标记，你令其获得一个浴血标记；当一名角色失去浴血标记时，其流失一点体力；准备阶段，若场上浴血标记的数量不少于存活角色数的一半（向下取整），你清空浴血标记；当你即将死亡时，你清空浴血标记",
  huli: "护理",
  huli_info: "出牌阶段，你可以将一张红桃手牌当作桃对距离1以内的角色使用",
  yixin: "医心",
  yixin_info:
    "限定技，你可以弃置两张牌，然后令一名已受伤角色回复X点体力并摸4-X张牌（X为该角色已损失的体力值且不超过4）",
  xianqu: "先驱",
  xianqu_info: "锁定技，你不能成为点数小于8的杀的目标",
  zbudao: "布道",
  zbudao_info:
    "摸牌阶段，你可以额外摸一张牌，然后将摸到的牌中的一张交给一名其他角色",
  taiji: "太极",
  taiji_info: "每当你使用或打出一张闪，你可以使用一张杀",
  luobi: "落笔",
  luobi_info:
    "结束阶段，可以摸数量等同于已损失体力值的牌，并以任意方式分配给任意角色",
  fengliu: "风流",
  fengliu_info: "锁定技，摸牌阶段，你额外摸X张牌，X为存活女性角色数且不超过2",
  shiqin: "弑亲",
  shiqin_info: "锁定技，其他群势力角色濒死时，你令其立即死亡",
  yjujian: "拒谏",
  yjujian_info:
    "出牌阶段限一次，你可以交给一名其他角色一张牌，该角色的锦囊牌不能指定你为目标直到你的下一回合开始",
  yaoyi: "徭役",
  yaoyi_info: "每当你受到一次伤害，你可以令至多2名非群势力角色交给你一张手牌",
  zyhufu: "胡服",
  zyhufu_info:
    "锁定技，当你的装备区内没有防具牌时，你摸牌阶段额外摸一张牌；当你装备区内有防具牌时，你的手牌上限+5",
  hanbei: "捍北",
  hanbei_info: "锁定技，你的装备区有马时，你的杀不可闪避",
  kuangchan: "狂禅",
  kuangchan_info: "锁定技，你做主公时，不增加体力上限",
  yxsdili: "底力",
  // yxsdili_info:'锁定技，摸牌阶段，你额外摸X张牌，X为你已损失的体力值',
  yxsdili_info:
    "锁定技，摸牌阶段，你额外摸X张牌，X为你已损失的体力值的一半，向上取整且最多为2",
  chujia: "初嫁",
  chujia_info:
    "出牌阶段限一次，你可以弃置两张相同颜色的手牌，指定任意一名角色摸X张牌。(X为该角色已损失的体力值) ",
  zhijie: "知节",
  zhijie_info: "出牌阶段限一次，你的红桃手牌可以当做无中生有使用",
  baihe: "捭阖",
  baihe_info:
    "出牌阶段限一次，你可以弃置一张牌，选择以下1项执行：(1)横置1名未横置角色，该角色摸一张牌；(2)重置一名已横置角色，该角色弃置一张手牌",
  yinyang: "阴阳",
  yinyang_info:
    "出牌阶段限一次，你可以弃置两张手牌并选择3名角色，分别横置或重置这些角色",
  xiushen: "修身",
  // xiushen_info:'锁定技，结束阶段，若场上有横置角色，你摸两张牌',
  xiushen_info: "锁定技，出牌阶段结束时，若场上有横置角色，你摸两张牌",
  yanyi: "演绎",
  yanyi_info:
    "出牌阶段限一次，你可以弃置一张黑色牌，指定1名角色和1种花色，若被指定角色的手牌中含有此花色，则受到1点伤害",
  jiean: "结案",
  jiean_info:
    "每当【演绎】造成伤害时，你可以摸X张牌，并以任意数量分配给任意角色（X为被【演绎】造成伤害角色的已损失体力值）。",
  wumu: "武穆",
  wumu_info: "锁定技，你的黑杀无视距离，红色不计入回合内的出杀限制",
  ysheshen: "舍身",
  ysheshen_info:
    "每当你受到一点伤害，可以观看牌堆顶的两张牌，并将其交给任意1~2名角色",
  sanbanfu: "三板斧",
  sanbanfu_info:
    "当你对其他角色使用杀时，你可以使此杀有如下效果：若对方没有出闪，其受到2点伤害；若对方打出了一张闪，你与其各受到1点伤害；若对方打出了两张闪，你受到一点伤害",
  bingsheng: "兵圣",
  bingsheng_info:
    "出牌阶段限一次，你可以弃置两张花色不同的手牌，指定一名其他角色使其体力值与你相同（体力最多变化2点）",
  taolue: "韬略",
  taolue_info: "锁定技，你的手牌上限+1",
  shentan: "神探",
  shentan_info:
    "出牌阶段限一次，你可以弃置一张牌，获得距离2以内的一名角色的手牌，并可以将其交给任意一名角色",
  hanqiang: "寒枪",
  hanqiang_info: "锁定技，当你没装备武器时，攻击范围+1",
  biaoqi: "骠骑",
  biaoqi_info:
    "锁定技，当你出杀指定目标后，若你的攻击范围大于目标体力值，则此杀不可闪避；若你的攻击范围小于目标体力值，你摸一张牌",
  wluoyan: "落雁",
  wluoyan_info: "锁定技，你防止即将受到的伤害，改为流失一点体力",
  heqin: "和亲",
  heqin2: "和亲",
  heqin3: "和亲",
  heqin_info:
    "限定技，你可以与场上一名男性角色形成【和亲】状态，你与该男性角色于摸牌阶段摸牌数+1。你或者男性角色阵亡时，【和亲】状态消失",
  chajue: "察觉",
  chajue2: "察觉",
  chajue_info:
    "锁定技，你的回合外，你每受到一次伤害，任何【杀】或普通锦囊牌均对你无效，直到你的回合开始",
  tiewan: "铁腕",
  tiewan_info:
    "每当其他角色使用延时类锦囊牌时，你可以立即将一张红色牌当作乐不思蜀使用",
  qianglue: "强掠",
  qianglue_info:
    "每当你的杀被闪避时，你可以进行一次判定，若结果为黑色，你可以获得对方的一张牌",
  xiadao: "侠盗",
  xiadao_info:
    "每当你造成一次伤害，你可以令一名手牌数不少于受伤害角色的另一名角色获得其一张手牌",
  jimin: "机敏",
  jimin_info: "当你的装备区内没有牌时，你可以将一张手牌当作闪使用或打出",
  sheshu: "射术",
  sheshu_info: "锁定技，你的杀无视距离；体力值不小于3的角色不能闪避你的杀",
  tongyu: "统御",
  tongyu_info:
    "出牌阶段，你可以弃置一张牌，并转变为罗宾汉（每回合只能转变一次）",
  lguiyin: "归隐",
  lguiyin_info:
    "出牌阶段，若你本回合内未造成伤害，你可以摸一张牌，并转变为汉丁顿伯爵（每回合只能转变一次）",
  lzhangyi: "仗义",
  lzhangyi_info: "你可以将你弃置的卡牌交给一名其他角色",
  yizhuang: "易装",
  yizhuang2: "易装",
  yizhuang_info:
    "准备阶段，你可以弃置一张牌并选择一名男性角色，获得其所有技能，直到你首次受到伤害",
  kongju: "控局",
  kongju_info:
    "锁定技，你的手牌上限为你的体力上限；当你的手牌数小于体力上限时，你不能成为过河拆桥或顺手牵羊的目标；当你的手牌数大于体力上限时，你不能成为乐不思蜀的目标",
  tuqiang: "图强",
  tuqiang_info: "每当你使用或打出一张闪，你可以摸一张牌",
  zhensha: "鸩杀",
  zhensha_info:
    "当场上有角色进入濒死状态时，你可以弃置一张酒或两张黑色手牌，则该角色立即死亡。",
  xumou: "蓄谋",
  xumou_info: "结束阶段，你可以将武将牌翻面并摸3张牌",
  guifu: "鬼斧",
  guifu_info:
    "出牌阶段限一次，你可以指定一名角色装备区内的一张牌，将其弃掉，自己和对方同时摸取一张牌",
  lshengong: "神工",
  lshengong_info:
    "出牌阶段限一次，你可以选定场上任意一名角色的装备区的非特殊牌，出自己的一张手牌复制该装备，然后可以选择装备上自己或者别的角色的装备区",
  zhexian: "谪仙",
  zhexian_info: "当你于一名其他角色的回合内首次失去牌时，你可以摸一张牌",
  miaobi: "妙笔",
  miaobi_info:
    "出牌阶段限一次，你可以弃置一名其他角色的一张牌，若此牌是基本牌或普通锦囊，你可以将一张手牌当此牌使用；否则你须弃置一张牌",
  cike: "刺客",
  cike_info:
    "你对别的角色出【杀】时可以选择做一次判定：若判定牌为红色花色，则此【杀】不可回避，直接命中；若判定牌为黑色花色，你可以选择弃掉对方一张牌。",
  qiangyun: "强运",
  qiangyun_info: "每当你失去最后一张手牌，可摸两张牌",
  ducai: "独裁",
  ducai2: "独裁",
  ducai3: "独裁",
  ducai_info:
    "出牌阶段限一次，你可以弃置一张牌，则本轮内除你外的角色不能使用或打出与该手牌花色相同的手牌",
  tongling: "统领",
  tongling_info:
    "锁定技，每当一名友方角色造成一次伤害，你获得1个统领标记（标记上限为3）",
  fanpu: "反扑",
  fanpu_info:
    "出牌阶段限一次，你可以移去3枚统领标记并视为对攻击范围内的至多3名角色使用一张杀",
  fenghuo: "烽火",
  fenghuo_info: "你可以将一张装备区内的牌当作南蛮入侵使用",
  yxsweiyi: "威仪",
  yxsweiyi_info: "每当你受到一次伤害，可以令伤害来源弃置两张牌",
  xieling: "挟令",
  xieling_info:
    "出牌阶段，弃掉两张手牌，将任意一名角色装备区或判定区的牌移动到另一名角色对应的区域",
  baye: "霸业",
  baye_info:
    "出牌阶段，你可以将一张牌当做本回合内前一张使用的牌来使用。每回合限用一次。",
  nvquan: "女权",
  nvquan1: "女权",
  nvquan2: "女权",
  nvquan_info:
    "你对男性角色使用【杀】或【决斗】时，对方需连续打出两张【闪】或【杀】响应；你不能成为男性角色的决斗目标",
  qiandu: "迁都",
  qiandu_info:
    "出牌阶段，你可以弃一张黑色手牌，和一名存活的玩家与其交换位置。每回合限一次。",
  budao: "补刀",
  budao_info:
    "你的回合外，你的攻击范围的一名角色受到【杀】的伤害时，你可以对其使用一张【杀】，只要你的【杀】对目标角色造成了伤害，你就可以继续对其使用【杀】。",
  feigong: "非攻",
  feigong_info: "其他角色使用杀时，若你不是杀的目标，可以弃置一张杀取消之",
  jianai: "兼爱",
  jianai_info: "每当你回复一点体力，可以令所有其他角色回复一点体力",
  bolehuiyan: "慧眼",
  bolehuiyan_info:
    "当一名有手牌的其他角色成为来源不为你的杀的目标时，你可以预言此杀能否命中，若预言正确，你摸一张牌，否则你须弃置一张牌。每回合限发动一次",
  xiangma: "相马",
  xiangma_info:
    "锁定技，只要你的体力值大于2点，你的进攻距离+1；只要你的体力值为2点或更低，你的防御距离+1",
  seyou: "色诱",
  seyou_info:
    "限定技，出牌阶段，你可以指定任意1名角色，其他所有男性角色需选择1项执行：（1）对你指定的角色出【杀】；（2）令你获得其一张牌。",
  sheshi: "蛇噬",
  sheshi_info:
    "每受到1次伤害，可以指定1种花色，依次展示牌堆顶的牌，直到出现指定花色的牌为止，你获得与指定花色不同花色的所有牌（最多展示4张牌）。",

  fengyi: "凤仪",
  fengyi_info:
    "出牌阶段，你可以弃一张手牌，指定任意目标摸两张牌。（每回合限用一次）",
  wange: "婉歌",
  wange_info:
    "摸牌时，你可以少摸一张牌，则结束阶段你可以抽取一名其他角色的手牌，至少1张，至多X张（X为你当前的掉血量）。",
  nichang: "霓裳",
  nichang2: "霓裳",
  nichang_info:
    "摸牌时，你可以选择不摸牌，并在结束阶段展示手牌，每少一种花色摸一张牌",
  fengyan: "丰艳",
  fengyan_info: "你可以获得其他男性角色的红色判定牌。",
  zhulu: "逐鹿",
  zhulu_info:
    "回合外，当有普通锦囊牌结算完毕后，你可以立即弃掉一张相同花色手牌或装备区的牌，获得这张锦囊牌。",
  jieyong: "节用",
  jieyong2: "节用",
  jieyong_info:
    "你使用的卡牌结算完成后，你可以弃置一张黑色牌并重新获得之。（每回合限一次）",
  shangtong: "尚同",
  shangtong_info:
    "每当你令其他角色恢复1点血量或掉1点血量时，你可以摸1张牌（摸牌上限为4）",
  feiming: "非命",
  feiming_info:
    "其他角色对你造成伤害时，你可以令该角色须选择1项执行：1，将1张红桃花色手牌交给你；2，流失1点血量",
  yxsrenwang: "人望",
  yxsrenwang_info:
    "出牌阶段，你可以弃掉2张牌并指定一名手牌数大于你的角色，你摸牌至与该角色手牌数相等，每阶段限一次。",
  shiwei: "施威",
  shiwei_info:
    "当其他角色失去最后一张手牌时，你可以将牌堆顶的一张牌背面朝上置于该角色面前，该角色回合，跳过出牌阶段并弃掉这张牌。",
  yxswushuang: "无双",
  yxswushuang_info:
    "出牌阶段，你使用【杀】时可同时打出两张【杀】，则该【杀】具有以下效果之一：1，伤害+1；2，额外指定两个目标",
  xiaoyong: "骁勇",
  xiaoyong_info: "你可以将黑色手牌当作【杀】来使用",
  yxsqinzheng: "亲征",
  yxsqinzheng_info:
    "出牌阶段，你对其他角色造成伤害时，可以令场上任意角色摸一张牌。",
  juma: "拒马",
  juma_info: "你与其他角色的距离始终视为1。",
};
export const translate_zhuogui = {
  nianshou: "年兽",
  nianrui: "年瑞",
  qixiang: "祺祥",
  qixiang1: "祺祥",
  qixiang2: "祺祥",
  nianrui_info:
    "准备阶段和结束阶段，你可以进行一次判定，若结果为红色则摸一张牌",
  qixiang_info:
    "乐不思蜀判定时，你的方块判定牌视为红桃；兵粮寸断判定时，你的黑桃判定牌视为草花",

  mamian: "马面",
  lianyu: "炼狱",
  lianyu_info:
    "出牌阶段限一次，你可以弃置一张红色手牌令场上所有角色受到一点火焰伤害",

  niutou: "牛头",
  manjia: "蛮甲",
  manjia1: "蛮甲",
  manjia2: "蛮甲",
  manjia_info: "锁定技，若你的装备区内没有防具牌，则你视为装备了[藤甲]",
  xiaoshou: "枭首",
  xiaoshou_info:
    "结束阶段，若场上体力值最多的角色只有一个，你可以对其造成一点火焰伤害",
  guiji: "诡计",
  guiji_info:
    "锁定技，准备阶段结束时，若你的判定区内有牌，你随机弃置其中一张牌",

  baiwuchang: "白无常",
  qiangzheng: "强征",
  qiangzheng_info: "锁定技，结束阶段，你获得一名其他角色的一张手牌",
  zuijiu: "醉酒",
  zuijiu_info: "锁定技，你的黑杀造成的伤害+1，造成伤害后须弃置一张手牌",

  heiwuchang: "黑无常",
  suoling: "索令",
  suoling_info:
    "锁定技，结束阶段，你解除横置状态，除你之外的所有角色进入横置状态",
  xixing: "吸星",
  xixing_info:
    "出牌阶段限一次，你可以弃置三张不同类别的牌，对一名其他角色造成一点伤害，然后回复一点体力",
};

export const translate2 = {
  translate_extra,
  translate_diy,
  translate_gujian,
  translate_gwent,
  translate_hearth,
  translate_jiange,
  translate_mobile,
  translate_mtg,
  translate_offline,
  translate_old,
  translate_ow,
  translate_refresh,
  translate_sb,
  translate_shenhua,
  translate_sp,
  translate_sp2,
  translate_standard,
  translate_swd,
  translate_tw,
  translate_xiake,
  translate_xianjian,
  translate_xinghuoliaoyuan,
  translate_yijiang,
  translate_yingbian,
  translate_yxs,
  translate_zhuogui,
};
